[
  {
    "backtime": "",
    "body": "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.0//EN\" \"http://www.w3.org/TR/REC-html40/strict.dtd\">\n<html><head><meta name=\"qrichtext\" content=\"1\" /><meta charset=\"utf-8\" /><style type=\"text/css\">\np, li { white-space: pre-wrap; }\nhr { height: 1px; border-width: 0; }\nli.unchecked::marker { content: \"\\2610\"; }\nli.checked::marker { content: \"\\2612\"; }\n</style></head><body style=\" font-family:'Segoe UI'; font-size:12pt; font-weight:400; font-style:normal;\">\n<p style=\" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;\">An intensive investigation has exposed a Spaniard, who feigned muteness for 16 years to collect disability benefits, revealing her true speaking capabilities despite her deceptive health assertions since a 2003 workplace incident.</p></body></html>",
    "category": "    Weird News",
    "estimated_duration": "",
    "link": "https://www.odditycentral.com/news/woman-fakes-muteness-for-16-years-to-collect-disability-pension.html?utm_source=rss&utm_medium=rss&utm_campaign=woman-fakes-muteness-for-16-years-to-collect-disability-pension",
    "rewrite": "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.0//EN\" \"http://www.w3.org/TR/REC-html40/strict.dtd\">\n<html><head><meta name=\"qrichtext\" content=\"1\" /><meta charset=\"utf-8\" /><style type=\"text/css\">\np, li { white-space: pre-wrap; }\nhr { height: 1px; border-width: 0; }\nli.unchecked::marker { content: \"\\2610\"; }\nli.checked::marker { content: \"\\2612\"; }\n</style></head><body style=\" font-family:'Segoe UI'; font-size:12pt; font-weight:400; font-style:normal;\">\n<p style=\" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;\">An intensive investigation has exposed a Spaniard, who feigned muteness for 16 years to collect disability benefits, revealing her true speaking capabilities despite her deceptive health assertions since a 2003 workplace incident.</p></body></html>",
    "title": "MUTISM FRAUD UNCOVERED IN SPAIN",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "KOKOMO, Miss. (AP) — Myrtle, a cherished pet tortoise, has been reunited with its family in Mississippi weeks after disappearing during a deadly tornado outbreak in March.\n\n“He’s been through a lot,” said Myrtle’s grateful owner, Tiffany Emanuel. “I know that he knows just as much as I do that every step of the way I’m going to be there helping him, caring for him, making sure he gets, you know, the help that he needs.”\n\nThe Emanuel family fled their home in the rural Kokomo area as a tornado hit on March 15. They returned to find two pine trees had fallen on top of their tortoise’s backyard home.\n\nWeeks later, a neighbor found the injured tortoise.\n\nHe was taken to the Central Mississippi Turtle Rescue for medical treatment on April 4.\n\n“The lady who found the tortoise called me and she said she had run into the owners,” said Christy Milbourne, the organization’s founder and codirector. “She said, ‘I think they’re going to be calling you.’ So, I was excited, and then the owners did call and say, ‘Yeah, that’s my tortoise.’”\n\n“It feels good to kind of have some kind of happy out of so much sad and grief and loss,” Emanuel said.\n\nBy entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "category": "    Weird News",
    "estimated_duration": "",
    "link": "https://www.huffpost.com/entry/tornado-tortoise_n_67fce145e4b0b88ef3cc5e92",
    "title": "TORTOISE LOST IN MISSISSIPPI TORNADO FINDS ITS WAY BACK TO FAMILY WEEKS LATER",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.0//EN\" \"http://www.w3.org/TR/REC-html40/strict.dtd\">\n<html><head><meta name=\"qrichtext\" content=\"1\" /><meta charset=\"utf-8\" /><style type=\"text/css\">\np, li { white-space: pre-wrap; }\nhr { height: 1px; border-width: 0; }\nli.unchecked::marker { content: \"\\2610\"; }\nli.checked::marker { content: \"\\2612\"; }\n</style></head><body style=\" font-family:'Segoe UI'; font-size:12pt; font-weight:400; font-style:normal;\">\n<p style=\" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;\">In a potentially controversial incident, Toby Carvery has faced criticism for removing an ancient oak in North London. The restaurant chain maintains that the tree was a safety hazard, while the Enfield Council considers it a criminal act.</p></body></html>",
    "category": "    Weird News",
    "estimated_duration": "",
    "link": "https://news.sky.com/story/ancient-oak-tree-felled-in-north-london-park-13349431",
    "rewrite": "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.0//EN\" \"http://www.w3.org/TR/REC-html40/strict.dtd\">\n<html><head><meta name=\"qrichtext\" content=\"1\" /><meta charset=\"utf-8\" /><style type=\"text/css\">\np, li { white-space: pre-wrap; }\nhr { height: 1px; border-width: 0; }\nli.unchecked::marker { content: \"\\2610\"; }\nli.checked::marker { content: \"\\2612\"; }\n</style></head><body style=\" font-family:'Segoe UI'; font-size:12pt; font-weight:400; font-style:normal;\">\n<p style=\" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;\">In a potentially controversial incident, Toby Carvery has faced criticism for removing an ancient oak in North London. The restaurant chain maintains that the tree was a safety hazard, while the Enfield Council considers it a criminal act.</p></body></html>",
    "title": "CARVERY UNDER FIRE FOR FELLING OAK",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\n                Our small-group adventures are inspired by our Atlas of the\n                world's most fascinating places, the stories behind them, and\n                the people who bring them to life.\n              \n\n\n            No search results found for\n            “”\n          \n\n\n            Make sure words are spelled correctly.\n          \n\n\n            Try searching for a travel destination.\n          \n\nOn October 5, 1936, 200 men from Jarrow in Northumberland, England, began a protest march to Parliament to call for economic assistance in northeast England. Taking place during an economic depression, the march took 26 days and covered 282 miles. Today, the historic protest is known as the Jarrow March.\n\nNorthumberland and northeast England had long been a center of shipbuilding and steel manufacturing, but in 1936 thousands were unemployed, nearly 80% of all workers at its peak.\n\nDavid Riley, who was head of the Jarrow council, and Ellen Wilkinson, a local member of Parliament, led the crusade.\n\nThe demonstration is often described as a \"Hunger March\" and has become a landmark event in British organized labor and radical politics.\n\nThe marchers arrived in Westminster close to the opening of Parliament, where they presented a petition signed by 12,000 residents of the town of Jarrow. Supporters in towns and villages hosted the crusaders. And at the end of each day's march, Ellen Wilkinson made a speech at a public meeting.\n\nInstead of listening to Riley and Wilkinson's demands, the government cut off the marcher's unemployment benefits, claiming the crusaders had been unavailable for work during their 26-day protest.\n\nThe Jarrow March has gone on to inspire numerous artists, and an opera, two musicals, three pop songs, five plays, and several works of art have been created about the event.\n\nAlthough the Jarrow  Crusade is a widely remembered and oft-celebrated celebrated event, it had little effect on the government in the short term.\n\nDespite a temporary boost from World War II, shipbuilding and steel manufacturing slowly disappeared from Jarrow and nearby South Shields and is nearly nonexistent today. \n\nIn honor of the 65th anniversary of the Jarrow Crusade, sculptor Graham Ibbotson created a commemorative bronze in 2001. The sculpture was installed in the parking lot of the Viking Shopping Center, near Jarrow town center. Ibbotson entitled the piece The Spirit of Jarrow.\n\nSituated on a brick plinth, the bronze depicts two marchers carrying a banner proceeded by a woman, two children, and a mongrel dog which became a mascot of the march.\n\nIn reality, the Jarrow marchers were selected from the \"fit-men\" of the town and no children took part. Apart from Ellen Wilkinson, women did not take part directly in the march, but played a crucial supporting role. \n\nThese edits were intentional: Ibbotson strove to represent the wider political  \"crusade\" rather than just the march itself.\n\nIn The Spirit of Jarrow, bronze figures are depicted walking through the ribs of a steel vessel as if it were under construction. There are also various depictions of the tools used by local skilled workers.\n\nSeveral other Jarrow public art pieces also commemorate the March. One inspiring example is a low-relief steel sculpture by Vince Rea in the local Metro station.\n\n\n                      April 15, 2025\n                    \n\nStudent protesters used these bells as symbols of defiance in the early 1970s.\n\nA relic of Poland's shipbuilding past, reborn as a sky-high lookout.\n\nThis restored 19th-century calender, a machine used in rubber manufacturing, commemorates the town's local industry.\n\nThe Route 66 institution that inspired Taco Bell also served as an important headquarters for Mexican-American social movements.\n\nThe historic home of the pivotal political activist who led the Métis people in rebellion against the Canadian government.\n\nBombed and burned, this monument represents the often controversial ties between Vietnam and Cambodia. \n\nLocated at the former Lorton Prison the Lucy Burns Museum tells the story of the 91 year history of the prison including the dark chapter of its involvement in the women's suffrage movement.  \n\nThis North Carolina store preserves a historic moment in America's movement for racial equality. \n\nBecome an Atlas Obscura member and experience far fewer ads\n\n\n      © 2025 Atlas Obscura. All Rights Reserved.\n    ",
    "category": "    Weird News",
    "estimated_duration": "",
    "link": "https://www.atlasobscura.com/places/the-spirit-of-jarrow",
    "title": "THE SPIRIT OF JARROW IN JARROW, ENGLAND",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "April 15 (UPI) -- A total 918 people sat down at 150 tables to play simultaneous games of Monopoly and break a Guinness World Record in Australia.\n\nThe record attempt in Sydney was organized by the Little Legs Foundation, a charity that raises funds and awareness for children with brain cancer, and Sue-Ellan and Marino Vasiliou, whose daughter, Alegra, died of brain cancer at the age of 6 in 2017.\n\n\n\"We really wanted to create a space that allowed for both young and old to come together, celebrate her and accomplish something that everyone would be proud of,\" Sue-Ellan Vasiliou told Guinness World Records. \"All whilst raising awareness for the disease that took our daughter -- brain cancer.\"\n\nThe attempt was the second organized by the Little Legs Foundation, after a previous attempt for the most people playing Monopoly fell 30 people short of the previous record of 733.\n",
    "category": "    Weird News",
    "estimated_duration": "",
    "link": "https://www.upi.com/Odd_News/2025/04/15/australia-Guinness-World-Records-Monopoly/8901744748424/",
    "title": "918 PEOPLE PLAY MONOPOLY IN AUSTRALIA TO BREAK WORLD RECORD",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Mistakes happen, but microwaving styrofoam is pretty high on the list of blunders that you should really try to avoid. In fact, it's one of the biggest mistakes people make when reheating food. Here's the thing — in some scenarios, it's fine, while in others, melted material can leach styrene, which has been linked to cancers, into the food you're reheating. The primary solution? Never microwave these containers without first checking their label. If a styrofoam container is microwave safe, it has a tiny symbol with wavy lines. If it doesn't, the material isn't FDA-approved, and there is no guarantee it can withstand high temperatures without leaching your food. \n\nStrictly speaking, accidentally consuming styrene-contaminated food isn't likely to cause significant harm. However, cumulative damage could be harmful. It's not just a risk of cancer, either; microwaving styrofoam presents a serious fire hazard. The cheap and unsustainable material is extremely flammable. Even if you evade a fiery furnace, nobody wants to open a microwave door with anticipation and be greeted by melted styrofoam. Probably best to avoid picking out surviving bits of — now contaminated — takeout in those circumstances.\n\nIn summary, microwaving styrofoam containers is not a good idea. At best it's a gamble. Check for that all-important symbol, but better still, decant the contents onto a trusted microwave-safe plate if in any doubt. It's better to be safe than sorry (and, yes, it is dangerous to put styrofoam in the oven, so don't get any other bright ideas).\n\nUnfortunately, it's hard to tell if food or drink has been contaminated, so prevention is essential. Unless you chemically test the food you've reheated in a styrofoam container, err on the side of caution. Often, changes are not visible to the naked eye, and such advanced testing is not feasible at home. It's a similar reason to why it isn't safe to drink bottled water left in the sun; it's (usually) an invisible gamble. If you suspect that food has been contaminated? The best course of action is putting it in the bin.\n\nWith that said, there might be tell-tale warnings. Pay attention to red flags like unusual tastes, aromas, and color changes. These signs could be indicators that chemical contamination has silently taken place. Since polystyrene leaches when melted, container damage is an obvious cause for concern. Otherwise, invest wholeheartedly in prevention. Purchase a trusted rotation of microwave-safe alternatives, including ceramics and purpose-made glass or plastic containers. Avoid materials that are known to leach, like styrofoam, and play it safe with responsible reheating.",
    "category": "    Unusual Food News",
    "estimated_duration": "",
    "link": "https://www.tastingtable.com/1831439/can-you-microwave-styrofoam-what-happens/",
    "title": "WHAT HAPPENS IF YOU ACCIDENTALLY MICROWAVE STYROFOAM TAKEOUT CONTAINERS",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Starbucks' spring menu dropped last month, but rumors have already begun circulating about a summer edition—and it includes an all-new drink.\n\nSocial media user @snackolater first shared the news on Instagram Monday. \"Oh look at Starbucks trying to get us feeling warm and sunny early with a little sneak peek of Summer in April!\" they wrote online, before adding that there will \"likely be more items\" than just the three. \n\nStarbucks officially confirmed the May drop—and it includes an Oatmilk Shaken Espresso \"inspired by the beloved Latino beverage, horchata,\" and two returning favorites: The Summer Skies Drink and Summer-Berry Lemonade Refresher. \n\nAnd while the Seattle-based coffee giant has yet to release an official description for the new Iced Horchata Oatmilk Shaken Espresso, the Mexican drink is traditionally made from rice, milk, vanilla, and cinnamon. According to a Reddit thread, the recipe will use a new flavored syrup. Creator @markie_devo seemingly confirmed as much with his own alleged ingredient breakdown. It includes \"Starbucks Blonde Espresso combined with new horchata syrup that delivers a fusion of cinnamon, vanilla, and rice flavors shaken together with ice and topped with oat milk,\" he reported on Instagram.\n\nThe Summer-Berry Lemonade Refresher and Summer Skies Drink both made their debut last year and are great (much sweeter) alternatives for non-coffee drinkers. The former beverage is exactly what it sounds like: a mix of lemonade and berry flavors, while the latter has juicy raspberry-flavored pearls (like what you'll find in a boba tea) and creamy coconut milk.\n\nCustomers quickly took to the Instagram comment section to share their thoughts on the summer menu and praised both the new and returning drinks. \"The blue skies drinks are really good, so I’m happy they are bringing that back,\" one user wrote. \"Summer berry lemonade refresher, let's go!!! I wish it stayed all year,\" another wrote. \n\n\"Finally Starbucks is stepping up there ice coffee game with adding a horchata shaken expresso to the mix,\" a third person commented.\n\nMegan Schaltegger is an NYC-based writer. She loves strong coffee, eating her way through the Manhattan food scene, and her dog, Murray. She promises not to talk about herself in third person IRL.\n\nWe may earn commission from links on this page, but we only recommend products we back.\n\n©2025 Hearst Magazine Media, Inc. All Rights Reserved.",
    "category": "    Unusual Food News",
    "estimated_duration": "",
    "link": "https://www.delish.com/food-news/a64490981/starbucks-summer-menu-sneak-peek/",
    "title": "STARBUCKS JUST REVEALED THEIR SUMMER MENU & IT INCLUDES AN ALL-NEW DRINK",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "If you’ve been itching to welcome spring into your space, just start decorating with warm and sunny pieces. Tons of vendors stock bright floral and pretty pastel pieces this time of year. Case in point? Costco just debuted a lineup of cute tufted accent rugs that’ll bring a bit of sunshine to any place you put them in. And you’ll want to put them everywhere because the memory foam backing makes it feel like you’re cushioned by a cloud.\n\n“Supercute and soft, cushy accent rugs at Costco!” Angela from Costco Guide on Instagram wrote in a recent caption, calling out the drop.\n\n“I have the butterfly, lemons, and roses,” one person commented on Angela’s origincal post. Another said, “We got two and love them.” And someone else commented, “Love these. Got the lemon one.”\n\nThe rugs come in four different prints — a classic pink floral on a navy background, an Italian-inspired bright bunch of lemons, an adorable strawberry and blossom motif, and one with a bumblebee featuring sprigs of lavender. These appear to be an in-store exclusive item. So if you like what you see, make sure you grab one during your next Costco trip.\n\nThe memory foam underneath the tufted top makes these accent rugs awesome for areas where you stand a lot — think in front of your kitchen sink or island, in front of your bathroom vanity, or in your home office if you have a standing desk. The memory foam cushions and supports the arches of your feet so you feel more comfortable when standing for long periods of time.\n\nEach rug measures about 38 inches long by 22 inches wide, so they’re also a great size to use in your mudroom or in front of your front door to catch excess mud and dirt when you enter your home.These mats are going for just under $15 each, and they’re pretty good quality, according to the reviews. If you buy one for spring, you’ll likely be able to use it for so many seasons to come. Now if only picking your favorite print was as easy as deciding to get one in the first place!This post originally appeared on Apartment Therapy. See it there: Costco’s Fruit- and Flower-Covered Rugs Will Make You Feel Like You’re Walking on Sunshine (They’re Seriously So Cute!)\n\nEnjoy a daily dose of recipes, grocery finds, clever kitchen tips, and more.\n\nBy subscribing, you acknowledge and agree to our Terms of Use and Privacy Policy.\n\n© 2025 Apartment Therapy, LLC / Terms of UsePrivacy PolicyEU and US State Data Subject Requests",
    "category": "    Unusual Food News",
    "estimated_duration": "",
    "link": "https://www.thekitchn.com/costco-memory-foam-accent-rugs-23720049?utm_source=RSS&utm_medium=feed&utm_campaign=Category%2FChannel%3A+main",
    "title": "COSTCO’S FRUIT AND FLOWER RUGS ARE SERIOUSLY SO CUTE — AND JUST $15",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "All products are independently selected by our editors. If you buy something, we may earn an affiliate commission.\n\nThere are plenty of travel mugs to choose from out there—from the cheap plastic kind sold at your corner convenience store to fancy stainless steel double-walled vacuum insulated products that promise to enhance your active, outdoorsy lifestyle. Our picks are primarily focused on coffee drinkers, but whether you plan to use a travel tumbler as a conveyance for hot coffee and tea, cold brew, or ice water—or a combination of all those things—read on to learn which travel mug is the best fit for you.\n\nThis vacuum-insulated, double-walled travel mug does an incredible job keeping liquids hot for hours and is about as leakproof as it gets, all while being lightweight and slim.\n\nWhile not an easily sippable tumbler, this container is excellent at preventing leaks; the spout is totally seals with a push-button, click-into-place lid that features a silicone stopper, and all of that additionally closes up with a sliding lock. This makes it ideally suited for public transportation commuters who might be tossing their entire coffee container inside their bags at a moment’s notice. If you want to avoid residual spills, this one’s for you. Don’t just take our word for it: This mug has 4.7 stars from over 33,000 reviewers on Amazon, too.\n\nThis is less of a coffee cup and more of a Thermos-style carafe. Drinking out of the inset spout is a little more cumbersome than some other tumblers with sipping lids that we tested. It’s also not dishwasher-safe (a common trait among vacuum-insulated vessels) and it’s not the easiest to handwash due to its small opening; however the inside of the bottle has a BPA-free nonstick coating, so it shouldn’t need regular scrubbing. All sizes of this bottle have a smaller diameter, which is great for slipping into a bag, but won’t fit snugly in a standard car cupholder. The tallest 20-ounce model also might have trouble fitting under a single-serve coffee maker.\n\nSippable, slider-style coffee tumblers with leakproof lids are tough to crack, but Owala seems to have done it with this relatively new product.\n\nWe were able to fill the SmoothSip Slider with liquid and shake it upside-down with no drips or spills. The screw-on lid has a silicone gasket all the way around the outside, and its sipping spout opens and closes with a push-down-and-slide motion on its central button-like mechanism. If that sounds complicated, it isn’t. Once you get the hang of disassembly, the whole lid easily comes apart in three washable pieces. Its tapered, squarish bottom fits easily into most cupholders and bags’ bottle pouches. More than half a year after my initial tests, I’m still using the Owala as my everyday coffee cup (two of them, in fact: the small one for hot coffee and the larger one for cold drinks) and it still passes the upside-down test.\n\nUnlike the slimmer cups we tried from Zojirushi and brands like Miir and Fellow, this one feels pretty bulky in your hand, though not nearly as cumbersome as some similarly sized Yeti and Stanley tumblers. Finally, the heat retention over five hours was not as impressive as the Zojirushi or other, better insulated mugs, but it sufficed for hot coffee or tea drunk within a couple hours of putting on the lid.\n\nIf the one thing stopping you from bringing your coffee on the go instead of buying another cup from the coffee shop is the cleaning aspect of a nice travel mug, consider the Brümate Nav.\n\nIt offers a leakproof, flip-top locking lid design that’s also easily sippable, plus a dishwasher-safe cup. The lid’s drinking spout has a secure silicone stopper that, even when the additional sliding lock mechanism is not engaged, still creates a strong seal that stood up to our upside-down shake test. Heat retention is good, offering hot (enough) coffee for up to four hours, as the product description promises (though after five hours we measured a significant drop). The tapered bottom of the cup is covered by a removable silicone sleeve, which adds extra grip while holding it, and a little anti-tip insurance on our desk. (You can also change the sleeve, which is available in a variety of colors as an accessory for customization.)\n\nLike the Owala, long-term heat retention wasn’t at Zojirushi levels in this cup, though it delivered on keeping our drinks hot for the first hour or two. This mug used to come in a smaller size, but now only comes as a 25-ounce or 35-ounce tumbler. Generally speaking insulated tumblers retain more heat when they are full, so if you only require 8 to 12 ounces of coffee to get going in the morning, you’ll likely find even the 25-ounce model too big for your needs, in addition to losing heat when less than half-filled. (For a similar alternative, consider the Brümate Müv, which we tested below.) Finally, the locking lid is impressively leakproof but requires a bit of force to lock, unlock, and flip the sipping spout cover. For quick, eyes-on-the-road opening from a fully locked position, we preferred the Owala.\n\nMost colors of the Nav are dishwasher safe, but a few premium finishes are hand wash. Double check your individual preference for details.\n\nIn addition to toting these mugs along as our everyday coffee cups, we pitted each head to head in a five-hour test to determine heat retention of freshly poured hot liquid into the containers, which were not preheated. (Some manufacturer instructions advise that preheating your cup with hot water before you pour in your drink will offer better heat retention, a step we assumed most users wouldn’t bother doing.) We also closed each mug and tipped them upside-down to check their leakproof status, as well as shaking, walking, and commuting with them to see how they fared on the go.\n\nThe ideal travel mug can be tossed into a commuter bag, purse, or backpack without worrying about it leaking, so a good seal was a must. Ideally, the mug would also be as spill-proof as possible when tipped, even with the lid open.\n\nThe better a mug held the temperature of whatever was initially poured into it, the better it fared in our results. While some of the other carafe-style mugs we tested might seal and hold onto heat a bit better than a tumbler-style, factors like ease of drinking also played a role in overall performance.\n\nDoes the locking or closing mechanism work without much effort or thought? Is the mug easy to hold in one hand and carry on the move? How awkward was the spout or opening for drinking? Can the cup be cleaned with a quick scrub, and does the lid have too many moving parts or hidden crevices where gunk can build up?\n\nYes, looks matter. While it might not be the most important factor, we wouldn’t give as high of marks to a less aesthetically pleasing mug that does the same job as something sleeker but is more worthy of showing off on your desk. While most of the stainless steel travel mugs we tried function similarly when it comes to insulation, sometimes over-designed products have unintended quirks.\n\nThis might seem like a no-brainer, but in the age of giant water jugs all over WaterTok and hefty vacuum-insulated stainless steel tumblers, you do indeed need to test whether a travel mug (or water bottle, for that matter) will fit whatever vehicle you’re travelling in, whether on your daily commute or a long road trip. And while slimmer might seem better and more universal, small diameter carafes jostle around when you hit bumpy terrain, so a secure cupholder fit is worth considering.\n\nYETI Rambler 20-Ounce Tumbler with MagSlider Lid, Cosmic Lilac\n\nPeople love their stainless steel Yeti mugs, and there’s a good reason for that: They’re a well-built, affordable option that comes in a bunch of fun colors and swappable list styles. We think the Magslider lid by Yeti is a great option if you are mostly keeping your drink in a cupholder or on your desk, as its lid slides open and snaps shut easily; however, it is by no means leakproof, which is why it doesn’t take the top spot when compared to the Owala. The entire thing is dishwasher safe, so we’d also consider it a strong runner-up to the Brümate, too.\n\nIf water or cold beverages are your primary concern, then we also like this handled mug version of the Rambler for the same reasons we like the Magslider Rambler, with the added benefit that the Stronghold lid is slightly more leak-resistant (but not as leakproof as the Owala or Brümate). The high-set handle and tapered bottom keep this large mug cupholder-friendly, too. But you’re stuck with only 20- and 30-ounce options, so it’s probably not going to be the top pick for pour-over and espresso machine users.\n\nWhen it comes to capacity, Yeti’s Rambler Mug collection does offer the more coffee-friendly array of options, with 10-, 14-, and 24-ounce sizes. The downside is that none are cupholder compatible, and all come with the Magslider lid which isn’t ideal, especially when the leaking liquid is extremely hot coffee. The handle wasn’t the most ergonomic either, but if you’re camping, hanging out at the beach, or using one of these on your desk, they’re great at being mugs without looking like giant water jugs.\n\nYeti’s Hotshot Cap essentially turns its water bottles into hot beverage-ready travel mugs. The lid can be twisted to an open or closed position, and then you can drink from any part of the rim. When sealed tight, this makes it the most leakproof of the Yeti mugs we tested. But similar to the Miir 360, it leaves too much room for human error when relying on that seal to keep the contents of a backpack protected from drops and spills. Yeti bottles are also not designed as universally cupholder compatible, but with this one, you may get lucky.\n\nThis bottle-style tumbler may come closest to Zojirushi, with its excellent heat insulation and leakproof, flip-up lid that snaps securely in place. However, the lid is difficult to open without using two hands and it can also get in the way of your nose when sipping. Cleaning is a little trickier; it took us a while to figure out that the locking mechanism pops out, not as separate pieces but enough to get a thorough cleaning inside your dishwasher. (Unlike the Zojirushi, it’s dishwasher safe, so while not as completely immune to leaks and drips, it’s a trade-off worth considering.)\n\nTake everything we liked about the Brümate Nav, add a handle, and you get the Müv. It has all the same features, but also comes in a smaller 15-ounce size which we found more convenient for a single cup of coffee, though we also found it didn’t retain heat as well as the larger sizes. The handle also means the smaller size may not be cupholder compatible, but the taller Müv models should work for a typical cupholder. Another feature of the lid we found we liked over time, which wasn’t immediately apparent on the handleless Nav, is that instead of utilizing a threaded, screw-on system, there are eight notches around the lid and eight bumps inside the cup which allow you to easily adjust the sipping spout. This is ideal for both right- and left-handed users to position the lid how they wish, and also means if you like to hold your mug at an angle other than 90 degrees from your face, you can. Like the Nav, most colors are completely dishwasher safe, but double check the description if that feature is important to you.\n\nFor sheer design aesthetics, we wanted to love this slim and compact mug with its minimalist push-button top that takes up nearly the entire lid, leaving just a sippable crevice all the way around. The only issue we had is that, due to its monochrome, minimalist design, it was difficult to tell if the lid was in the open or closed position. When absent-mindedly tossing your cup into your bag, this can spell disaster. The lid doesn’t disassemble in a way that satisfies our desire for thoroughly cleaned parts, though it is completely dishwasher safe. And we also found that, unlike the Stanley AeroLight, the Miir would often hold onto a few residual drops of coffee after closing, so while it was leakproof when closed, it wasn’t drip-free.\n\nSimilar to the 360, the flip-top lid creates a reliably leakproof seal and the container itself is great at keeping coffee hot. The main issue we had was, like the Stanley AeroLight and Fellow Carter Slide, the lid gets in the way when drinking and, because the underside comes into contact with your coffee, sometimes leaves a little drop on your nose, too.\n\nConsidering its price, we expected more from this bottle which, in its own way, tries to do a lot. It comes with three lids: one for sipping hot liquids and one for storing hot liquids, plus a re-freezable lid for chilling a 12-ounce beverage. It’s lightweight but still has fantastic heat retention; however, the lids leak. Our test included leaving sealed tumblers upside-down for 30 minutes, and every single one left a puddle on the counter.\n\nKlean Kanteen Wide Double-Walled Mug with Leakproof Café Cap\n\nLike the Stanley AeroLight, we have very few negative things to say about Klean Kanteen’s double-walled mug. It has a truly leakproof cap, along with the ability to fully dissemble it. It’s dishwasher safe, and carries a lifetime warranty. But we found the lid mechanism, like the AeroLight, required two hands to open, making it less than ideal for sipping on the go.\n\nGiven its reputation for quality, user-friendly products, we expected (and got) a quality, leakproof, and dishwasher-safe mug from Oxo. What we didn’t get was a very user-friendly lid which, while it does come apart completely for thorough cleaning, requires some clunky and convoluted reassembly steps. There are other dishwasher-safe tumblers on this list with lids that are much easier to use.\n\nWe like the range of colors and sizes (as small as 6 ounces) and the traditional coffee cup feel of this mug, but it lacks cupholder compatibility in any of its sizes and only sports a splash-proof lid that doesn’t seal completely. Plus, unlike some of Hydro Flask’s other containers, these are not dishwasher safe.\n\nIf we’re grading purely on looks, this streamlined thermal mug with a ceramic-lined interior and one-handed sliding lid (that’s also leakproof) is stunning. As a hot drink container, it certainly delivers on keeping coffee warm; however, we found its unique lid design kept smooshing against our noses when drinking from it, and we found there was always residual coffee left in the cup that just couldn't be tipped out with the lid on. While the container portion of the mug didn’t hold onto stains and smells, we found the lid did smell like coffee after cleaning. If you’re switching up what liquids you’re putting inside, this may be an unwelcome problem.\n\nUnlike the Slide, consider this to be more of a coffee transporter than a travel mug. You can drink from its open-mouth design, which includes a removable splash guard (we liken the experience to sipping from a soda can). But the screw-on lid requires two hands to open and close, making it less than ideal for taking quick sips while driving. With its open design, if you hit a speed bump, coffee splashes out every time. In its defense, with the lid on tight, this kept coffee satisfyingly hot for nearly 24 hours. So, if you’re taking your cup to-go but not drinking it until you get to your destination, this could be a winner.\n\nThis is another beautiful travel mug that does the job of keeping drinks hot and preventing leaks when fully sealed shut. We also liked that the two-piece lid—a sipping portion and a separate handled cap—comes off from the base for easy pouring into the container. However, the Japanese houseware brand’s form can’t overcome its functionality issues as an on-the-go mug, which include two-handed operation to open, and having to hang onto the cap in your spare hand while you drink.\n\nIf affordability in a car commuter cup is your main goal, there’s a lot to like about Thermos’ mug with its high-set handle (retaining cupholder compatibility) and respectable heat retention. Plus, it’s got a rubber base to absorb accidental nudges, a possible issue due to its slightly top-heavy design. But the sliding lock lid is nowhere near leakproof; it just keeps coffee from fully splashing out when closed. Overall, the mug is durable and dishwasher safe. It’s not perfect but it’s practical.\n\nWe love the old-school, speckled enamelware aesthetic of this mug, which holds heat well and is generally leakproof (but not commuter bag approved). The cork-lined handle has a nice feel, though it may dissuade you from cleaning it in the dishwasher which, while not recommended by the manufacturer, is possible. But a scan through reviews from longer-term users found durability issues cited often enough that we wouldn’t recommend this one for daily wear and tear.\n\nKeepCup 12oz Reusable Coffee Cup With Natural Cork Band\n\nWe like a brand that keeps things relatively crunchy, and this cork-banded glass cup offers an elegant version of that. However it’s not insulated, so it loses heat too quickly compared to the competition, while also feeling hot anywhere but the cork grip. Plus, it leaks, so it’s really more of a desk or office cup than something we’d want to take on a walk.\n\nIf you’re really tight on space and want to be able to crush your coffee cup down to about the size of a can of tuna when not in use, then this is the mug for you. OK, so it’s more of a cup you would have in your bag for an “in case of” situation than it is a daily commuter cup. It does work for coffee, but it’s not insulated, so don’t expect leisurely sips to still be warm hours later. Our main gripe is with the number of parts this cup comes with and must be kept track of in order to use it.\n\n© 2025 Condé Nast. All rights reserved. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices",
    "category": "    Unusual Food News",
    "estimated_duration": "",
    "link": "https://www.bonappetit.com/story/best-travel-coffee-mugs",
    "title": "BEST TRAVEL COFFEE MUGS (2025) FOR ROAD TRIPS AND YOUR MORNING COMMUTE",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "For this sweet version of kolaches, a soft, yeasted dough is heaped with your choice of a berry or cheese filling.\n\n The best thing about being from Texas is that there are so many ways to be a Texan. Texas has a diverse culinary background—it’s not all just smoked ribs and brisket down here. You will find numerous cuisines celebrated throughout the state, many of which were brought here by different immigrant populations. A dish that embodies the Lone Star State’s fusion of cuisines is the kolache. Originating from the Czech Republic as a popular Easter treat, these pillowy soft pastries are popular throughout Texas all year long. Texan versions are often heaped with the traditional Czech sweet fillings like fruit jam, poppy seeds, or a sweet cheese, while savory versions in Texas can be filled with just about anything (I’ll get into that below).\n\n\n In the mid-1800s Czech immigrants started settling in Texas. (According to the Texas State Historical Association, the abundance of good, relatively inexpensive farmland in Texas undoubtedly provided the chief motivation for this wave of Czech immigrants.) By the early 1900s Czech bakeries were found throughout the state. Kolaches became a staple breakfast and snack for locals and tourists alike. Today kolaches are everywhere up and down Highway 35, the artery that runs through the state from top to bottom.\n\n\n As a kid from Garland, Texas, I have a lot of fond memories of taking adolescent road trips with my friends to the exciting city of Austin, and a highlight of these excursions was always stopping by the city of West along the way to pick up kolaches before hitting Travis County. Czech Stop in West was (and still is) one of my favorite kolache bakeries. Their kolaches are bursting with fruit fillings, including strawberry, blueberry, and apricot. \n\n\n Kolaches are still one of my favorite comfort foods and I’m thankful that now as an adult I can wake up any morning in Austin and drive ten minutes to a bakery where I have my pick of kolaches with a variety of creative, flavorful fillings. But for those of you who aren’t in Texas or within driving distance of a Czech bakery, my recipe below is a great stand-in for that experience.\n\n\n In Austin, the city that’s been my home now for many years, you can have your pick of great kolaches with a range of fillings. As mentioned above, you’ll find kolaches with traditional Czech fillings like apricot, poppy seed, berry, plum, and sweet cheese—both separately or sometimes fruit and cheese baked together in one kolache—but you’ll also see an array of savory kolaches, with their own Texan spin on them, including ones stuffed with jalapeños and cream cheese, as well as my favorite, boudin—a rice and pork sausage originally from Louisiana. \n\n\n As a Texan chef, I’ve even put my own creative spin on kolaches for the supper clubs I host. I’ll serve South Indian–style kolaches, including one filled with confit whole carrots and another with mango- and saffron-infused cream cheese. I’m currently working on a recipe for a savory kolache filled with brûléed queso. The point is that in Texas, there’s no wrong way to fill a kolache.\n\n\n While kolaches fillings can run the gamut, and there’s endless room for creativity with them, my recipe below is a classic take on sweet kolaches. I’ve included two traditional filling options: strawberry jam (but you can substitute with your preferred berry) and a sweetened cream cheese filling. The fillings are both simple to prepare and can be made a couple of days before you’re planning to fill and bake the kolaches. Each filling recipe is written to make enough for a full batch of kolaches, but if you’d like to make both, halve each filling to prepare six of each (or double the dough for a full batch of each).\n\n\n While kolaches are considered pastries, they aren’t made with a classic flaky, crumbly pastry dough. Instead, kolache dough is an enriched bread dough that’s pillowy and light, but still has a distinct bread-like chew that’s sturdy enough to support a generous portion of filling. To achieve the right dough texture, the yeasted dough is enriched with milk, egg yolks, and butter. The added fat of all three ingredients coats the flour during kneading, which limits the gluten development slightly to create a more tender dough. A lengthy kneading of the dough in the stand mixer traps air in the dough, so when proofed and baked the dough has a light, springy texture.\n\n\n The resulting dough is soft enough that when shaped into round buns and gently pressed down in the center, the buns will hold their scooped shape for the fillings to be nestled into. I recommend using the bottom of a greased two and a half– to three-inch diameter mug, glass jar, or measuring cup to get a perfectly round indentation.\n\n\n Once the kolaches are shaped, the edges are brushed with an egg wash to enhance browning in the oven and to create an attractive sheen, just like my favorite bakery versions. A heaping tablespoon of the filling of your choice is added to the divet in each bun. Once filled, the kolaches get a generous sprinkle of a cinnamon-spiked streusel topping known in Czech as posypka, then all 12 kolaches are fit onto one sheet tray. It’s not only OK but actually preferred that their edges touch and fuse together while baking—another “fresh from the bakery” visual cue.\n\n\n Let them cool for at least 30 minutes so the filling can firm up, then enjoy them warm or at room temperature. These sweet pastries are a great addition to any holiday breakfast spread and are also wonderful as an afternoon snack with coffee or tea.\n\n\n1/2 teaspoon Diamond Crystal kosher salt; for table salt use half as much by volume\n\n1 1/2 tablespoons butter (28 g), cut into 4 pieces, softened\n\n3 g Diamond Crystal kosher salt (1 teaspoon); for table salt use half as much by volume\n\n1 egg whisked with 1 tablespoon milk for the egg wash\n\n If Making With Strawberry Filling: In a small saucepan add strawberries, sugar, lemon juice, and salt and cook over medium heat, stirring occasionally until berries break down, mixture thickens, spatula leaves trail that does not fill in immediately and jam is reduced to about 1 cup, about 15 minutes. Let cool off heat for 10 minutes, then transfer to a food processor and purée until smooth. Transfer to a small bowl or clean glass jar and refrigerate until ready to use.\n\n\n If Making With Cream Cheese Filling: In a food processor, add cream cheese, sugar, egg yolk, and vanilla extract. Process until well combined and sugar dissolves, about 1 minute, scraping down the sides of the food processor jar as needed. Transfer to a bowl and refrigerate until ready for use.\n\n\n For the Posypka (Streusel topping): In a bowl, whisk flour, sugar, and cinnamon to combine. Add butter and rub between fingers until mixture resembles wet sand. Cover and refrigerate until ready to use.\n\n\n For the Kolaches Dough: In a 2-cup liquid measuring cup or medium bowl, whisk together milk, melted butter, and egg yolks to combine (butter may form clumps; this is fine).\n\n\n In the bowl of a stand mixer, whisk flour, sugar, yeast, and salt to combine. Fit stand mixer with dough hook, and with mixer running on low speed, slowly pour milk mixture into flour mixture, and knead on low speed until no dry flour remains, about 2 minutes. Increase speed to medium and knead until dough clears sides of bowl but still sticks to bottom, 8 to 12 minutes.\n\n\n Transfer dough to a greased bowl and cover with plastic wrap. Proof at warm room temperature (70 to 74℉) until dough it doubled in size, 60 to 90 minutes.\n\n\n Once dough has risen, line rimmed baking sheet with parchment paper; set aside. Adjust oven rack to middle position and preheat oven to 350℉ (175℃). Punch down dough and transfer to a lightly floured work surface. Roll dough into a 3-inch wide log, then cut and portion dough into twelve 2-ounce pieces.\n\n\n Form each dough piece into a rough ball by pinching and pulling dough edges under so that top is smooth. On clean counter, cup each ball with your palm and roll into smooth, tight ball.\n\n\n Arrange dough balls on prepared parchment-lined baking sheet, spaced evenly apart in 3 rows of 4. Brush tops with remaining 1 tablespoon melted butter. Cover loosely with plastic wrap and let proof at room temperature until puffed up but not quite doubled in size, 30 to 60 minutes.\n\n\n Grease the bottom of a glass jar, cup, or a measuring cup with 2 1/2- to 3-inch diameter, and make a deep indentation in center of each dough ball by slowly pressing cup into the dough on sheet. The indentations should be deep enough to fit about 1 tablespoon of filling.\n\n\n Brush prepared egg wash evenly over the dough. Divide your choice of either the strawberry or cheese filling evenly among kolaches (about 1 heaping tablespoon per kolache) and smooth with back of spoon. Sprinkle streusel topping evenly over kolaches.\n\n\n Bake until golden brown, about 30 minutes, rotating sheet halfway through baking. The kolaches' edges will touch and fuse together when baking. Let buns cool on pan for at least 30 minutes, then carefully pull apart. Serve warm or at room temperature.\n\n\n Small saucepan, food processor, 2-cup liquid measuring cup or medium bowl, stand mixer with dough hook attachment, parchment paper, a glass jar, cup, or a measuring cup with 2 1/2- to 3-inch diameter\n\n\n This recipe can be easily doubled and baked in batches.\n\n\n The two most common kolache fillings are fruit jam and cheese. This recipe includes both filling options, with each filling recipe written to make enough for a full batch. If you’d like to make both, halve each filling recipe to prepare 6 of each or double the dough to make a full batch of each.\n\n\n Store-bought fruit jam of your choice may be substituted for freshly made, but you may need to reduce it further in order to get a thick enough consistency that the jam doesn't run out of the kolaches while baking.\n\n\n The fillings can be made and refrigerated for up to 4 days before using. \n\n\n The baked kolaches can be stored in an airtight container at room temperature for up to 3 days.\n",
    "category": "    Unusual Food News",
    "estimated_duration": "",
    "link": "https://www.seriouseats.com/kolaches-recipe-11715658",
    "title": "A TEXAN CHEF’S SECRETS FOR PILLOWY SOFT BERRY AND SWEET CHEESE KOLACHES",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Semiconductor giant Nvidia is facing unexpected new U.S. export controls on its H20 chips.\n\nIn a filing Tuesday, Nvidia said it was informed by the U.S. government that it will need a license to export its H20 AI chips to China. This license will be required indefinitely, according to the filing — the U.S. government cited “risk that the [H20] may be used in […] a supercomputer in China.”\n\nNvidia anticipates $5.5 billion in related charges in its Q1 2026 fiscal year, which ends April 27. The company’s stock was down around 6% in extended trading.\n\nThe H20 is the most advanced AI chip Nvidia can export to China under the U.S.’ current and previous export rules. Last week, NPR reported that CEO Jensen Huang might have talked his way out of new H20 restrictions during a dinner at President Donald Trump’s Mar-a-Lago resort, in part by committing that Nvidia would invest in AI data centers in the U.S.\n\nPerhaps not-so-coincidentally, Nvidia announced on Monday that it would spend hundreds of millions of dollars over the next four years manufacturing some AI chips in the U.S. Pundits were quick to point out that the company’s commitment was light on the details.\n\nMultiple government officials had been calling for stronger export controls on the H20 because the chip was allegedly used to train models from China-based AI startup DeepSeek, including the R1 “reasoning” model that threw the U.S. AI market for a loop in January.\n\n Notorious image board 4chan hacked and internal data leaked\n\n\n Rippling is trying to serve Deel’s CEO, but bailiffs can’t find him\n\n\n Hertz says customers’ personal data and driver’s licenses stolen in data breach\n\n\n Chipolo’s newest AirTag competitor works with both Apple and Google’s finding networks\n\n\n Silicon Valley crosswalk buttons hacked to imitate Musk, Zuckerberg’s voices\n\n\n Conifer locks down $20M seed round for its ‘drop-in’ electric hub motor\n",
    "category": "    Technology",
    "estimated_duration": "",
    "link": "https://techcrunch.com/2025/04/15/us-government-imposes-license-requirement-on-nvidia-h20-exports/",
    "title": "US GOVERNMENT IMPOSES LICENSE REQUIREMENT ON NVIDIA H20 EXPORTS",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "ZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\n\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews.  Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\n\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors  thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\n\nMidrange smartphones like the OnePlus Nord N30 are a nice alternative to high-end devices like the OnePlus 13. They provide a premium experience without the exorbitant cost. And now, thanks to a new deal, this already affordable phone is even cheaper. The device normally costs $300. But as part of a new promotion, you can get it as low as $200 at Best Buy. That is over 30% off.\n\nAlso: Slash up to $400 off the OnePlus Open with this new Best Buy deal\n\nIf you prefer to buy first-party, OnePlus has the same deal for the Nord N30 on its official website. So no matter where you go, you get to enjoy the same steep discount. Be aware that the phone only comes in a single configuration. The OnePlus Nord N30 has 8GB of RAM, 128GB of storage space, and a Chromatic Gray color scheme.\n\nOnePlus' Nord N30 is a top-notch midrange smartphone that launched in 2023. In his review, ZDNET's Matthew Miller praised the mobile device's features. The N30  sports a high-resolution 6.72-inch AMOLED touchscreen with an adaptive refresh rate of 120Hz. All this tech ensures the display consistently outputs vibrant images and fluid videos for immersive media consumption.\n\nAlso: I switched to a high-end dumbphone for a week, and it put E Ink (and my iPhone) to shame\n\nIt runs on a Qualcomm Snapdragon 695, which isn't the most powerful chipset in the world. However, when combined with the \"fairly stock OxygenOS UI,\" it delivers a smooth performance. Phone calls sound \"perfect,\" as noted by Miller, and the camera system is decent for its price range. Just don't expect it to compete with flagship smartphones.\n\nThe free earphones mentioned earlier plug directly into the Nord N30's USB-C port. If you want the case, the phone does have a 3.5 audio jack for accepting other headphones. \n\nJoining either Best Buy's or OnePlus' trade-in program can net you more savings. For example, if you trade in a third-generation iPhone SE to Best Buy, you shave $95 off the Nord N30's price trade - assuming the device is in good condition.\n\n$100 off on a $300 is a big discount. Nearly two-thirds of its price has been chopped off in one swoop. As a result, ZDNET's rating system grants this promotion a near-perfect score of 4/5. I don't think I've ever seen the OnePlus Nord N30 be this cheap, and this deal is a great way to enter into the OnePlus ecosystem.\n\nAs per OnePlus, this offer will end on April 27, 2025.\n\nHowever, deals are subject to sell out or expire at any time, though ZDNET remains committed to finding, sharing, and updating the best product deals for you to score the best savings. Our team of experts regularly checks in on the deals we share to ensure they are still live and obtainable. We're sorry if you've missed out on a deal, but don't fret -- we constantly find new chances to save and share them with you on ZDNET.com. \n\nWe aim to deliver the most accurate advice to help you shop smarter. ZDNET offers 33 years of experience, 30 hands-on product reviewers, and 10,000 square feet of lab space to ensure we bring you the best of tech. \n\nIn 2025, we refined our approach to deals, developing a measurable system for sharing savings with readers like you. Our editor's deal rating badges are affixed to most of our deal content, making it easy to interpret our expertise to help you make the best purchase decision.\n\nAt the core of this approach is a percentage-off-based system to classify savings offered on top-tech products, combined with a sliding-scale system based on our team members' expertise and several factors like frequency, brand or product recognition, and more. The result? Hand-crafted deals are chosen specifically for ZDNET readers like you, fully backed by our experts. \n\nThe recent US tariffs on imports from countries like China, Vietnam, and India aim to boost domestic manufacturing but are likely to drive up prices on consumer electronics. Products like smartphones, laptops, and TVs may become more expensive as companies rethink global supply chains and weigh the cost of shifting production.\n\nAlso: Tariff war has tech buyers wondering what's next. Here's what we know\n\nSmartphones are among the most affected by the new US tariffs, with devices imported from China and Vietnam facing steep duties that could raise retail prices by 20% or more. Brands like Apple and Google, which rely heavily on Asian manufacturing, may either pass these costs on to consumers or absorb them at the expense of profit margins. \n\nThe tariffs could also lead to delays in product launches or shifts in where and how phones are made, forcing companies to diversify production to countries with more favorable trade conditions.\n\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.",
    "category": "    Technology",
    "estimated_duration": "",
    "link": "https://www.zdnet.com/article/this-oneplus-phone-is-a-solid-alternative-to-the-flagships-and-its-over-30-off/",
    "title": "THIS ONEPLUS PHONE IS A SOLID ALTERNATIVE TO THE FLAGSHIPS - AND IT'S OVER 30% OFF",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Mohsen Mahdawi was admired among pro-Palestine and pro-Israel activists for speaking peacefully to both sides. ICE detained him anyway.\n\nMohsen Mahdawi was admired among pro-Palestine and pro-Israel activists for speaking peacefully to both sides. ICE detained him anyway.\n\nMohsen Mahdawi had a feeling his naturalization appointment would go awry. A week before his meeting with US Citizenship and Immigration Services (USCIS), Mahdawi called his friend Chris Helali and told him he was concerned. “He thought it was likely — and I agreed — that he would be arrested, that they would ambush him at this interview,” Helali tells The Verge. Mahdawi had been so fearful of being detained by Immigration and Customs Enforcement (ICE) that he had reportedly been in hiding for weeks. But Mahdawi couldn’t miss the appointment. According to USCIS, “failure to appear for a scheduled interview” almost always “results in denial” of a person’s application.\n\nThe interview was scheduled for 11AM on April 14th. Helali waited outside the building. “We started to realize that something was amiss,” Helali says. Around noon, the group was told Mahdawi had been handcuffed. Three minutes later, he was escorted out of the building by two Department of Homeland Security officers. Helali captured the arrest, first reported by The Intercept, on video.\n\nIt’s unusual — though not unheard of — for immigrants to be arrested during USCIS interviews. Matt Cameron, a Boston-based immigration attorney, says it has happened to a couple clients of his, but “always because they have previous immigration or criminal history which makes them deportable.” Mahdawi’s attorneys say he has no criminal record and is a “committed Buddhist” who “believes in non-violence and empathy as a central tenet of his religion.” He doesn’t appear to have violated immigration law. But Mahdawi, who was born in the West Bank, was involved in Columbia University’s student protests against Israel’s ongoing war in Gaza. He knew about the Trump administration’s efforts to deport any noncitizens — even those with green cards and visas — for their involvement in pro-Palestine activism under the auspices of a McCarthy-era immigration law.\n\n“He knew he was a target,” Helali says. For him, the arrest was “shocking” — not because it was unexpected but because it made him feel as if “the rule of law that we constantly talk about is not as stable and not as foundational as we might think it is.” What was most striking, though, was how calm Mahdawi appeared. “Mohsen is a calming presence,” Helali says. “He went like a Buddhist: peacefully, calmly, and serenely.”\n\nIn the video Helali captured, Mahdawi seems calm as he walks out of the USCIS building flanked by agents from ICE’s Homeland Security Investigations division. Handcuffed, Mahdawi threw up two peace signs to the camera but didn’t say a word as the agents put him in an unmarked car and drove off. Unlike other videos of ICE arrests, in which the targets appear confused or scared after being approached by plainclothes officers and told they’re under arrest, Mahdawi immediately understood what was happening to him. He knew it was a possibility before he even walked in. \n\nIn a habeas corpus petition filed shortly after Mahdawi’s arrest, his attorneys wrote that 10 days after Trump’s inauguration, the far-right and Zionist group Betar US posted about Mahdawi on X, saying he was “on our deport list.” In a March Instagram post, Canary Mission, another right-wing group, said Mahdawi had “justified Hamas terrorism.”\n\n‘Mr. Mahdawi was always willing to engage in dialogue with people whose views and beliefs differed from his own.’\n\nBoth Betar and Canary Mission have claimed that they’re providing lists of foreign students involved in anti-Israel advocacy to the Trump administration, which has conflated opposition to Israel’s treatment of Palestinians with antisemitism writ large. Canary Mission added an “Uncovering Foreign Nationals” page to its website in late March, which identifies foreign students that the group wants Trump to deport. That same month, Betar reportedly claimed it had “reason to believe” that Mahdawi and the Palestinian poet Mosab Abu Toha were “on the short list of those who will shortly be deported.”\n\nNews of other students being arrested by ICE — including Columbia graduate student Mahmoud Khalil and Tufts University PhD candidate Rumeysa Ozturk — gave Mahdawi’s attorneys time to prepare for his potential apprehension. Attorneys filed a habeas petition just hours after the arrest, requesting not only that Mahdawi be released on bond but that he not be removed from the country or from the state of Vermont. \n\nBoth Khalil and Ozturk were transferred to ICE detention facilities in Louisiana, where they remain incarcerated far from their attorneys and families — and in jurisdictions that are friendly to the Trump administration. On Monday, a federal judge in Vermont issued a temporary restraining order prohibiting DHS from deporting Mahdawi for now. The order also forbade ICE from removing him from Vermont.\n\nLike others arrested by ICE for their pro-Palestine activism, Mahdawi is likely being targeted for statements that would have no legal repercussions if he were a US citizen. Under Trump’s “Executive Order 14188—Additional Measures To Combat Anti-Semitism,” government departments were ordered to come up with ways to “Combat Campus Anti-Semitism.” For DHS, that has meant arresting students involved with pro-Palestine activism.\n\nIn a State Department memo obtained by the New York Times, secretary of state Marco Rubio claimed, without evidence, that Mahdawi had “engaged in threatening rhetoric and intimidation of pro-Israeli bystanders.” Mahdawi’s lawyers denied Rubio’s assertion.\n\nMahdawi remains detained for now. Advocates are calling for his release, noting that he has spoken out against both antisemitism and Israel’s treatment of Palestinians — a point also made in his habeas petition. “Mr. Mahdawi was always willing to engage in dialogue with people whose views and beliefs differed from his own,” it reads. The Intercept reports that in December 2023, Mahdawi got coffee with Shai Davidai, a Columbia professor and vocal supporter of Israel who is now gloating about his arrest. \n\nAround the same time he got coffee with Davidai, Mahdawi started meeting with a group of Israeli students at Columbia.\n\n“His compassion blew me away,” Roni Ziv, one of the Israeli students who attended the meetings, told Haaretz. “Especially in the US, where people on the left often take an ‘anti-normalization’ stance — he didn’t. The fact that I served in the military wasn’t a dealbreaker for him. That’s rare.”\n\nHelali describes Mahdawi as a “bridge-builder.” “[Mahdawi] is very much about reconciliation,” he says.\n\nA weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe.",
    "category": "    Technology",
    "estimated_duration": "",
    "link": "https://www.theverge.com/policy/649427/ice-arrest-mohsen-mahdawi-citizenship-interview-uscis",
    "title": "THE STUDENT ARRESTED AT HIS NATURALIZATION INTERVIEW KNEW IT WAS COMING",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More\n\nOpenAI CEO Sam Altman revealed that his company has grown to 800 million weekly active users and is experiencing “unbelievable” growth rates, during a sometimes tense interview at the TED 2025 conference in Vancouver last week.\n\n“I have never seen growth in any company, one that I’ve been involved with or not, like this,” Altman told TED head Chris Anderson during their on-stage conversation. “The growth of ChatGPT — it is really fun. I feel deeply honored. But it is crazy to live through, and our teams are exhausted and stressed.”\n\nThe interview, which closed out the final day of TED 2025: Humanity Reimagined, showcased not just OpenAI’s skyrocketing success but also the increasing scrutiny the company faces as its technology transforms society at a pace that alarms even some of its supporters.\n\nAltman painted a picture of a company struggling to keep up with its own success, noting that OpenAI’s GPUs are “melting” due to the popularity of its new image generation features. “All day long, I call people and beg them to give us their GPUs. We are so incredibly constrained,” he said.\n\nThis exponential growth comes as OpenAI is reportedly considering launching its own social network to compete with Elon Musk’s X, according to CNBC. Altman neither confirmed nor denied these reports during the TED interview.\n\nThe company recently closed a $40 billion funding round, valuing it at $300 billion — the largest private tech funding in history — and this influx of capital will likely help address some of these infrastructure challenges.\n\nThroughout the 47-minute conversation, Anderson repeatedly pressed Altman on OpenAI’s transformation from a non-profit research lab to a for-profit company with a $300 billion valuation. Anderson voiced concerns shared by critics, including Elon Musk, who has suggested Altman has been “corrupted by the Ring of Power,” referencing “The Lord of the Rings.”\n\nAltman defended OpenAI’s path: “Our goal is to make AGI and distribute it, make it safe for the broad benefit of humanity. I think by all accounts, we have done a lot in that direction. Clearly, our tactics have shifted over time… We didn’t think we would have to build a company around this. We learned a lot about how it goes and the realities of what these systems were going to take from capital.”\n\nWhen asked how he personally handles the enormous power he now wields, Altman responded: “Shockingly, the same as before. I think you can get used to anything step by step… You’re the same person. I’m sure I’m not in all sorts of ways, but I don’t feel any different.”\n\nOne of the most concrete policy announcements from the interview was Altman’s acknowledgment that OpenAI is working on a system to compensate artists whose styles are emulated by AI.\n\n“I think there are incredible new business models that we and others are excited to explore,” Altman said when pressed about apparent IP theft in AI-generated images. “If you say, ‘I want to generate art in the style of these seven people, all of whom have consented to that,’ how do you divvy up how much money goes to each one?”\n\nCurrently, OpenAI’s image generator refuses requests to mimic the style of living artists without consent, but will generate art in the style of movements, genres, or studios. Altman suggested a revenue-sharing model could be forthcoming, though details remain scarce.\n\nThe conversation grew particularly tense when discussing “agentic AI” — autonomous systems that can take actions on the internet on a user’s behalf. OpenAI’s new “Operator” tool allows AI to perform tasks like booking restaurants, raising concerns about safety and accountability.\n\nAnderson challenged Altman: “A single person could let that agent out there, and the agent could decide, ‘Well, in order to execute on that function, I got to copy myself everywhere.’ Are there red lines that you have clearly drawn internally, where you know what the danger moments are?”\n\nAltman referenced OpenAI’s “preparedness framework” but provided few specifics about how the company would prevent misuse of autonomous agents.\n\n“AI that you give access to your systems, your information, the ability to click around on your computer… when they make a mistake, it’s much higher stakes,” Altman acknowledged. “You will not use our agents if you do not trust that they’re not going to empty your bank account or delete your data.”\n\nIn a revealing moment, Altman admitted that even within OpenAI, there’s no consensus on what constitutes artificial general intelligence (AGI) — the company’s stated goal.\n\n“It’s like the joke, if you’ve got 10 OpenAI researchers in a room and asked to define AGI, you’d get 14 definitions,” Altman said.\n\nHe suggested that rather than focusing on a specific moment when AGI arrives, we should recognize that “the models are just going to get smarter and more capable and smarter and more capable on this long exponential… We’re going to have to contend and get wonderful benefits from this incredible system.”\n\nAltman also disclosed a significant policy change regarding content moderation, revealing that OpenAI has loosened restrictions on its image generation models.\n\n“We’ve given the users much more freedom on what we would traditionally think about as speech harms,” he explained. “I think part of model alignment is following what the user of a model wants it to do within the very broad bounds of what society decides.”\n\nThis shift could signal a broader move toward giving users more control over AI outputs, potentially aligning with Altman’s expressed preference for letting the hundreds of millions of users — rather than “small elite summits” — determine appropriate guardrails.\n\n“One of the cool new things about AI is our AI can talk to everybody on Earth, and we can learn the collective value preference of what everybody wants, rather than have a bunch of people who are blessed by society to sit in a room and make these decisions,” Altman said.\n\nThe interview concluded with Altman reflecting on the world his newborn son will inherit — one where AI will exceed human intelligence.\n\n“My kid will never be smarter than AI. They will never grow up in a world where products and services are not incredibly smart, incredibly capable,” he said. “It’ll be a world of incredible material abundance… where the rate of change is incredibly fast and amazing new things are happening.”\n\nAnderson closed with a sobering observation: “Over the next few years, you’re going to have some of the biggest opportunities, the biggest moral challenges, the biggest decisions to make of perhaps any human in history.”\n\nAltman’s TED appearance comes at a critical juncture for OpenAI and the broader AI industry. The company faces mounting legal challenges, including copyright lawsuits from authors and publishers, while simultaneously pushing the boundaries of what AI can do.\n\nRecent advancements like ChatGPT’s viral image generation feature and video generation tool Sora have demonstrated capabilities that seemed impossible just months ago. At the same time, these tools have sparked debates about copyright, authenticity, and the future of creative work.\n\nAltman’s willingness to engage with difficult questions about safety, ethics, and the societal impact of AI shows an awareness of the stakes involved. However, critics may note that concrete answers on specific safeguards and policies remained elusive throughout the conversation.\n\nThe interview also revealed the competing tensions at the heart of OpenAI’s mission: moving fast to advance AI technology while ensuring safety; balancing profit motives with societal benefit; respecting creative rights while democratizing creative tools; and navigating between elite expertise and public preference.\n\nAs Anderson noted in his final comment, the decisions Altman and his peers make in the coming years may have unprecedented impacts on humanity’s future. Whether OpenAI can live up to its stated mission of ensuring “all of humanity benefits from artificial general intelligence” remains to be seen.\n\nIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\n\n\n\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\n\nJoin leaders in enterprise AI for networking, insights, and engaging conversations at the upcoming stops of our AI Impact Tour. See if we're coming to your area!\n\n\n\t\t\t\t\t\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\t\t\t\t\t",
    "category": "    Technology",
    "estimated_duration": "",
    "link": "https://venturebeat.com/ai/sam-altman-at-ted-2025-inside-the-most-uncomfortable-and-important-ai-interview-of-the-year/",
    "title": "SAM ALTMAN AT TED 2025: INSIDE THE MOST UNCOMFORTABLE — AND IMPORTANT — AI INTERVIEW OF THE YEAR",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Nvidia has announced that its 5060 line of GeForce RTX GPUs will be available for purchase beginning on April 16. The line includes two models: The RTX 5060 Ti, which comes in 8GB and 16GB VRAM variants, and the RTX 5060, which will only come in an 8GB VRAM option. The former GPU releases on April 16 for $379 and $429, respectively, with the latter coming sometime in May for $299. \n\nWith the RTX 5060 and RTX 5060 Ti, Nvidia is making high-tech features more accessible for gamers who can't afford a $2,000 GPU. In particular, the new 5060 GPUs offer DLSS 4 support and full ray tracing capabilities for enhanced visuals and higher frame rates. \n\n“The RTX 5060 family offers gamers next-generation performance and AI-enhanced visuals starting at $299,” said Vice President of GeForce Marketing Matt Wuebbling in an Nvidia press release. “Powered by the advanced NVIDIA Blackwell architecture and featuring DLSS 4 technology in over 100 games, this new class of GPUs elevates gaming with stunning visuals, high frame rates and quick responsiveness.”\n\nDLSS 4's AI-enhanced capabilities like Multi Frame Generation, Super Resolution, and Nvidia Reflex can all be found in the RTX 5060 GPU family. The company says these features will reduce latency times during gameplay in addition to those speedier frame rates and higher resolution. \n\nBetter yet, over 100 games will support DLSS 4 when the new GPUs launch, including Cyberpunk 2077, Alan Wake 2, and Black Myth: Wukong. Nvidia says that on the GPU's maximum settings, users can enjoy \"stunning ray-traced visuals at over 100 frames per second\" on some titles.\n\nIf you're planning on buying one to upgrade your current setup, we recommend making your decision as soon as humanly possible, because new Nvidia GPUs tend to go out of stock quickly. (The Nvidia RTX 5090 and 5080 GPUs can be particularly hard to find.) We all remember the RTX 3080 dilemma back in 2020, and with the addition of the volatile U.S. tariff policy situation, we aren't exactly sure how this launch is going to unfold. Product pages for the RTX 5060 Ti aren't even posted yet, so you'll probably want to keep your credit card at the ready.\n\nIn addition to the GPU announcements, Nvidia revealed that RTX-5060-equipped laptops from every big-name manufacturer will also be available this May starting at $1,099. The new laptops are said to have lower latency and are able to double the frame rates of previous iterations. They'll also come in a range of configurations and sizes starting at 14.9 millimeters.\n\nFor updates on the RTX 5060 launch, visit the Nvidia website.\n\nDylan Haas is a Lead Shopping Reporter for Mashable, where he covers all things gaming, pets, fitness, sleep, and shopping events like Black Friday and Prime Day. Before joining the team at Mashable, Dylan received a B.A. in Communications from Pace University and contributed to publications like Paste Magazine, Bandsintown, and others following a brief stint as a marketing and management assistant in the music industry. ",
    "category": "    Technology",
    "estimated_duration": "",
    "link": "https://mashable.com/article/nvidia-geforce-rtx-5060-announcement",
    "title": "NVIDIAS RTX 5060 GPUS GET RELEASE DATE, $299 STARING PRICE",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Attorneys suing the United States government over its use of vanishing Signal messages to coordinate military strikes last month in Yemen allege that new court filings by the government reveal a “calculated strategy” by Trump administration officials to evade transparency laws through the illegal destruction of government records.\n\nUS defense and intelligence agencies on Monday submitted supplemental declarations in court outlining their individual efforts to preserve the messages at the center of the “SignalGate” scandal. American Oversight, a watchdog organization whose attorneys are suing the government, claim the declarations reveal “troubling inconsistencies” in efforts by US officials to archive the material, with the Central Intelligence Agency in particular alleging that it had archived no messages of any substance.\n\n“Using encrypted, disappearing messages on Signal for official government business violates the Federal Records Act and represents a calculated strategy to undermine transparency and accountability,” claims the group’s interim executive director, Chioma Chukwu.\n\nThe use of the private group chat—in which some messages were configured to automatically delete before they could be archived—was first revealed by The Atlantic’s editor in chief, Jeffrey Goldberg, on March 24, after he was inadvertently added to the group by Trump’s national security adviser, Michael Waltz. American Oversight subsequently filed Freedom of Information Act requests over the chats and then sought a temporary restraining order in a Washington, DC, federal court in an effort to compel the government to salvage any messages yet to be deleted.\n\nIn addition to Waltz, known participants in the chat group include, among others, Secretary of Defense Pete Hegseth, Secretary of State Marco Rubio, Vice President JD Vance, Director of National Intelligence Tulsi Gabbard, and CIA Director John Ratcliffe.\n\nWIRED has requested comment from the Justice Department, the Office of the National Intelligence Director, and the White House. The departments of Defense and State declined to comment. The CIA could not be immediately reached for comment.\n\nThe declarations filed by the government late Monday show a scattershot attempt by multiple agencies to comply with the court’s demands, with several days elapsing during their various individual efforts to obtain and preserve the messages.\n\nJudge James Boasberg, the chief judge of the US District Court for the District of Columbia, issued his initial order to preserve the communications on March 27, while giving each agency four days to describe what actions were being taken to obey. “We were really trying to seek preservation of Signal chats more broadly,” American Oversight’s deputy chief counsel, Katie Anthony, tells WIRED. “But the court was not willing to step outside the one specific chat we all knew about for certain.\"\n\nThe declarations ultimately offered scant information about the methods that were employed to preserve the messages or the degrees to which those methods are forensically sound. And it is unclear from the disclosures what portion of the chat—alleged to cover five days in early March—might have been irretrievable by that time. According to reporting by The Atlantic, some of the messages concerning the military strikes, which targeted Houthi fighters in Yemen, were set to delete automatically after four weeks. Others were reportedly set to disappear after only one.\n\nThe US Treasury Department was initially alone in providing the court a timeline of the messages that it was able to retrieve. Treasury Secretary Scott Bessent had received a preservation memo on March 26, his acting general counsel said, as well as advice regarding his fundamental duty to preserve records. Resultingly, \"images were taken from the phones of Secretary Bessent and Mr. [Daniel] Katz,\" Bessent’s chief of staff. The messages begin at 1:48 pm EST on March 15, 2025.\n\n\"The Atlantic article was about a chat that took place the 11th through the 15th,” Anthony says, “so pretty much everything was gone—from the only defendant who gave us clear and specific information about what they were able to save.”\n\nThe Department of Defense told the court last month that its attorneys were \"in the process\" of complying with the agency's preservation rules and that Secretary Hegseth’s communications team had been asked to forward the Signal messages to an official DOD account. Pressed by the court for further details last week, the DOD said Monday that a search of Hegseth's device had been conducted \"on or about March 27,\" adding that screenshots of the \"existing Signal application messages\" had been preserved.\n\nAmerican Oversight’s lawyers had urged the court to seek greater specificity, arguing on April 4 that \"vague, incomplete assertions\" in the government's original declarations had only cast fresh doubts on its \"purported efforts\" to preserve the chats. In light of new reporting, the group argued, the government's response seemed otherwise \"grossly inadequate.\" Politico had reported two days prior that as many as 20 private Signal chat groups had been started by Waltz’s team with a slew of cabinet officials.\n\n“It seems very likely that the individuals who are defendants in our lawsuit are probably involved in some of those other chats, and we have this problem on a much wider basis,” Anthony says.\n\nThe Department of Justice, meanwhile, opposed the court’s involvement, arguing that its efforts on behalf of a watchdog group were legally confused and that the question of whether any laws were broken is in any case moot. Members of the public, it argued, have no \"enforceable rights” when it comes to challenging the destruction of specific government records. A court order was unnecessary, the department said, because the government was already taking steps to do what is required. A “partial version of the chat” had already been committed to a federal record keeping system, it said, by “at least one agency.”\n\nAmong other new details, Monday’s disclosures provided a range of dates for the preservation efforts at multiple agencies, including the date that Hegseth’s phone was finally “searched.”\n\nScreenshots of chats on Marco Rubio's phone were likewise captured on March 27, the State Department said. The Office of the Director of National Intelligence said its screenshots were taken the following day, on March 28. The CIA said it took a screenshot of the chat on March 31; however, it also clarified one of its previous declarations to the court, revealing that the image shows mainly the name of the chat group and some of its members and settings but not any of its “substantive messages.”\n\nAmerican Oversight previewed a case to amend its initial complaint during a hearing last week, with plans to encourage the court to expand the scope of its review to include the now-reported widespread use of Signal by top officials across the national security state.\n\n“This attack on government transparency threatens the very foundation of our democracy,” Chukwu says. “And we are committed to using every legal tool available to expose the truth and hold those responsible accountable.”\n\nIn your inbox: Upgrade your life with WIRED-tested gear\n\n'Wi-Fi keeps going down': Trump's RTO mandate is going terribly\n\nBig Story: The worm that no computer scientist can crack\n\nYuval Noah Harari: “Prepare to share the planet with AI superintelligence”\n\nUncanny Valley: An insider look at the influence of Silicon Valley\n\n© 2025 Condé Nast. All rights reserved. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices",
    "category": "    Technology",
    "estimated_duration": "",
    "link": "https://www.wired.com/story/heres-what-happened-to-those-signalgate-messages/",
    "title": "HERE’S WHAT HAPPENED TO THOSE SIGNALGATE MESSAGES",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "The editorial content on this page is based solely on objective, independent assessments by our writers and is not influenced by advertising or partnerships. It has not been provided or commissioned by any third party. However, we may receive compensation when you click on links to products or services offered by our partners. Review CNET's ethics statement.\n\nStill, more than one in four shoppers are delaying big purchases over $500. Here's how you can prep amid uncertainty.\n\nDashia is the consumer insights editor for CNET. She specializes in data-driven analysis and news that intersects personal finance, tech and consumer sentiment. Dashia investigates economic shifts and everyday challenges to help readers make well-informed decisions. She covers a range of topics, including technology, security, energy and money. \r\n\r\nDashia graduated from the University of South Carolina with a bachelor's degree in journalism. She loves teaching spinning, baking and spending time with her family.\n\nCourtney Johnston is a senior editor leading the CNET Money team. Passionate about financial literacy and inclusion, she has a decade of experience as a freelance journalist covering policy, financial news, real estate and investing. A New Jersey native, she graduated with an M.A. in English Literature and Professional Writing from the University of Indianapolis, where she also worked as a graduate writing instructor.\n\nDashia is the consumer insights editor for CNET. She specializes in data-driven analysis and news that intersects personal finance, tech and consumer sentiment. Dashia investigates economic shifts and everyday challenges to help readers make well-informed decisions. She covers a range of topics, including technology, security, energy and money. \r\n\r\nDashia graduated from the University of South Carolina with a bachelor's degree in journalism. She loves teaching spinning, baking and spending time with her family.\n\nCourtney Johnston is a senior editor leading the CNET Money team. Passionate about financial literacy and inclusion, she has a decade of experience as a freelance journalist covering policy, financial news, real estate and investing. A New Jersey native, she graduated with an M.A. in English Literature and Professional Writing from the University of Indianapolis, where she also worked as a graduate writing instructor.\n\nThere's been another twist in President Donald Trump's tariff plans. After imposing an additional 125% reciprocal tariffs on China last week, the administration exempted tech devices, including smartphones and laptops, at least for now. There's still a 20% tariff on all items imported from China, which could still go up, meaning tech could get a lot more expensive. \n\nHere's an example of how tariffs work, in general. \n\n\"If there's a 10% tariff on smartphones, that means US-based companies have to pay 10% more to get the products from overseas,\" said Patti Brennan, a certified financial planner. \"That extra 10% has to come from somewhere, and I suspect that most companies are going to pass it along to the consumer -- which is what they've done in the past.\"\n\nThese plans are constantly changing, which raises a big question. Should you buy tech items now or wait?\n\nBefore the last round of tariffs was implemented, a March CNET survey found that 33% of US adults felt pressured to purchase in anticipation of tariff-related price hikes. And nearly one in five US adults (17%) made a purchase ahead of potential cost increases that could come. \n\nHere's what we learned about how tariffs are changing US adults' buying habits and expert advice on getting the best tech deal in the meantime.\n\nCompared to Gen X and boomers, younger generations are feeling more pressure: 48% of Gen Z and 45% of millennials said they felt pressure to make purchases to avoid tariff-related price hikes.\n\nBut over 60% of Gen X and boomers haven't felt this same pressure to make purchases. Usha Haley, a professor at the Barton School of Business at Wichita State University, said that younger generations may be more susceptible to peer pressure or the fear of missing out than older generations. \n\nMost US adults are making (or planning to make) changes to their budgets to prepare for tariff-related price changes. Consumers are also cutting back on nonessential spending, like dining out and travel (40%), and saving more from each paycheck (19%).\n\nMost shoppers who are concerned about tariffs driving up the cost of tech products either planned to purchase ahead of tariffs or purchased electronics late last year or early this year. Smartphones and laptops are at the top of that list. \n\nBy the numbers, 48% of US adults plan to buy or have already bought smartphones, and 42% have done the same for laptops. Other top tech items that shoppers are concerned about include home appliances, TVs and smart home devices. \n\nIt doesn't surprise experts that some US adults are delaying big purchases over $500 (27%). Nearly one in five (18%) who plan to make big purchases will take advantage of major sales throughout the year, which could be a big money saver if tariffs drive up prices. Additionally, the survey found that 11% of US adults already made purchases ahead of tariffs late last year and earlier this year to avoid higher prices. \n\nIf you're worried about prices going up and already have the money saved, buying items you're planning for now may be best.\n\n\"If you think it's going to be more expensive in the future, it would make sense to go ahead and buy it now,\" said Michael Coon, associate professor of economics at the University of Tampa. \"But just like the pandemic showed us with supply and demand constraints, if everybody buys it now, the item becomes more expensive anyway.\" \n\nIf you need to make a big purchase or plan to, you can still save some money. Coon recommends comparing prices to get the best deal. The extra few minutes of comparing retailer offers could save you a few hundred dollars. \n\nRead more: How Much Will iPhone and Other Apple Prices Increase With 'Liberation Day' Tariffs?\n\nIt's the big question that everyone wants answered -- is it better to spend money on electronics now to avoid potential tariff-induced price jumps? \n\nIf you already have funds earmarked for a purchase, then shopping now or during an upcoming shopping event, like a rumored upcoming Amazon sale, could help you save money and offer you peace of mind. But if you don't have the money saved, experts don't recommend financing it. \n\nBrennan agreed, adding that if you have the money to buy a new electronic or tech gadget, go for it -- just make sure you actually need it. \n\n\"Don't buy it in anticipation of prices going up, because we don't know what the ultimate outcome is going to be,\" Brennan said. \n\nAbove all, experts say to make sure you shop around to find the best deal on tech.\n\n\"You might spend an extra 15 to 20 minutes searching the internet, but you end up saving a couple hundred dollars,\" said Coon. \"It's definitely worth the time to look for the best bargain.\"\n\nShopping for new electronics is about timing and knowing the expert strategies to find the best deals. I asked CNET experts about the best deals on laptops, TVs and smartphones to find out when it's best to buy and what we need to know about pricing for newer models coming out this year. \n\nWhether you buy a new laptop now or wait depends on your needs and budget, said Josh Goldman, an editor and one of CNET's laptop reviewers.\n\n\"Prices certainly aren't going to get better if the US gets involved in a trade war, so if someone needs a new laptop and can afford to buy now, I wouldn't wait and see,\" said Goldman. \"With Easter and spring sales, dads and grads, Memorial Day and back-to-school sales, we are headed into the best time to buy a discounted new laptop outside of Black Friday.\"\n\nIf you don't have enough money saved to buy a new laptop, but you need one, Goldman recommends looking for a refurbished one at a discounted price -- which shouldn't be as affected by tariffs. He recommends Apple, Best Buy, BackMarket and eBay Refurbished for deals on used laptops with guarantees. \n\nIf you're in the market for a new TV, David Katzmaier, senior editorial director and a CNET TV reviewer, recommends buying last year's model now. You'll find TVs from 2024 at their lowest price point since retailers are getting rid of last year's inventory. \n\nWith 2025 TVs coming out, expect prices to remain high on the newer models until the holidays, Katzmaier said. But if you don't need a TV, there's no need to rush into a purchase.\n\n\"TVs last a long time, and if you don't need to buy one now, my advice is to wait until you do,\" said Katzmaier. \"Yes, tariffs could push prices higher later in the year, but whether they'll affect TV prices around sales times -- think Black Friday and later in November and December -- is an open question.\"\n\nBefore you buy a new phone, take a step back to assess whether you need one, said Patrick Holland, a CNET editor and smartphone reviewer. Most smartphones typically last between three to five years before you start to have problems. But you may be able to fix some of those hardware issues for less than getting a new phone. \n\nSmartphones typically last a few years and we may not even buy one until we really need a replacement. So it can be tough to know when to buy a new phone -- even without tariffs. \n\nHow much the next round of popular smartphones, like the iPhone 17 or the Google Pixel 10, will cost won't be announced until later this year, but those prices aren't as volatile as everyday essentials like groceries, said Holland. \n\n\"If your battery doesn't hold a charge like it used to but everything else on your phone is fine, it'd be a lot easier and cheaper to replace the battery than to buy an entirely new phone -- tariffs or not,\" said Holland. \n\nIf you need a new phone, look for deals. Some retailers and carriers offer trade-in offers to swap your old phone for a discount on the new phone. However, Holland pointed out that if you rely on your phone carrier to finance your smartphone upgrade, that can make it even more difficult to find a deal. \n\nAll figures, unless otherwise stated, are from YouGov Plc. The total sample size was 2,305 adults. Fieldwork was undertaken March 3-5, 2025. The survey was carried out online. The figures have been weighted and are representative of all US adults (aged 18-plus). \n\nDashia is the consumer insights editor for CNET. She specializes in data-driven analysis and news that intersects personal finance, tech and consumer sentiment. Dashia investigates economic shifts and everyday challenges to help readers make well-informed decisions. She covers a range of topics, including technology, security, energy and money. \r\n\r\nDashia graduated from the University of South Carolina with a bachelor's degree in journalism. She loves teaching spinning, baking and spending time with her family.\n\nCourtney Johnston is a senior editor leading the CNET Money team. Passionate about financial literacy and inclusion, she has a decade of experience as a freelance journalist covering policy, financial news, real estate and investing. A New Jersey native, she graduated with an M.A. in English Literature and Professional Writing from the University of Indianapolis, where she also worked as a graduate writing instructor.\n\nCNET editors independently choose every product and service we cover. Though we can’t review every available financial company or offer, we strive to make comprehensive, rigorous comparisons in order to highlight the best of them. For many of these products and services, we earn a commission. The compensation we receive may impact how products and links appear on our site.",
    "category": "    Technology",
    "estimated_duration": "",
    "link": "https://www.cnet.com/personal-finance/banking/cnet-tariff-survey-2025/#ftag=CAD590a51e",
    "title": "CNET SURVEY: TARIFF PRICE HIKES ARE RUSHING US ADULTS INTO TECH PURCHASES",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\n        The slight rise is due to better access to tests in underserved communities.\n      \n\nThe rate of autism in a group of 8-year-olds in the US rose from 2.76 percent (1 in 36) in 2020 to 3.22 percent (1 in 31) in 2022, according to a study out Tuesday in the Morbidity and Mortality Weekly Report, a journal published by the Centers for Disease Control and Prevention.\n\nThe report's authors—researchers at the CDC and academic institutions across the country— suggest that the slight uptick is likely due to improved access to evaluations in underserved groups, including Black, Hispanic, and low-income communities.\n\nThe data comes from the CDC-funded Autism and Developmental Disabilities Monitoring (ADDM) Network. The national network has been tracking the prevalence of autism spectrum disorder (ASD) in 8-year-olds at a handful of sites since 2000, publishing estimates every two years. In 2000, ASD prevalence was 1 in 150, with white children from high-income communities having the highest rates of the developmental disability. In 2020, when the rate hit 1 in 36, it was the first year in which higher ASD rates were seen in underserved communities. That year, researchers also noted that the link between ASD and socioeconomic status evaporated in most of the network.\n\nIn the new data, prevalence continued to be higher in underserved communities compared with white children. Prevalence among white children was 27.7 per 1,000, which is lower than prevalence among multiracial (31.9), Hispanic (33.0), Black (36.6), American Indian or Alaska Native (37.5), or Asian or Pacific Islander children (38.2). And, overall, prevalence was higher among children from low-income neighborhoods.\n\n\"The reversal of these patterns in prevalence by race and ethnicity and SES [socioeconomic status] is consistent with increased access to and provision of identification services among previously underserved groups,\" the researchers conclude.\n\nA look forward also shows trends toward more and earlier access to services. While monitoring has focused on 8-year-olds because children are more likely to have a diagnosis by that age, the researchers also examined autism evaluations and rates among children who were 4 years old in 2022. Researchers found that the younger children, born in 2018, had more evaluations in the same age window as the children who were born in 2014.\n\nThis year, the ADDM included 16 sites across the country—in many past years, there were 11 sites. It's important to highlight that although the prevalence rates from these sites are often seen as national estimates of ASD prevalence, they are not. These 16 sites are not nationally representative. The populations within ADDM \"do not generate nationally representative ASD prevalence estimates,\" the authors caution.\n\nAmong the sites, there were large differences. Prevalence ranged from 9.7 per 1,000 children who were 8 years old in Texas (Laredo) to 53.1 in California. These differences are likely due to \"differences in availability of services for early detection and evaluation and diagnostic practices,\" the CDC and network researchers wrote.\n\nFor instance, California—the site with the highest prevalence among 8-year-olds and also 4-year-olds—has a local initiative called the Get SET Early model. \"As part of the initiative, hundreds of local pediatricians have been trained to screen and refer children for assessment as early as possible, which could result in higher identification of ASD, especially at early ages,\" the authors write. \"In addition, California has regional centers throughout the state that provide evaluations and service coordination for persons with disabilities and their families.\"\n\nOn the other hand, the low ASD rates at the network's two Texas sites could \"suggest lack of access or barriers to accessing identification services,\" the authors say. The two Texas sites included primarily Hispanic and lower-income communities.\n\nThe newly revealed higher rates in some of the network's underserved communities could link ASD prevalence to social determinants of health, such as low income and housing and food insecurity, the authors say. Other factors, such as higher rates of preterm birth, which is linked to neurodevelopmental disabilities, as well as lead poisoning and traumatic brain injuries, may also contribute to disparities.\n\nThe detailed, data-heavy report stands in contrast to the position of health secretary Robert F. Kennedy Jr., a longtime anti-vaccine advocate who promotes the false and thoroughly debunked claim that autism is caused by vaccines. Last month, Kennedy hired the discredited anti-vaccine advocate David Geier to lead a federal study examining whether vaccines cause autism, despite numerous high-quality studies already finding no link between the two.\n\nGeier, who has no medical or scientific background, has long worked with his father, Mark Geier, to promote the idea that vaccines cause autism. In 2011, Mark Geier was stripped of his medical license for allegedly mistreating children with autism, and David Geier was fined for practicing medicine without a license.\n\nIn a media statement Tuesday in response to the new report, Kennedy called autism an \"epidemic\" that is \"running rampant.\" He appeared to reference his planned study with Geier, saying: \"We are assembling teams of world-class scientists to focus research on the origins of the epidemic, and we expect to begin to have answers by September.\"\n\nArs Technica has been separating the signal from\n          the noise for over 25 years. With our unique combination of\n          technical savvy and wide-ranging interest in the technological arts\n          and sciences, Ars is the trusted source in a sea of information. After\n          all, you don’t need to know everything, only what’s important.",
    "category": "    Technology",
    "estimated_duration": "",
    "link": "https://arstechnica.com/health/2025/04/autism-rate-rises-from-2-76-to-3-22-likely-due-to-better-testing-access/",
    "title": "AUTISM RATE RISES SLIGHTLY; RFK JR. CLAIMS HE’LL “HAVE ANSWERS BY SEPTEMBER“",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Take a look at the key numbers to know after Mike Budenholzer was fired following one season with the Suns. (0:41)\n\nThe speech, given in a bare and sterile concourse turned makeshift locker room at Walt Disney World, became both legend and rallying cry in the Phoenix Suns franchise.\n\nIt was June 2020. Standing in front of his team, Monty Williams was beaming after his young Suns team had gone 8-0 in the Orlando bubble to end its season.\n\n\"We are not the Suns of old!\" Williams proclaimed. \"It's hard to play the way you've played and not get the respect you deserve. But guess what, you've got it! We've shocked the world and this is special. You've gained the respect of the league!\"\n\nThis was the last time, before this season of misery, the Suns missed the playoffs. Their run in Orlando left them just barely out of the first play-in tournament. Still, it was the 10th consecutive year the Suns missed the postseason. They'd gone over .500 only once in that span.\n\nBut Williams was right. The pivot had happened and the Suns were in the 2021 Finals the following summer. They'd made the playoffs ever since.\n\nLast week, that streak thudded to an end after four years, and there was an absence of the inspiration of their last near miss.\n\n\"There's no justification for this,\" Suns coach Mike Budenholzer said in a news conference after the Suns lost by 38 points at home to the Golden State Warriors, the seventh straight loss by double digits that essentially ended their season. \"We're going through a tough time.\"\n\nBudenholzer was fired Monday, one year into a five-year, $50 million deal. The Suns will start next season with a fourth different head coach in as many seasons, all of the changes coming since owner Mat Ishbia bought the team in February 2023. General manager James Jones, architect of the Finals team and the 64-win team that followed in the 2021-22 season, is not under contract for next season, sources told ESPN.\n\n\"It's been a slow bleed out,\" franchise player Devin Booker acknowledged after the team was officially eliminated from postseason contention after an eighth straight double-digit loss, this one to Oklahoma City. \"I've been feeling this way for the majority of the season.\"\n\nIt all raises an uncomfortable question: What can the Suns, with a failing $367 million roster -- the second-most expensive in NBA history --- and without control of any of their draft picks for the rest of the decade, do to avoid another multiyear drought?\n\nThis is a question the Suns have been privately confronting since last winter, when they began to come to grips with the reality that what they'd built was deeply flawed.\n\nAnd while they now have no coach, and the possibility of some front office turnover, a new plan is being formalized -- and according to multiple sources close to the team, there are already cornerstones emerging.\n\nBooker was the franchise player before Kevin Durant and Bradley Beal were acquired, and he remains the franchise player. He was the franchise player before Budenholzer and previous one-year coach Frank Vogel -- Ishbia is on the hook for paying the departed coaches around $18 million combined next season, sources said -- and Booker remains so as he finishes the first season of a four-year, $220 million extension. Booker is eligible to sign a two-year, $149.8 million extension this summer, which Phoenix is expected to offer, sources said.\n\nIn his first season under Budenholzer, Booker averaged a career-high 37.3 minutes, 25.6 points -- his lowest since 2018 -- and shot a career-low 33% from 3.\n\nAs the season fell to pieces, Booker made a perceptible shift in speaking about the importance of his \"voice.\" It was multifaceted -- and intentional, sources said. He and Budenholzer got into a dustup during the season about Booker's communication in team settings, such as in huddles and film sessions, sources said. Booker referencing it sent a message to the coach who was on his way out. And Booker, now 28 and 10 years into his career, is also subtly letting it be known he will have more to say going forward.\n\n\"[I need] to be a leader and use my voice more,\" Booker said last week. When he was asked whether that was to speak to teammates or to coaches and management, Booker made it clear.\n\nStill, because of the position the Suns put themselves in -- firmly in the second apron, with its severe salary cap limitations -- building quickly around Booker, a four-time All-Star, will be extremely challenging.\n\nWhen asked about the Suns building a winning culture and identity, Devin Booker says it was \"one of the steps\" the team skipped.\n\nThe Suns played much better when Durant, who averaged 26.6 points, 6.0 rebounds and 4.2 assists in his 62 games this season, was in the lineup.\n\nThey were 3-17 in games in which he did not play. When he did, they went 33-29, a 44-win pace that still would've landed them ninth in the loaded Western Conference. They finished 11th.\n\nEven so, on its face, this seems like a player a team should want to retain.\n\nBut with their sky-high payroll putting them in the NBA's penal second apron, the Suns' ability to adjust the roster is saddled with restrictions that kneecap any flexibility.\n\nAnd of the few options they have to seriously alter a roster that failed, looking for a Durant trade is the most logical. They arrived at that conclusion midseason when they tried to trade him.\n\nTrading Booker is not an option, the team has said publicly.\n\nAnd even if the Suns find a way to swap some of their role players, the apron prevents them from combining any of their salaries or take back more money in a deal. This is why by late January they were on the phone discussing Durant deals -- an unpalatable end to a short-lived era that cost them four first-round picks, three pick swaps and valued young players Mikal Bridges and Cameron Johnson in the deal in February 2023.\n\nFrom the play-in tournament to the NBA Finals, ESPN has you covered throughout the playoffs.\n\n• Postseason preview: Big questions for all 20 teams\n• Pelton: 25 names to watch, including top stars\n• Offseason guide: What's next for eliminated teams\n• What to know: News, schedule, scores, highlights\n\nWhen Durant, who has only next year at $55 million left on his contract, learned the organization was gaining traction on trading him back to Golden State, he informed team leaders he did not want to be traded and hoped to help the Suns turn around their season.\n\nDurant explained his thinking to former teammate and Warrior Draymond Green on his podcast, saying: \"I want my career to end on my terms, that's the only thing. That's the only thing I'm worried about.\"\n\nDurant's hopes of salvaging the situation ended with a badly sprained left ankle on March 30, the final straw on his doomed season, and perhaps era, in Phoenix.\n\nAnd while the idea of a midseason roster adjustment fizzled in February, the team learned some valuable information: that there was robust interest in Durant, including from the Minnesota Timberwolves, Miami Heat, New York Knicks, Houston Rockets and San Antonio Spurs, ESPN's Shams Charania reported recently.\n\nThe Wolves, also mired in the second apron, have resolved their ownership situation with Marc Lore expected to take over as governor by this summer. Sources said they were the most aggressive team in February in trying to get Durant, who is close with star Anthony Edwards, after the Warriors' option was taken off the table.\n\nThe Rockets hold two future first-round picks from the Suns (2027 and 2029) and can swap this year's lottery pick, which they will do. With these assets in house, the Rockets will always be lurking when the Suns do business over the next few years.\n\nThe Knicks have been interested in Durant for the better part of a decade and had hoped to land him in free agency in 2019. Depending on how their season ends, they could again revisit the concept this summer.\n\nPrivately, the Suns admit they made a mistake by not involving Durant earlier in the process. They had hoped to keep the discussions closed, the way the Dallas Mavericks did with Luka Doncic, but when the Suns inevitably had to discuss scenarios with third teams to find a way to execute a deal, word leaked across the league.\n\nThey appear to be trying a different approach going into the offseason. Rich Kleiman, Durant's longtime agent and business partner, planned to travel to Phoenix this week for discussions with the organization, sources said.\n\nThere are several concepts that will define how the potential trade discussions evolve.\n\nWednesday, April 16: Play-in\nNo. 10 Heat at No. 9  Bulls, 7:30 p.m.\nNo. 10 Mavericks at No. 9 Kings, 10 p.m.\n\nFriday, April 18: Play-in\nWestern Conference 8th-place game, TBD\n\nIf a team is going to pay a premium to acquire Durant -- and at midseason the Suns were indeed looking for a premium, sources said, specifically packages that include current or former All-Stars, young players and/or first-round picks -- then making sure he wouldn't simply be around for one season will be a priority.\n\nDurant is eligible to add two years and up to $124 million to his contract, his three-year max being just short of $180 million. He will turn 37 before next season.\n\nFinding a team Durant likes, and one that has the salary flexibility to add him, will be a challenge, especially if he prefers a contender. Finding one willing to pay him, able to make a deal with the Suns, and that can afford to pay him is an especially difficult alignment. The last time Durant was traded, the aprons had yet to take hold of the NBA.\n\nThere is also the option of finding a team comfortable with one year of Durant. This could be a team looking for a last piece in a title push -- or one looking to draw in fans. The team acquiring Durant would still have until June 30, 2026, to offer the same extension Phoenix could.\n\n\"Durant is a top-three name in this league,\" one high-ranking NBA official said. \"I can see a team who'd love to have him for a season just to sell tickets.\"\n\nHow it will play out is difficult to foresee, with the playoffs, draft lottery, the draft itself and free agency still to come.\n\nShams Charania reports on which teams could be in the mix if the Suns look to trade Kevin Durant in the offseason.\n\nThere was surprise in league circles when Ishbia fired Williams after a 4-2 series loss in the 2023 conference semifinals to the eventual champion Denver Nuggets. They had been tied 2-2 in the series, but two Nikola Jokic triple-doubles led to blowouts in Games 5 and 6 and convinced ownership there was need for change. The Suns have not won a playoff game since.\n\nIn response, Ishbia became very focused on hiring a coach who had a championship on his résumé to replace Williams. That list initially included Doc Rivers and Nick Nurse, before Vogel, a 2020 champion with the Los Angeles Lakers, was hired. The franchise doubled down on that desire last spring after Vogel was dispatched for Budenholzer, who won his ring with the Milwaukee Bucks by beating the Suns in the 2021 finals.\n\nThe Suns also have brought in promising young coaches for interviews over the past several years, including Jordi Fernandez, who was later hired by the Brooklyn Nets, and former assistant Kevin Young, who has found success as the coach at BYU.\n\nWhether the Suns hire a first-time head coach or another one with experience, they might pivot from someone who, at least by reputation, could instantly lead the team to a championship, to one who could come in and build relationships with the players. That, sources said, was something Budenholzer, who is still owed another $40 million, was unable to do.\n\nIn this way -- and in everything the Suns do this offseason to evaluate their flawed instant-gratification strategy that has gone belly up -- they might have to follow the directive of the tersely worded statement they published after Budenholzer's firing:",
    "category": "    Sports",
    "estimated_duration": "",
    "link": "https://www.espn.com/nba/story/_/id/44673421/comes-next-flailing-phoenix-suns-kevin-durant",
    "title": "WHAT COMES NEXT FOR THE FLAILING PHOENIX SUNS -- AND KEVIN DURANT",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "The Orlando Magic will host the Atlanta Hawks on Tuesday in the 2025 NBA Play-In Tournament with the winner earning the No. 7 seed in the Eastern Conference playoffs and taking on Boston in the first round of the 2025 NBA playoffs. The Magic went 41-41 this season, including 22-19 at home, while the Hawks went 40-42, including 19-22 on the road. The Hawks and Magic split their four matchups this season. Atlanta just defeated the Magic, 117-105, on Sunday, but both teams rested key starters for that matchup. Tuesday's loser gets one more chance at the postseason as it will play the winner of Wednesday's Heat vs. Bulls game to determine the No. 8 seed in the East. Clint Capela (hand) is out for Atlanta, while Trae Young (Achilles') is listed as probable.\n\nTipoff is set for 7:30 p.m. ET from the Kia Center in Orlando, Fla. This will be Orlando's first-ever play-in tournament game, while Atlanta is 3-1 in such contests. The Magic are favored by 5.5 points in the latest Magic vs. Hawks odds, according to FanDuel Sportsbook. The over/under is 219 points. Orlando is at -239 on the money line (risk $239 to win $100), while Atlanta is at +195 (risk $100 to win $195). Before entering any Hawks vs. Magic picks for the 2025 NBA Play-In Tournament, you'll want to see the NBA predictions from the model at SportsLine. \n\nThe SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past six-plus seasons. The model enters the 2025 NBA playoffs on a sizzling 156-115 roll on all top-rated NBA picks dating back to last season, returning nearly $4,000. Anyone following at sportsbooks and on betting apps could have seen huge returns.\n\nThe model has set its sights on Atlanta vs. Orlando. You can head to SportsLine to see its picks. Here are several NBA betting lines for Magic vs. Hawks:\n\nThe Hawks are looking to make their fourth postseason over the last five years, led by Young (probable) coming off another elite scoring season. Young was 14th in the NBA in scoring at 24.2 points per game. He had 36 points on Friday against the 76ers before sitting out on Sunday as the Hawks were locked into the eighth seed regardless of the game's outcome. Young should be active for Tuesday and he's averaged 25.9 points and 12 assists over seven games in April. Young led the NBA in assists (11.6 per game) as one of the most dynamic players in the league.\n\nAtlanta will rely on Young and its high-powered offense in this offensive vs. defensive battle. The Hawks have the No. 5 scoring offense (118.2 ppg) in the league this season as they prepare to go up against the No. 1 scoring defense. Atlanta already has one victory in Orlando this season and the Hawks have either won or forced overtime in three of four matchups in Orlando over the last two seasons. See which team to pick here.\n\nAs previously noted, the Magic have the No. 1 scoring defense in the league, allowing 105.5 points per game, nearly two points fewer than anyone else in the NBA. Conversely, the Hawks have the fourth-worst scoring defense (119.3 ppg). Orlando had the second-best defense in the league last season as its defensive efficiency has fueled the franchise's turnaround as the Magic are one win away from their second straight postseason appearance. The Magic rank in the top 10 in the league in both blocks and steals while forcing the second-most turnovers. \n\nWhile Orlando is an elite defensive team, it doesn't mean the Magic don't also have offensive playmakers. Paolo Banchero and Franz Wagner have both increased their scoring outputs this season, averaging 25.9 points and 24.2 ppg, respectively, and they'll be integral to Orlando's success on Tuesday. Banchero scored more than 30 points in each of his three games against the Hawks this season and he'll be a challenging one for Orlando to contain on Tuesday. See which team to pick here.\n\nThe model has simulated Magic vs. Hawks 10,000 times and the results are in. The model is leaning Under projecting 213 points, and it also says one side of the spread hits almost 60% of the time. You can only see the pick at SportsLine.\n\nSo who wins Hawks vs. Magic, and which side of the spread hits in almost 60% of simulations? Visit SportsLine now to see which side of the Magic vs. Hawks spread you need to jump on, all from the model that is on a 156-115 roll on top-rated NBA picks since last season, and find out.\n\nHere are some of the sportsbooks to bet on NBA games today, along with the various NBA sportsbook promos they currently offer.\n\n\r\nCBS Sports is a registered trademark of CBS Broadcasting Inc. Commissioner.com is a registered trademark of CBS Interactive Inc.\n\n\r\nThe content on this site is for entertainment purposes only and CBS Sports makes no representation or warranty as to the accuracy of the information given or the outcome of any game or event. There is no gambling offered on this site. This site contains commercial content and CBS Sports may be compensated for the links provided on this site.",
    "category": "    Sports",
    "estimated_duration": "",
    "link": "https://www.cbssports.com/nba/news/hawks-vs-magic-odds-prediction-time-2025-nba-play-in-tournament-picks-april-15-bets-from-proven-model/",
    "title": "HAWKS VS. MAGIC ODDS, PREDICTION, TIME: 2025 NBA PLAY-IN TOURNAMENT PICKS, APRIL 15 BETS FROM PROVEN MODEL",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "The Dolphins revealed Tuesday that they are seeking to trade cornerback Jalen Ramsey. General Manager Chris Grier did not specify the reason for shopping Ramsey, who the Dolphins have paid a $4 million roster bonus with $21 million left to be paid in 2025.\n\nHe will become the latest big name to depart Miami this offseaosn.\n\nDefensive tackle Calais Campbell left in free agency, returning to Arizona, and left tackle Terron Armstead retired.\n\nGrier scoffed at the suggestion that the Dolphins are in a “soft rebuild” or “a reset.”\n\n“No. That word has not been brought up at all,” Grier said, via a transcript from the team. “We have a lot of really good football players on this roster still at some places that impact games, so that word has not been used at all. Our goal is to win, win this year and keep winning for sustained success in the future.”\n\nThe Dolphins, who missed the playoffs in 2024 with an 8-9 record, have not won a playoff game since 2000. They haven’t won the Super Bowl since 1973 and last played in the Super Bowl in 1984.\n\nGrier is entering his 10th season as G.M. and coach Mike McDaniel his fourth. It’s a what-have-you-done-for-me-lately league as well as a not-for-long league, and the Dolphins have only three postseason appearances and no postseason wins in Grier’s tenure.\n\nGrier insists he feels no addition pressure this season.\n\n“I feel pressure every year to win,” Grier said. “If you don’t have pressure and want to win each year, then we’re in the wrong business. We know what it is. We went to the playoffs two years and people liked some of the stuff we did, and then last year, we struggled early and couldn’t get out of it and now everybody wants us all fired. So you understand what’s going on. You feel the pressure, but you don’t let it drive you. You do your job to the best of your ability and work with guys, and you have to work under pressure. So for me, it’s just doing the best job we can and making good, smart decisions for the Miami Dolphins.”\n\nDISCLAIMER: This site and the products offered are for entertainment purposes only, and there is no gambling offered on this site. This service is intended for adult audiences. No guarantees are made for any specific outcome. If you or someone you know has a gambling problem, please call 1-800-GAMBLER.",
    "category": "    Sports",
    "estimated_duration": "",
    "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/chris-grier-scoffs-at-idea-dolphins-are-in-soft-rebuild-our-goal-is-to-win-this-year",
    "title": "CHRIS GRIER SCOFFS AT IDEA DOLPHINS ARE IN SOFT REBUILD: OUR GOAL IS TO WIN THIS YEAR",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "It's become a cliché in the last decade, but that only underscores how true it is: Success in the NFL comes down to fit just as much as talent and determination.\n\nAs good as these guys are, it does wonders to land on the right roster, or in the right offense, or with the right coaches in your ear — or, if you're really lucky, all of the above.\n\nThat's why we're putting the crystal ball aside today. As fun as it is to project the landing spots for the draft's top prospects, this is more about the best-case scenarios.\n\nLooking at some of the top quarterback prospects in this year's class, let's determine not where we think they'll go — but where they're most likely to be successful.\n\nIt'd be a shocker if Ward isn't drafted No. 1 overall by Tennessee, so there's no need for hypotheticals here.\n\nPeople can joke because the Titans were bad enough to earn that first pick, but this really isn't a bad landing spot for a talented young quarterback. All five of the Titans' starting offensive linemen were major investments, either via first-round draft pick or a lucrative free agency contract. The skill group isn't impressive, but Calvin Ridley, Tony Pollard, Tyjae Spears and Chig Okonkwo is not an awful starting point. And the Titans also hold the No. 35 overall pick if they want to further upgrade that group.\n\nIn addition to the personnel, head coach Brian Callahan already has experience coaching a rookie quarterback in this situation from his stint in Cincinnati. If he's going to keep this job, he should be up to tailor the offense to fit Ward's strengths.\n\nIt's certainly not the best situation a No. 1 overall pick has ever stepped into, but it's more than good enough.\n\nIt's tough to imagine Sanders taking this big of a tumble down the draft board, especially after what we've learned about Derek Carr's status for 2025.\n\nDespite that, I do think the best overall fit for him is down at pick No. 26, where the Rams could select him as the eventual successor to Matthew Stafford.\n\nAfter processing the initial disappointment of not being a Day 1 starter, this could pay enormous dividends for team and player.\n\nMaybe this doesn't sound right on the surface, because Sanders is a vast departure from what Stafford brings to the table. Rams coach Sean McVay would be losing the jet-fueled arm strength that makes the Stafford Rams so fun to watch.\n\nThat obvious limitation aside, there's plenty of reason to think McVay could mold Sanders into a very successful NFL quarterback. Sanders has fantastic accuracy and adequate arm strength, and while he might not be a dual-threat quarterback, he has more than enough mobility to deal with pressure — which was easily the biggest drawback in Jared Goff's game when he played for McVay.\n\nSanders has the skill set to operate McVay's offense, and obviously L.A. has the personnel and coaching to help him succeed. The bonus is that a year or two behind Stafford could teach him plenty about NFL anticipation and decision-making. \n\nThis might not be the most exciting landing spot on draft night, but no one will care when it pays off big time in 2026 or 2027.\n\nI'm not advocating that the Browns draft Dart with the No. 2 overall pick, but what about the first overall pick of the second round — No. 33? Or, if they love him enough, perhaps a trade up into the back end of the first round?\n\nThankfully, the Browns have done enough at quarterback to avoid breaking a prospect like Dart, who probably needs time to develop. Between Joe Flacco and Kenny Pickett, someone can give Cleveland decent enough snaps to keep a rookie off the field for at least the first half of the season — if not (preferably) longer.\n\nOnce we push past the prospect of immediate playing time, there's a lot to like in pairing Dart with Browns head coach Kevin Stefanski. Let's start with the obvious one, which is that Dart excels at what Stefanski likes to do. Ole Miss' playbook is built around RPOs and play-action concepts. Stefanski called play-action passes at the fourth-highest clip in the league last year and the second-highest rate in 2023. This is a match made in tendency heaven.\n\nDart has the athleticism and the arm strength to do it, too. He just needs seasoning at the high-level NFL stuff like progression reading and high-leverage decision-making. There aren't many better teachers than Stefanski, who won Coach of the Year in 2023 despite starting five quarterbacks.\n\nI don't want to be the latest person to poke fun at Shough's seven-year stint in college, but he probably needs to land somewhere with a clear path to the field. He'll be 29 at the end of his rookie contract, so there's no time to lose.\n\nVegas is no longer an ideal scenario after the Geno Smith extension, but it's not a dealbreaker, either. Smith's contract has an out after the 2026 season, so that doesn't need to be a long-term marriage if the Raiders decide they're better served elsewhere.\n\nIn the meantime, Smith could serve as a useful mentor to Shough. It's not a perfect comparison, but the playing styles are at least similar. Like Smith, Shough has better mobility than he gets credit for, with both the arm strength and the athleticism to make off-schedule plays you might not expect. Shough could also use some work at managing pressure efficiently, which is Smith's specialty. \n\nI've been beating the drum for weeks that the Giants can address their quarterback problem without using the No. 3 overall pick, and here's a perfect example.\n\nMilroe is a flawed quarterback prospect. His accuracy and decision-making are erratic, his mechanics are inconsistent. He needs time to sit and be taught how to play quarterback from the pocket. He's still an insane enough athlete that he'll have a chance to go in the second or third round, where the Giants own high draft picks.\n\nIf we can get past Brian Daboll's tenuous job security, New York honestly sounds like a great place to try Milroe out. Daboll is currently a punching bag because the Giants have been terrible, but he is the guy who helped develop Josh Allen from a raw and athletic prospect to an All-Pro caliber quarterback.\n\nHe also maximized Daniel Jones' athletic skill set, coaching him to a 3:1 touchdown-to-interception ratio, 708 rushing yards and a playoff appearance in 2022.\n\nAthleticism is what Milroe has in spades. He's got the speed and explosiveness to be a weapon, he simply needs someone to help him develop his cannon of an arm into a more consistent part of his game.\n\nWith Russell Wilson on the roster, there'd be no pressure on Milroe to play right away. And if the Giants win enough games to keep Daboll in his job, perhaps the young guy would have a chance to grow his game enough to see meaningful snaps under center.\n\nThis is more about the team than the player, if I'm being honest.\n\nThe Panthers saw exciting, improved play from Bryce Young in the second half of 2024 — enough so that drafting a quarterback in the top 10 shouldn't be on their radar. \n\nThat said, Panthers owner David Tepper has developed a well-earned reputation for impatience and impulsiveness. I can't let go of the idea that he might seek to add to the quarterback room, even if it's not with a first-round pick.\n\nEnter Ewers, who has a much higher profile than his eventual draft slot. Ewers was good enough to be the No. 1 prospect in the country coming out of high school, start for Texas and lead the Longhorns to the College Football Playoff. That pedigree might get him drafted in the top 100, even if his accuracy and decision-making could use some work.\n\nThe Panthers own pick No. 74 in the third round, as well as picks No. 111 and 114 in the fourth round. It's prime territory for drafting a developmental quarterback to sit behind Young – and potentially succeed him, if he doesn't earn an extension with Carolina.\n\nThe big question surrounding the Steelers is whether they'll go after one of the high-profile quarterback prospects like Shedeur Sanders or Jaxson Dart in the first round.\n\nIf they don't, I think Howard makes a ton of sense as a later option — perhaps with their fourth-round pick.\n\nThere are multiple reasons for that. Howard seems to ooze the character and football-driven mindset the Steelers covet. He was a team captain and scored 67 career touchdowns across four years at Kansas State, and that was before he transferred to Ohio State and helped the Buckeyes to a national championship.\n\nThat's bound to make Steelers coach Mike Tomlin like him, but the fit works from a football standpoint, too.\n\nHoward is a big, athletic guy with some athleticism. He rushed for 26 touchdowns in college, and he did some of his best work as a passer off of bootlegs and play-action. He also had a fantastic success rate on deep balls, completing eight passes of 50-plus yards last year.\n\nHe's not the same caliber of athlete as Ryan Tannehill, but the tools are similar. That should be plenty intriguing for Steelers offensive coordinator Arthur Smith, who famously revitalized Tannehill's career.\n\nAs previously mentioned, you've got to consider New Orleans as a likely landing spot for Shedeur Sanders with Derek Carr's future there in doubt.\n\nEven if the Saints aren't interested in using the No. 9 overall pick on a quarterback, they should still probably address the position somehow. Spencer Rattler and Jake Haener are the only other quarterbacks on the roster if Carr can't go.\n\nMcCord might not be a lock to win the starting job, but I have a feeling new head coach Kellen Moore would appreciate his skill set. Not gifted with an especially strong arm or eye-popping athleticism, McCord wins with accuracy, anticipation and his knowledge of what he's looking at. What he lacks in ability, he makes up for with an advanced understanding of the position. That sounds a lot like the quarterback Moore was at Boise State — though, admittedly, McCord is a bigger and more athletic prospect than Moore was.\n\nThe point remains: McCord is a guy you can put under center and expect he'll where to put the football — even if the ball doesn't look exciting getting there. The Saints already have a big-armed quarterback in Rattler, so maybe Moore would prefer to work with a skill set he intimately understands.\n\nMaybe this is too elementary, but just bear with me because it sounds fun.\n\nSimply put, Leonard is a match for the type of quarterback the Bills have in Josh Allen. They are not remotely the same caliber of prospect, which is why Allen went No. 8 overall and Leonard figures to slip to Day 3. Leonard's not as big, he doesn't have the same caliber arm, etc., etc.\n\nIt'd still be fun to pair Allen with a backup who plays the same way. Leonard is just shy of 6-foot-4, has a solid arm and threw himself around to the tune of 906 rushing yards and 17 touchdowns on the ground. Drafting him would allow the Bills some consistency with their offense in the event that Allen misses time. It would also allow Leonard to learn from a guy who sees and plays the game with the same type of athleticism and reckless abandon.\n\nLeonard projects as a fourth or fifth-round pick, according to The Athletic's Dane Brugler. The Bills own 10 draft picks — two of those come in the fourth round and another three in the fifth.\n\nNobody's saying the Bills have to fire Mitchell Trubisky, if they'd prefer he remains as a veteran backup. But Leonard would be a heck of a fun third-string quarterback to serve as a project and a potential high-end backup in time.\n\nDavid Helman covers the NFL for FOX Sports and hosts the NFL on FOX podcast. He previously spent nine seasons covering the Cowboys for the team's official website. In 2018, he won a regional Emmy for his role in producing \"Dak Prescott: A Family Reunion\" about the quarterback's time at Mississippi State. Follow him on Twitter at @davidhelman_.\n\nWant great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.",
    "category": "    Sports",
    "estimated_duration": "",
    "link": "https://www.foxsports.com/stories/nfl/2025-nfl-draft-qb-matchmaker-shedeur-sanders-rams-best-team-fits-9-qbs",
    "title": "2025 NFL DRAFT QB MATCHMAKER: SHEDEUR SANDERS TO RAMS? BEST TEAM FITS FOR 9 QBS",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "The 2025 NFL Draft is almost here, and Yahoo Sports experts Nate Tice and Charles McDonald are breaking down the top prospects position by position. Here are the quarterbacks. Check out Nate and Charles' consensus big board here, along with Nate's final big board and Charles' final big board.\n\nNate Tice: Cam Ward exudes calmness when you watch him. Whether it’s in his pocket movements or executing in big moments, Ward is more than happy to try and make tough throws or attempt trick shots. He has no qualms continuing it even when punished.\n\nWard has a good frame, a good arm with a quick sidearm delivery that can attack all three levels, and he can create with his legs or off-platform when needed. He can also make the higher-difficulty plays. Ward can get a little too carried away with his heat-check moments and have some throws get away from him, but he has continued to add layers to his game at each stop of his college career and makes everyone around him better.\n\nWard is a good, but not overwhelming athlete, but is an effective scrambler with a good clock in his head for when to tuck the ball and run. Ward measured in under 6-foot-2 at the combine, but his height isn’t a deterrent because of his ability to quickly operate and change arm angles around pass rushers.\n\nWard still has a few things to clean up, and might lack a true overwhelming trait, but he’s young and has already shown the ability to operate (and excel) both in and out of structure — with results, too. Any fan base that drafts him should be rightfully excited because Ward is just a fun player to watch. You gotta love a QB that tries stuff.\n\nCharles McDonald: Ward took a windy road to get here, but he’s nearly the consensus top quarterback in this year’s class. He went from Incarnate Word to Washington State to Miami and never looked out of place at any spot.\n\nThis past season, Ward was the driving force behind Miami’s success and nearly dragged the Hurricanes to the College Football Playoff despite having a porous defense. Ward is a big-time risk-taker on the field, but his arm talent and accuracy downfield allowed him to keep the Hurricanes alive in tough spots. His willingness to hunt big plays gets him in trouble sometimes, but it’s better to have to rein that in than try to get him to play outside of his comfort zone. — Charles McDonald\n\nWard will have a learning curve early on as he adapts his style to the increased pace of NFL play, but he has all the tools to be an NFL franchise quarterback.\n\nCharles McDonald: Sanders will likely go much, much higher than 37th overall, which is where I have him ranked, by the time the draft comes. That’s just the nature of quarterback drafting in the NFL right now. However, it is fair to wonder exactly what his ceiling is.\n\nNate Tice: Sanders improved his play this season, especially with his feel in the pocket and timing that he plays with on concepts. Sanders is tough, has a good arm and is more than willing to challenge defenders on tougher throws like in-breakers over the middle. When in rhythm, he can let his pass catchers thrive because of his friendly ball placement.\n\nSanders has below-average size and is also just an average athlete, which shows up when asked to create. He has markedly better pocket movement (although he still has a tendency to drift backward).\n\nSanders still has plenty to work on, especially in regards to timing and feel in the pocket. And while he has a good-enough arm for the NFL, his tools aren’t overwhelming enough to consistently mitigate tough situations. Sanders will have to be dropped into a good ecosystem to keep ascending at the next level.\n\nNate Tice: I did a deep dive on Shough recently. The tl;dr — Shough is an old prospect with an injury history, but he is a good athlete who can absolutely spin it, especially while throwing on the move. He also doesn’t take sacks (which can be both good and bad). There are enough high-end throws on Shough’s tape that makes him interesting. Teams are going to have to gauge how early it is to draft a QB who was in the same high school recruiting class as Trevor Lawrence.\n\nCharles McDonald: Shough is a quality quarterback prospect, but injuries and age make him a curious case to crack this draft season. Shough will be 26 this fall and was in college for seven seasons. He operated Louisville’s offense well and has some nice traits as a passer. He has starter potential, but the path to get here doesn’t have a great track record of working out in the NFL.\n\nCharles McDonald: Look, Dart is going higher than this on draft weekend, but this ranking isn’t going to be in line with that. Dart has some intriguing physical tools to develop, but his accuracy is streaky and he has a big learning curve coming from Lane Kiffin’s offense to the NFL. Someone will get enticed with the peak plays he makes, but there’s a lot of room to grow here before he’s ready to start every week in the NFL.\n\nNate Tice: I wrote more extensively about Dart recently. Overall, he has interesting size and tools to work with. But his ability to consistently work through plays is still a work in progress that will need time to sharpen at the next level.\n\nNate Tice: I’m likely going to be one of the higher people on Leonard. I do think there is a lot to like and tools to work with for a Day 2 dart throw.\n\nLeonard has good size and is an excellent athlete who is a weapon on designed runs and in the open field. He has a good feel in the pocket (but can bail outside a bit too quickly at times) with an ability to mitigate sacks and pressure, something he has now shown behind two shaky offensive lines at Duke and then behind a — forgive the pun — green Notre Dame unit.\n\nLeonard is an accurate thrower underneath with some real flashes of layering throws (and some downright excellent throws like at the end of the game against Indiana in the CFP), but his deep ball remains a gigantic question mark and he can have bad sprays crop up now and again. Some of that was Notre Dame’s iffy receiving core, but Leonard did feel like he was never comfortable consistently pushing the ball at times.\n\nLeonard’s tools, toughness and ability to avoid negative plays make him intriguing to me, and his overall passing has picked up as the season went along as Notre Dame’s offense – and personnel – started to mature. I give Leonard some leeway because he was late to the QB position (with basketball being his main focus and playing wide receiver early in high school). But he still has to show that he can execute those complex throws on a more consistent basis, which might never happen and will make him more just an interesting backup option.\n\nBut it’s not the worst bet to make on such a competitive player with this much athleticism — who shows more feel for the position than he gets credit for — could turn into a starter down the road, with the usual “gets proper coaching” caveat.",
    "category": "    Sports",
    "estimated_duration": "",
    "link": "https://sports.yahoo.com/nfl/article/2025-nfl-draft-position-rankings-qbs-headlined-by-cam-ward-shedeur-sanders-222647950.html",
    "title": "2025 NFL DRAFT POSITION RANKINGS: QBS HEADLINED BY CAM WARD, SHEDEUR SANDERS",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Scientists thought they saw a distant star swallow a planet for the first time ever. But new observations from the James Webb Space Telescope suggest something very different, but equally rare, may have happened instead.\n\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n\nIn 2020, astronomers observed for the first time what appeared to be a star engulfing one of its orbiting planets. But now, new evidence shows something else actually happened.\n\nA planet certainly met its demise at the behest of its star, but now the way it happened looks much different. Rather than this star expanding, it drew the planet closer and closer until it was consumed, new evidence from NASA's James Webb Space Telescope (JWST) reveals. This novel event serves as an equally fascinating first — even if it's not what astronomers initially believed it to be. The researchers published their findings April 10 in The Astrophysical Journal.\n\n\"It's not every day that we find these kinds of events,\" the study's first author, Ryan Lau, an assistant astronomer at the National Science Foundation National Optical-Infrared Astronomy Research Laboratory in Tucson, Arizona, told Live Science. This is \"likely the first planetary engulfment event that was caught in the act.\"\n\nThe celestial event, dubbed ZTF SLRN-2020, involves a star and its Jupiter-size planet, located in the Milky Way approximately 12,000 light-years from Earth. While watching the star, researchers noticed a bright flash of optical light, indicating that something — most likely a large planet — had been engulfed by the star, leaving only a cloud of dust behind.\n\nInitially, researchers thought the star was similar to the sun and was following the natural life cycle of sunlike stars. A 2023 paper published in the journal Nature described the star as entering its final stage of life as a red giant, in which it balloons significantly as it exhausts its supply of hydrogen fuel. The sun will meet this fate in about 5 billion years, ultimately swallowing Mercury, Venus and, likely, Earth in the process.\n\nBut the data from JWST \"paints a very different scenario,\" Lau said. As JWST's Mid-Infrared Instrument and Near-Infrared Spectrograph gathered information from the scene of the crime, a new picture appeared. The observations revealed that the star had not been emitting light in the form of infrared wavelengths expected from the transition into a red giant. In other words, it wasn't as bright as expected, indicating that the red giant process likely wasn't afoot.\n\nRelated: After 2 years in space, the James Webb telescope has broken cosmology. Can it be fixed?\n\nGet the world’s most fascinating discoveries delivered straight to your inbox.\n\nAs for the devoured planet, the team proposes that it orbited unusually close to its host star — even closer than Mercury orbits the sun. Ultimately, the Jupiter-size planet started moving closer and closer to its star in a process called orbital decay. Lau and his team attribute this orbital decay to tidal interactions, a phenomenon in which strong gravitational forces between two celestial bodies can change the dynamics between those bodies.\n\n—Newly discovered comet SWAN just 'erupted' with a bright, icy burst. Is it a cold volcano?\n\n—Record-breaking 'dead' galaxy discovered by JWST lived fast and died young in the early universe\n\n—Astronomers are shocked to find our galaxy's nearest neighbor is being torn to shreds\n\nThe whole process probably took just a few months, Lau said. After the planet spiraled in toward the star, it made contact with the star's surface. From there, drag forces sucked it into the star's core, where it was fully engulfed. The star then ejected the planetary material, which created the brightening event first detected in 2020. This ejection also included longer-lasting infrared wavelengths and dust, which led astronomers to believe that the star had expanded, when, in fact, it did not.\n\nEvents like these can be hard to spot because the light signatures they produce are often quite faint. With the opening of the Vera C. Rubin Observatory, Lau said, these observational signatures — and their associated events — could become much easier to detect.\n\n\"We should be finding way more of these,\" Lau said. \"That's one thing I'm very excited about.\"\n\nElana Spivack is a science writer based in New York City. She has a master's degree from New York University's Science Health and Environmental Reporting Program and a bachelor's from Kenyon College in Ohio. She's written for Inverse, Popular Science, BitchMedia and others.\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nNewly discovered comet SWAN just 'erupted' with a bright, icy burst. Is it a cold volcano?\n\nLyrid meteor shower peaks next week: How to spot the most 'shooting stars'\n\nPrimates: Facts about the group that includes humans, apes, monkeys and other close relatives\n\n\nLive Science is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\n\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
    "category": "    Science",
    "estimated_duration": "",
    "link": "https://www.livescience.com/space/astronomy/the-james-webb-telescope-reveals-the-truth-about-a-planet-that-crashed-into-its-own-star",
    "title": "THE JAMES WEBB TELESCOPE REVEALS THE TRUTH ABOUT A PLANET THAT CRASHED INTO ITS OWN STAR",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "A manuscript discovered in the Judean desert contains trial notes on an intricate tax-evasion scheme that involved forgery, fiscal fraud and the false sale of slaves.\n\nA manuscript discovered in the Judean desert contains trial notes on an intricate tax-evasion scheme that involved forgery, fiscal fraud and the false sale of slaves.\n\nInitially misclassified, the ragged 133-line scroll lay unnoticed in the archives of the Israel Antiquities Authority until 2014.Credit...Shai Halevi/Israel Antiquities Authority\n\nIt may not have been the tax-evasion trial of the century — the second century, that is — but it was of such gravity that the defendants faced charges of forgery, fiscal fraud and the sham sale of slaves. Tax dodging is as old as taxation itself, but these particular offenses were considered so serious under Roman law that penalties ranged from heavy fines and permanent exile to hard labor in the salt mines and, in the worst case, damnatio ad bestias, a public execution in which the condemned were devoured by wild animals.\n\nThe allegations are laid out in a papyrus that was discovered decades ago in the Judean desert but only recently analyzed; it contains the prosecutor’s prep sheet and the hastily drafted minutes from a judicial hearing. According to the ancient notes, the tax-evasion scheme involved the falsification of documents and the illicit sale and manumission, or freeing, of slaves — all to avoid paying duties in the far-flung Roman provinces of Judea and Arabia, a region roughly corresponding to present-day Israel and Jordan.\n\nBoth tax dodgers were men. One, named Gadalias, was the impoverished son of a notary with ties to the local administrative elite. Besides convictions for extortion and counterfeiting, his catalog of misdeeds included banditry, sedition and, on four occasions, failing to show up for jury duty at the court of the Roman governor. Gadalias’s partner in crime was a certain Saulos, his “friend and collaborator” and the supposed mastermind of the caper. Although the ethnicity of the accused is not explicitly stated, their Jewish identities are assumed, based on their biblical names, Gedaliah and Saul.\n\nThis ancient legal drama unfolded during the reign of Hadrian, after the emperor’s tour of the area around A.D. 130 and presumably before A.D. 132. That year, Simon bar Kochba, a messianic guerrilla chief, led a popular uprising — the third and final war between the Jewish people and the empire. The revolt was violently suppressed, with hundreds of thousands killed and most of the surviving Jewish population expelled from Judea, which Hadrian renamed Syria Palestina.\n\n“The papyrus reflects the suspicion with which the Roman authorities viewed their Jewish subjects,” said Anna Dolganov, a historian of the Roman Empire with the Austrian Archaeological Institute, who deciphered the scroll. She noted that there is archaeological evidence for coordinated planning of the Bar Kochba revolt. “It is possible that tax evaders like Gadalias and Saulos, who were inclined to disrespect the Roman order, were involved in the preparations,” Dr. Dolganov said.\n\nIn the current issue of Tyche, a journal of antiquity published by the University of Vienna, Dr. Dolganov and three Austrian and Israeli colleagues present the court proceedings as a case study. Their paper brings to light how Roman institutions and imperial law could influence the administration of justice in a provincial setting where relatively few people were Roman citizens.\n\n“The document provides rare and highly interesting evidence for the slave trade in this part of the empire,” said Dennis P. Kehoe, a classicist at Tulane University unconnected to the project, “as well as the circumstances under which Jews might have slaves.”\n\nNo one is certain when or by whom the papyrus was unearthed, but Dr. Dolganov said that it was probably found in the 1950s by Bedouin antiquity dealers. She suspects that the discovery site was Nahal Hever, a steep-walled canyon west of the deep cleft of the Dead Sea where some Bar Kochba rebels, fleeing the Romans, took refuge in natural fault line caves in the limestone cliffs. In 1960, archaeologists found documents from the era in one of the Jewish hide-outs; others have been discovered since.\n\nInitially misclassified, the ragged 133-line scroll lay unnoticed in the archives of the Israel Antiquities Authority until 2014, when Hannah Cotton Paltiel, a classicist at the Hebrew University of Jerusalem, realized that it was written in ancient Greek. In light of the document’s complexity and extraordinary length, a team of scholars was assembled to conduct a detailed physical examination and cross-reference names and locations with other historical sources.\n\nDeciphering the papyrus and reconstructing its intricate narrative posed major challenges to Dr. Dolganov. “The letters are tiny and densely packed, and the Greek is highly rhetorical and full of technical legal terms,” she said. Unlike in documents such as contracts, there were no formulaic expressions that made the translation easier. “It certainly does not help that we only have the second half, or less, of the original,” Dr. Dolganov said.\n\nThe researchers deduced that the tax scheme was designed to escape notice, which meant careful detective work was required to piece together what happened. “I had to adopt the perspective of the Roman fiscal administration to understand what the text is talking about,” she said. Dr. Dolganov also had to imagine the dodge from the standpoint of the accused: To commit tax fraud with the slave trade in the most remote corner of the Roman world, what would you have to do, and what would have made the effort profitable?\n\nThe ancient scheme has resonated deeply with modern tax lawyers. A German lawyer told Dr. Dolganov that the shenanigans of Gadalias and Saulos were not all that different from today’s most common forms of tax fraud — shifting assets, phony transactions. And the Roman interrogation methods were largely in line with Untersuchungshaft — investigative custody — for financial crimes, which involves intimidation and often brutal questioning.\n\n“Dr. Dolganov has performed wonderful feats of scholarship in unraveling the meaning of the contents and their significance for the history of the region and the empire,” said Brent Shaw, a classicist at Princeton University who was not involved in the project.\n\nThe case against Gadalias and Saulos was bolstered by information provided by an informant who tipped off the Roman authorities — and the text even suggests that the informant was none other than Saulos, who denounced his accomplice Chaereas to protect himself in a looming financial investigation. The most likely scenario, Dr. Dolganov said, was that Saulos, a resident of Judea, arranged the bogus sale of several slaves to Chaereas, who lived in the neighboring province of Arabia.\n\nBy being sold across the provincial border, the slaves would have vanished in print from Saulos’s assets in Judea. But because they physically stayed with Saulos, the alleged buyer, Chaereas, could opt not to declare them in Arabia. “Thus, on paper, the slaves disappeared in Judea but never arrived in Arabia, thereby becoming invisible to Roman administrators,” Dr. Dolganov said. “Henceforth, all taxes on these slaves could be avoided.”\n\nThe empire had sophisticated systems for tracking slave ownership and collecting various taxes, which amounted to 4 percent on slave sales and 5 percent on manumissions. “To free a slave in the empire, you had to present documentary evidence of the slave’s current and previous ownership, which had to be officially registered,” Dr. Dolganov said. “If any documents were missing or looked suspicious, Roman administrators would investigate.”\n\nTo hide Saulos’s double-dealing, Gadalias, the notary’s son, evidently forged the bills of sale and other legal agreements. When the authorities became aware of the matter, the defendants allegedly made payments to a local city council for protection. At the trial, Gadalias blamed his late father for the forgeries, and Saulos pinned the manumission on Chaereas. The papyrus offers no insight into their motive. “Why the men took the risk of freeing a slave without valid papers remains a mystery,” Dr. Dolganov said.\n\nOne possibility is that, by faking the sale of slaves and then releasing them, Gadalias and Saulos were observing a Jewish biblical duty to free enslaved people. Or maybe there was profit to be made in capturing people — perhaps even willing participants — from beyond the border, bringing them into the Empire and then releasing them from their “slavery” to become free Romans. Or maybe Gadalias and Saulos were human traffickers, plain and simple — Dr. Dolganov emphasized that the alternate story lines were entirely speculative, as nothing in the text supported them.\n\nWhat surprised her most about the trial, she said, was the professionalism of the prosecutors. They employed deft rhetorical strategies worthy of Cicero and Quintilian and displayed an excellent command of Roman legal terms and concepts in Greek. “This is the edge of the Roman Empire, and boom, we see legal practitioners of high caliber who are competent in Roman law,” Dr. Dolganov said.\n\nThe papyrus does not reveal the final verdict. “If the Roman judge was convinced these were hardened criminals and execution was in order, Gadalias as a member of his local civic elite may have received a more merciful death by decapitation,” Dr. Dolganov said. “At any rate, almost anything is better than being eaten by leopards.”",
    "category": "    Science",
    "estimated_duration": "",
    "link": "https://www.nytimes.com/2025/04/14/science/archaeology-papyrus-tax-fraud-trial.html",
    "title": "HOW TO EVADE TAXES IN ANCIENT ROME? A 1,900-YEAR-OLD PAPYRUS OFFERS A GUIDE.",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "[No readable article text found.]",
    "category": "    Science",
    "estimated_duration": "",
    "link": "https://www.smithsonianmag.com/smart-news/high-school-student-discovers-1-5-million-potential-new-astronomical-objects-by-developing-an-ai-algorithm-180986429/",
    "title": "HIGH SCHOOL STUDENT DISCOVERS 1.5 MILLION POTENTIAL NEW ASTRONOMICAL OBJECTS BY DEVELOPING AN A.I. ALGORITHM",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript.\n\nYou can also search for this author in PubMed\n Google Scholar\n\n\nYou can also search for this author in PubMed\n Google Scholar\n\n\nAs conference coordinators from a lower-middle-income country in southeast Asia, we read with interest Kara Hanson’s World View about the visa-related difficulties that researchers in low- and middle-income countries (LMICs) face (Nature 639, 9; 2025). \n\n\n        Access Nature and 54 other Nature Portfolio journals\n      \n\n\n        Get Nature+, our best-value online-access subscription\n      \n\n\n        Receive 51 print issues and online access\n      \n\nPrices may be subject to local taxes which are calculated during checkout\n\n\n\n\n                        \n                        How visa rejections are stalling Africa’s health research\n                    \n\n\n\n\n                        \n                        See more letters to the editor\n                    \n\n\nDiscussions of technologies’ societal impacts are still too limited\n\nShould I return to my home country after my PhD abroad?\n\nShould I return to my home country after my PhD abroad?\n\nRichard Fortey obituary: palaeontologist, author and TV presenter who traced continents through fossils\n\nThe Department of Pathology in the Wayne State University School of Medicine (https://pathology.med.wayne.edu/) is expanding its high-impact resear...\n\nUnited Arab Emirates University (UAEU), in collaboration with the College of Medicine and Health Sciences (CMHS)\n\nResearch on exploration of physics and device application using dielectric materials, ionic conductors, and magnetic materials based on transport...\n\nWork time part-time   Start date 01.06.2025   Employment period limited   Application deadline 30.04.2025 Deployment location Charité Campus Charit...\n\n\n\n\n                        \n                        How visa rejections are stalling Africa’s health research\n                    \n\n\n\n\n                        \n                        See more letters to the editor\n                    \n\n\nAn essential round-up of science news, opinion and analysis, delivered to your inbox every weekday.\n\nSign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily.\n\n\n\n                    Nature (Nature)\n                \n\nISSN 1476-4687 (online)\n    \n\nISSN 0028-0836 (print)\n    \n",
    "category": "    Science",
    "estimated_duration": "",
    "link": "https://www.nature.com/articles/d41586-025-01204-x",
    "title": "ENSURING THAT CONFERENCES ARE INCLUSIVE REQUIRES DIVERSE ORGANIZERS",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "In the darkness of the South Atlantic Ocean, researchers captured footage of a living colossal squid (Mesonychoteuthis hamiltoni) for the first time. And while the elusive creature is known for its size—reaching lengths of 23 feet—this one is a baby and a mere one foot long. \n\nIn 1925, fisherman first found the remains of a colossal squids inside a sperm whale. Over the next century, only eight adult colossal squids have been found, all postmortem. \n\n“It’s exciting to see the first in situ footage of a juvenile colossal and humbling to think that they have no idea that humans exist,” Dr. Kat Bolstad of the Auckland University of Technology, an independent scientific expert who was consulted to verify the footage, said in a statement. “For 100 years, we have mainly encountered them as prey remains in whale and seabird stomachs and as predators of harvested toothfish.”\n\nA team of scientists captured the groundbreaking footage using a remotely operated vehicle (ROV) on March 9 while onboard the Schmidt Ocean Institute’s research vessel Falkor (too). The 35-day expedition was part of an Ocean Census expedition searching for new marine life, and a collaboration between Schmidt Ocean Institute, the Nippon Foundation-Nekton Ocean Census, and GoSouth, a joint project between the University of Plymouth (UK), GEOMAR Helmholtz Centre for Ocean Research (Germany), and the British Antarctic Survey. \n\nThe juvenile squid appears translucent as it skirts through the water, but as it ages, it will become less see-through as its muscles thicken. Its large eyes—the largest of any known creature—can also be seen in the footage. Bolstad explains that the reason the squids have been so hard to find with cameras could be because of the sensitivity of their enormous eyes. “Most of our deep-sea exploration equipment is large, noisy and uses bright lights if we are trying to film animals,” Bolsted writes on The Conversation. \n\nDr. Jyotika Virmani, Schmidt Ocean Institute’s executive director, summed up the breakthrough: “These unforgettable moments continue to remind us that the Ocean is brimming with mysteries yet to be solved,” \n\nBreakthroughs, discoveries, and DIY tips sent every weekday.\n\nBy signing up you agree to our Terms of Service and Privacy Policy.\n\nArticles may contain affiliate links which enable us to share in the revenue of any purchases made.\n\nRegistration on or use of this site constitutes acceptance of our Terms of Service.\n\n© 2025 Recurrent. All rights reserved.",
    "category": "    Science",
    "estimated_duration": "",
    "link": "https://www.popsci.com/environment/colossal-squid-filmed-in-deep-ocean-for-the-first-time-ever/",
    "title": "COLOSSAL SQUID FILMED IN DEEP OCEAN FOR THE FIRST TIME EVER",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Platforms such as iNaturalist and eBird encourage people to observe and document nature, but how accurate is the ecological data that they collect?\n\nIn a new study published in Citizen Science: Theory and Practice March 28, researchers from the University of California, Davis, show that citizen science data from iNaturalist and eBird can reliably capture known seasonal patterns of bird migration in Northern California and Nevada -- from year-round residents such as California Scrub-Jays, to transient migrants such as the Western Tanager and the Pectoral Sandpiper.\n\n\"This project shows that data from participatory science projects with different goals, observers and structure can be combined into reliable and robust datasets to address broad scientific questions,\" said senior author Laci Gerhart, associate professor of teaching in the UC Davis Department of Evolution and Ecology. \"Contributors to multiple, smaller projects can help make real discoveries about bigger issues.\"\n\nThe study began as a student capstone project in Gerhart's Wild Davis field course, which teaches students about urban ecology and California ecosystems. First author Cody Carroll, now an assistant professor at the University of San Francisco, took the course in 2020 while completing his doctorate in statistics at UC Davis.\n\nMost Wild Davis capstone projects are focused on community service at the Stebbins Cold Canyon Nature Reserve, but students were restricted to computer-based projects during the COVID-19 shutdown, so Carroll decided to use his statistical expertise to analyze data from iNaturalist.\n\nAfter Carroll graduated and began working at USF, the team regrouped and took the project a step further by combining the iNaturalist data with data from eBird, a different citizen science platform that is preferred by bird enthusiasts with significant birding experience.\n\nSince iNaturalist and eBird differ substantially in the type of data they collect and the type of user they appeal to, the team wanted to investigate whether their data could be integrated.\n\n\"eBird is more geared toward trained and very active birders who are doing complete record keeping of the birds that they're seeing in particular areas,\" said Gerhart. \"iNaturalist is intentionally geared toward more casual observers who are there as much to learn about the organisms as they are to document them scientifically.\"\n\nTo merge the data, Carroll considered the relative frequency of observations rather than the overall number of observations and also took into account the cyclic, seasonal nature of bird migrations.\n\nOverall, the researchers compared data for 254 different bird species that were observed in Northern California and Nevada in 2019 and 2022. They found that the two platforms showed similar seasonal patterns for over 97% of bird species.\n\nTo \"ground truth\" their findings, Gerhart and Carroll teamed up with Rob Furrow, an assistant professor of teaching in the Department of Wildlife, Fish and Conservation Biology, who is an avid bird watcher and eBird user.\n\n\"We wanted to test whether we were seeing actual migratory patterns or whether these were just due to biases in the observations, so we reached out to Rob, who is an expert about birds,\" said Gerhart.\n\nWith Furrow's expertise, the team showed that the combined iNaturalist and eBird data recapitulated a variety of known bird seasonality patterns within the region -- meaning that the patterns were representative of actual bird presence, not due to biases in the observations.\n\nFor example, their data showed that California Scrub-Jays are present in the region year-round, whereas Bufflehead ducks arrive in mid-fall and depart in early spring. Western Tanagers pass through in late spring when they journey south for winter, and again in late summer as they fly back northwards to breed.\n\n\"We were really pleasantly surprised that we could still get reliable data, despite the differences between eBird and iNaturalist,\" said Furrow. \"Even when you're relying on casual hobbyists who are taking photos of what they like, when they like, you're still getting a reliable representation of the birds in that area at that time.\"\n\nThe study shows that in addition to inspiring people to connect with nature, platforms such as iNaturalist and eBird can help answer important biological questions.\n\n\"This is a good example of why interdisciplinarity is important -- we each brought different knowledge to this project, and it pushed each of us intellectually,\" said Gerhart. \"It was a really fun experience for us to combine our skill sets, and I hope that Cody, Rob and I have a chance to work together again.\"\n\nTo give back to the people who helped collect the data they used, the team made a point to publish their results in an open access journal. Carroll also created a dashboard, in collaboration with a student at USF, that allows people explore and visualize the seasonality patterns for all 254 bird species.\n\n\"It's important for scientists who are relying on publicly generated data to make sure that their results are also publicly available,\" said Gerhart.\n\nMaterials provided by University of California - Davis. Note: Content may be edited for style and length.\n\nStay informed with ScienceDaily's free email newsletter, updated daily and weekly. Or view our many newsfeeds in your RSS reader:\n\nKeep up to date with the latest news from ScienceDaily via social networks:\n\nTell us what you think of ScienceDaily -- we welcome both positive and negative comments. Have any problems using the site? Questions?",
    "category": "    Science",
    "estimated_duration": "",
    "link": "https://www.sciencedaily.com/releases/2025/04/250415160400.htm",
    "title": "CAN CITIZEN SCIENCE BE TRUSTED? NEW STUDY OF BIRDS SHOWS IT CAN",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Pop star Katy Perry and five other women safely returned to Earth after reaching space aboard Jeff Bezos's Blue Origin rocket.\n\nThe singer was joined by Bezos's fiancée Lauren Sánchez and CBS presenter Gayle King, who said a highlight of the flight was hearing Perry sing Louis Armstrong's \"What a Wonderful World\".\n\nAfter landing back on Earth, Perry said she felt \"super connected to life\" and \"so connected to love\".\n\nThe flight lasted around 11 minutes and took the six women more than 100km (62 miles) above Earth, crossing the internationally recognised boundary of space and giving them a few moments of weightlessness.\n\nAlso on board were former Nasa rocket scientist Aisha Bowe, civil rights activist Amanda Nguyen, and film producer Kerianne Flynn.\n\nThe New Shepard rocket lifted off from its West Texas launch site just after 08:30 local time (14:30 BST).\n\nThe capsule returned to Earth with a parachute-assisted soft landing, while the rocket booster also landed back in Texas.\n\nCheering could be heard from inside the capsule as the recovery crew went to collect them.\n\nJeff Bezos opened the capsule door to welcome back Lauren Sánchez, the first to disembark. \n\n\"I'm so proud of this crew,\" she said tearfully. \"I can't put it into words.\"\n\nShe paused, before adding: \"I looked out of the window and we got to see the moon.\"\n\n\"Earth looked so quiet,\" she said, adding that it was not what she expected. \"It was quiet, but really alive.\"\n\nNext out was Katy Perry, who kissed the ground and lifted a daisy to the sky - her daughter is called Daisy.\n\nGayle King also got on her knees and kissed the ground.\n\n\"I just want to have a moment with the ground, just appreciate the ground for just a second,\" she said.\n\nThe last to get out, Kerianne Flynn, pointed at the sky and shouted: \"I went to space.\"\n\nA celebrity cast had watched the launch from the ground.\n\nSpeaking from the viewing platform, Khloé Kardashian said: \"I didn't realise how emotional it would be, it's hard to explain. I have all this adrenaline and I'm just standing here.\"\n\n\"Whatever you dream of is in our reach, especially in today's day and age. Dream big, wish for the stars—and one day, you could maybe be amongst them,\"​ she added.\n\nOprah Winfrey spoke about her friend Gayle King, and revealed she was a nervous flier.\n\n\"I mean, for her—whew—anytime we're on a flight, she's in somebody's lap at the slightest bit of turbulence. She has real, real-world anxiety when it comes to flying. And this... this is her overcoming a wall of fear,\" she said.\n\nThe spacecraft was fully autonomous, requiring no pilots, and the crew did not manually operate the vehicle.\n\nThe last all-female spaceflight was over 60 years ago when Soviet Cosmonaut Valentina Tereshkova became the first woman to travel into space on a solo mission aboard the spacecraft Vostok 6. \n\nSince then, there have been no other all-female spaceflights but women have made numerous significant contributions. \n\nThe space tourism  industry is still in its infancy, so every successful launch is significant and demonstrates that these short, commercial flights can be carried out safely.\n\nBut some critics stress it is tourism, not space science, and professional astronauts undertake missions, including scientific research, for the benefit of humankind.\n\n\"A celebrity isn't an envoy of humankind - they go into space for their own reasons,\" Dr Kai-Uwe Schrogl, special advisor for political affairs at the European Space Agency, told BBC News.\n\n\"These flights are significant and exciting, but I think maybe they can also be a source of frustration for space scientists,\" he added. \"We see space flight as being for science, knowledge and the interests of humanity.\n\n\"Celebrities do it for amusement but get a lot more attention than the regular astronauts.\"\n\nThe space flight also generated a range of response on social media, from enthusiasm to hostility.\n\nDr Tanya Harrison, from the Outer Space Institute experts network said: \"A lot of the comments that I saw on social media were things about, 'Oh, it's like the Real Housewives go to Mars' or 'It's the oligarchy in space, read the room, the timing is terrible.'\"\n\nBut: \"There were a lot of positive takes as well. People were like, 'Oh, this is so cool. Katy Perry is going to space.'\"\n\nDr Harrison, who had previously worked on Nasa missions to Mars said: \"The cynical part of me wants to call it a marketing stunt. This is a company promoting the fact they can launch tourists into space.\"\n\nHowever she noted the all-women team might \"change the demographics a little bit of who might want to do something like this.\"\n\n\"Socially, they might have had some impact\", she said.\n\nIn a news conference after the flight, two of the women took issue with some of the criticism the mission had received, related for example to its cost.\n\n\"I feel that anybody who is criticising doesn't really understand what's happening here,\" said Gayle King.\n\nShe said that the astronauts had had a huge, positive response from young women and young girls.\n\nLauren Sánchez said she had got \"fired up\" about the criticism and would love to have the naysayers come to Blue Origin and see the thousands of employees who \"put their heart and soul into\" the missions.\n\nBlue Origin is a private space company founded in 2000 by Bezos, the billionaire entrepreneur who also started Amazon.\n\nAlthough Blue Origin has not released full ticket prices, a $150,000 (£114,575.85) deposit is required to reserve a seat—underlining the exclusivity of these early flights.\n\nAlongside its suborbital tourism business, the company is also developing long-term space infrastructure, including reusable rockets and lunar landing systems. \n\nThe New Shepard rocket is designed to be fully reusable and its booster returns to the launch pad for vertical landings after each flight, reducing overall costs.\n\nAccording to US law, astronauts must complete comprehensive training for their specific roles.\n\nBlue Origin says its New Shepard passengers are trained over two days with a focus on physical fitness, emergency protocols, details about the safety measures and procedures for zero gravity.\n\nAdditionally, there are two support members referred to as Crew Member Seven: one provides continuous guidance to astronauts, while the other maintains communication from the control room during the mission.\n\nThe rise of space tourism has prompted criticism that it is too exclusive and environmentally damaging.\n\nSupporters argue that private companies are accelerating innovation and making space more accessible.\n\nProfessor Brian Cox told the BBC in 2024: \"Our civilisation needs to expand beyond our planet for so many reasons,\" and believes that collaboration between NASA and commercial firms is a positive step.\n\nRocket engine exhaust contains gases and particles that can affect Earth's climate and ozone layer.\n\nOn its web page under the title \"Protecting our Planet\" Blue Origin claims: \"During flight, the only byproduct of New Shepard's engine combustion is water vapor with no carbon emissions.\"\n\nHowever, Eloise Marais, a professor of Atmospheric Chemistry and Air Quality at University College London points out that water vapour too is a greenhouse gas and is a chemical that is not supposed to be in the upper layers of the atmosphere.\n\n\"It alters the chemistry of the stratosphere, depleting the ozone layer, and also forms clouds that affect climate,\" she says.\n\nExperts say that as more rockets are launched, the risks of harming the ozone layer increases.\n\nThe high cost of space tourism makes it inaccessible to most people, with these expensive missions out of reach for the majority.\n\nCritics, including actress Olivia Munn, questioned the optics of this particular venture, remarking \"there's a lot of people who can't even afford eggs,\" during an appearance on Today with Jenna & Friends.\n\nAdditonal reporting by Kate Stephens, BBC Climate and Science.\n\nThe mission is going to launch in 2028 and is hoping to land in 2030.\n\nMARIO's development will make space-based projects such as solar powered panels.\n\nTim Peake said investing in the space economy would \"inspire future generations\".\n\nSteve Rotheram says Tim Peake was impressed by the bio-engineering expertise in the North West. \n\nThe billionaire says an unmanned mission by his SpaceX \"Starship\" vehicle will be followed by human landings as early as 2029.\n\nCopyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking.",
    "category": "    Science",
    "estimated_duration": "",
    "link": "https://www.bbc.com/news/articles/cvg8e5gq8ljo",
    "title": "BLUE ORIGIN CREW SAFELY BACK ON EARTH AFTER ALL-FEMALE SPACE FLIGHT",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "All-female crew led by Jeff Bezos’s fiancee Lauren Sánchez lands in Texas after reaching the edge of outer space\n\nSix women – including the pop star Katy Perry and morning TV host Gayle King – safely completed a trip to the edge of outer space and back from a private Texas ranch on Monday morning on a rocket belonging to Jeff Bezos, the Amazon co-founder and commercial space flight entrepreneur.\n\nThe women, who also included Bezos’s fiancee, Lauren Sánchez, made the trip to the Kármán line – the internationally recognized boundary of space – to float about, weightlessly, in the rocket’s capsule for three minutes before returning to Earth.\n\n“Yeah baby, go for launch,” a mission controller could be heard saying shortly before the single-engine New Shepard rocket blasted off on time, at 8.30am local time (9.30am ET and 13.30am GMT).\n\nKing’s longtime friend, the TV talkshow host Oprah Winfrey, was on hand in Texas for the launch. Winfrey remarked that, for King, “this is bigger than just going to space” and “more than just overcoming fear”.\n\n“Life is about continuing into grow into the fullest expression of yourself,” Winfrey said.\n\nThe talkshow queen could later be seen rubbing her eyes as the rocket reached its maximum ascent velocity of 2,300mph – or Mach 3. A commentator remarked that the vehicle was rising into the atmosphere ahead of “a stream of steam”.\n\nAs the rocket reached its highest point, about 62 miles (100km) above the Earth, a passenger could be heard to exclaim: “Oh my goddess.” Another could be heard saying: “I love you, Jeff Bezos.”\n\nOn the way back down to Earth, more screaming could be heard. The capsule, detached from its booster, made a soft landing on the Texas plains, two miles from the launchpad.\n\n“Congratulations, and welcome back to Earth,” the commentator said. “Everybody just as ecstatic to be back on Earth.”\n\nSánchez’s fiance later opened the hatch to welcome her back to Earth, followed by her crewmates. The billionaire greeted each with a hug and kiss.\n\nPerry, holding a daisy, kissed the ground with King. In a post-flight interview, Sánchez said: “The Earth was so quiet but also really alive. We are all in this together, and some connected. It makes me just want to hug everybody.”\n\n“I had to come back,” Sánchez, who is set to marry Bezos this summer in Venice, added tearfully. “I wanted to come back. I’m getting married.”\n\nThe alternative, she said, “would be a bummer for me”.\n\nOn her return to earth, Perry said Monday’s flight had been “the highest high”.\n\n“It’s about surrender to the unknown, it’s trust, and this whole journey is about more than going to space,” Perry remarked. It’s up there with meditation.\n\nShe added: “What you’re doing is really finding the love for yourself. I’m really feeling that divine feminine right now.”\n\nPerry, 40, said last week she was listening to an audiobook of Cosmos by Carl Sagan and reading a book on string theory in preparation for the ride.\n\n“I’ve always been interested in astrophysics and interested in astronomy and astrology and the stars,” she told the Associated Press. “We are all made of stardust, and we all come from the stars.”\n\nThe pop star also said that she planned to channel “that feminine divine that I was born with” to prepare for the new experience.\n\nBefore liftoff, King – who co-hosts CBS Mornings – said she was approaching the rocket trip with trepidation. “I still get very uncomfortable when people say ‘astronaut’,” she said. “I in no means feel like an astronaut. They said: ‘But, Gayle, if you go to space, you’re an astronaut.”\n\nThe pair, along with the former Nasa rocket scientist Aisha Bowe, civil rights activist Amanda Nguyen and film producer Kerianne Flynn, traveled as the guests of Sánchez.\n\nThe flight was the 11th human flight for the New Shepard program, which has flown 52 people, including repeat astronauts, to the Kármán line.\n\nSome critics have questioned whether the all-female trip is a moment of feminist progress since it comes as promotion for Bezos’s space tourism business that, in turn, is the marketing arm of Blue Origin’s commercial launch program.\n\nThe US actor Olivia Munn called the trip “a bit gluttonous” during a guest hosting appearance on Today with Jenna & Friends on CBS rival NBC.\n\n“I know this is not the cool thing to say, but there are so many other things that are so important in the world right now,” Munn said. “What are you guys going to do up in space?”",
    "category": "    Science",
    "estimated_duration": "",
    "link": "https://www.theguardian.com/science/2025/apr/14/blue-origin-rocket-launch",
    "title": "BLUE ORIGIN CREW INCLUDING KATY PERRY SAFELY RETURNS TO EARTH AFTER SPACE FLIGHT",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\n\t\t\t\tIn:  Cute,   Hot Women,   Hotness,   Redheads \n\nSend in all your best redheaded pics through our iPhone; or Android apps to get featured on theCHIVE! Or you can send in images directly through our submit page HERE!\n\nUse #redheads during the submission process to help your chances of getting featured in all the themed galleries! \n\nLooks like you already have a subscription! You can verify your subscription or upgrade to LIFETIME HERE:\n\nYou are now leaving theCHIVE.com, click continue to proceed",
    "category": "    Humor",
    "estimated_duration": "",
    "link": "https://thechive.com/sexy-girls/redheads-shall-rise-up-and-rage-44-photos/?utm_postid=4957523&utm_editor=4957523_bob",
    "title": "REDHEADS SHALL RISE UP AND RAGE!! (44 PHOTOS)",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Enter your email address or username and we’ll send you a link to reset your password\n\n An email with a link to reset your password was sent to the email address associated with your account \n\nYour account isn't active yet. We've emailed you an activation link. Please check your inbox and click the link to activate your account\n\nThe Bored Panda iOS app is live! Fight boredom with iPhones and iPads here.\n\n Join 1.2 million Panda readers who get the best art, memes, and fun stories every week! \n\nYou're on the list! Expect to receive your first email very soon!\n\nMy name is Marcin Zajac and I'm a landscape photographer from Poland, currently based in the San Francisco Bay Area in California.\n\nOne of my favourite type of images are nightscapes which include the night sky as a prominent part of a landscape. It's exhilarating to see the Milky Way arching overhead in a dark location and I find it to be a fascinating subject to capture especially because modern camera sensors can 'see' much more than our eyes.\n\nHere's a selection of my favourite night images I've taken over the last 2 years.\n\nMore info: Instagram | Facebook | marcinzajac.square.site\n\nI took this photo last year on the coast of Australia when intercontinental travel was still a thing and had an opportunity to visit Sydney on a business trip. To capture it I took a train from Sydney to a coastal town of Kiama and once the sun has set I made my way into this small cave and waited for a few hours for the core of the Milky Way to come out. Not familiar with the Southern Sky I was surprised to also see Jupiter appear soon after (it's the brightest object to the left of the sea stack).\n\nThis is a vertical panorama of the Pfeiffer Beach archway in Big Sur on the Central California coast. The panorama consists of about 5 shots overlapping starting from looking straight at the sea stack all the way to almost completely overhead to capture a significant portion of the Milky Way.\n\nThis is a vertical panorama of the Pfeiffer Beach archway in Big Sur on the Central California coast. The panorama consists of about 5 shots overlapping starting from looking straight at the sea stack all the way to almost completely overhead to capture a significant portion of the Milky Way.\n\nThis gnarly tree is an ancient bristlecone pine growing in the White Mountains of Eastern California at an elevation of ~11,000ft (~3500m). These trees are the oldest living non-clonal organisms in the world and some of them have been dated to be nearly 5,000 years old. That means they have been alive when the pyramids were being built in Egypt!\nConditions in these remote mountains are very harsh, with cold temperatures, a short growing season, high winds, and barren soil. Given that, bristlecone pines thrive in these conditions and attain their great age, despite their harsh environment that makes the pines grow very slowly which in turn makes the wood very dense and resistant to insects, disease, and erosion.\n\nThis gnarly tree is an ancient bristlecone pine growing in the White Mountains of Eastern California at an elevation of ~11,000ft (~3500m). These trees are the oldest living non-clonal organisms in the world and some of them have been dated to be nearly 5,000 years old. That means they have been alive when the pyramids were being built in Egypt!\nConditions in these remote mountains are very harsh, with cold temperatures, a short growing season, high winds, and barren soil. Given that, bristlecone pines thrive in these conditions and attain their great age, despite their harsh environment that makes the pines grow very slowly which in turn makes the wood very dense and resistant to insects, disease, and erosion.\n\nIf I had to choose my favourite place on Earth this might be it. Located on the Pacific coast near Big Sur it has everything — a beautiful cove filled with emerald waters, an 80-foot waterfall falling directly onto the beach, a palm tree making you feel like you're on a tropical island and a perfectly dark sky which shines bright with stars at night.\n\nIf I had to choose my favourite place on Earth this might be it. Located on the Pacific coast near Big Sur it has everything — a beautiful cove filled with emerald waters, an 80-foot waterfall falling directly onto the beach, a palm tree making you feel like you're on a tropical island and a perfectly dark sky which shines bright with stars at night.\n\nA mushroom-shaped hoodoo stands tall in the New Mexico badlands while the Milky Way peeks through the clouds. Typically, I aim to have clear skies when shooting the night sky, but I think the thin clouds in this image are adding a lot of interest to the scene. They look as if they were captured during sunset, but they are actually lit by light pollution from nearby towns. It was taken this May during a road trip to the Ah-Shi-Sle-Pah Wilderness in northwestern New Mexico.\n\nA mushroom-shaped hoodoo stands tall in the New Mexico badlands while the Milky Way peeks through the clouds. Typically, I aim to have clear skies when shooting the night sky, but I think the thin clouds in this image are adding a lot of interest to the scene. They look as if they were captured during sunset, but they are actually lit by light pollution from nearby towns. It was taken this May during a road trip to the Ah-Shi-Sle-Pah Wilderness in northwestern New Mexico.\n\nAn otherworldly rock spire (also known as a hoodoo) rises out of the badlands forming a perfect foreground to the Milky Way galaxy above. Part of the Ah-Shi-Sle-Pah Wilderness in the San Juan Basin in northwestern New Mexico this is one of most remote areas of the United States I've had a chance to visit. The nearest town is 50 miles away and the rough and occasionally sandy road to get there stress-tested my 2WD car. However, I was rewarded with an opportunity to camp under a dark and beautiful sky and the only sound breaking the silence at night were coyotes howling in the distance.\n\nAn otherworldly rock spire (also known as a hoodoo) rises out of the badlands forming a perfect foreground to the Milky Way galaxy above. Part of the Ah-Shi-Sle-Pah Wilderness in the San Juan Basin in northwestern New Mexico this is one of most remote areas of the United States I've had a chance to visit. The nearest town is 50 miles away and the rough and occasionally sandy road to get there stress-tested my 2WD car. However, I was rewarded with an opportunity to camp under a dark and beautiful sky and the only sound breaking the silence at night were coyotes howling in the distance.\n\nIf like me you don't understand where the name of the arch (Boot Arch) came from then please take a look inside the arch! This arch is one of many located in Alabama Hills—rock formations on the eastern slope of the Sierra Nevada.\n\nAt 115ft (47m) Pigeon Point is the tallest lighthouse on the west coast of the United States. Located between Santa Cruz and San Francisco it has been guiding ships approaching the California coast since 1872.\n\nAt 115ft (47m) Pigeon Point is the tallest lighthouse on the west coast of the United States. Located between Santa Cruz and San Francisco it has been guiding ships approaching the California coast since 1872.\n\nMilky Way rising over the moonlit Big Sur coastline\nBig Sur has been called 'The Greatest Meeting of Land & Water in the world'. Located two hours south of the San Francisco Bay Area this mountainous stretch of the California coast is easily accessible and yet undeveloped and sparsely populated. There is virtually no light pollution here which makes this a perfect destination for night photography. The only source of light apart from the stars was a setting crescent moon and the occasional lights of a car driving on the Pacific Coast Highway.\n\nMilky Way rising over the moonlit Big Sur coastline\nBig Sur has been called 'The Greatest Meeting of Land & Water in the world'. Located two hours south of the San Francisco Bay Area this mountainous stretch of the California coast is easily accessible and yet undeveloped and sparsely populated. There is virtually no light pollution here which makes this a perfect destination for night photography. The only source of light apart from the stars was a setting crescent moon and the occasional lights of a car driving on the Pacific Coast Highway.\n\nThe night sky spinning around the North Star while cars drive through the Bixby Bridge on the Pacific Coast Highway in Central California. This is my first attempt at capturing star trails caused by the Earth's rotation. This image is constructed from almost 3.5 hours worth of exposures (5 mins each) while I tried not to freeze during a crystal clear, but cold night in Big Sur.\n\nThe night sky spinning around the North Star while cars drive through the Bixby Bridge on the Pacific Coast Highway in Central California. This is my first attempt at capturing star trails caused by the Earth's rotation. This image is constructed from almost 3.5 hours worth of exposures (5 mins each) while I tried not to freeze during a crystal clear, but cold night in Big Sur.\n\nThese strange spherical boulders on the Mendocino coast in Northern California are revealed only during low tide. Resembling bowling balls they are called concretions and were formed as the softer surrounding sandstone was eroded by the Pacific Ocean over millions of years. There are at least four conditions that need to be met to make this photo possible.First is the right time of year as the galactic core of the Milky Way is only visible during the summer season (April to September).Second is the phase of the moon, because around the new moon is best so that the light from the moon doesn't wash out the Milky Way. Third, the tide needs to be low, otherwise the boulders are completely submerged. Finally, the weather during the summer in this area is often engulfed in fog resulting in poor visibility. On Sunday night all these factors were favourable so I decided to make the 8-hour long round trip from the Bay Area.\n\nAdmiring the Milky Way from a hot tub in the Eastern Sierras.\n\nAdmiring the Milky Way from a hot tub in the Eastern Sierras.\n\nMy favourite kind of nightlife consists of the Milky Way arching over Half Dome and Yosemite Valley as seen from Glacier Point.\n\nMy favourite kind of nightlife consists of the Milky Way arching over Half Dome and Yosemite Valley as seen from Glacier Point.\n\nMy first attempt at astrophotography. This is a moonlit ancient bristlecone pine in the White Mountains of eastern California. These trees can live over 5000 years and are the longest living organisms on Earth.\n\nMy first attempt at astrophotography. This is a moonlit ancient bristlecone pine in the White Mountains of eastern California. These trees can live over 5000 years and are the longest living organisms on Earth.\n\nHere's Comet Neowise (C/2020 F3) with its two tails. The blue-glowing thin ion tail pointing upwards and the larger dust tail filling most of the frame. I captured it in Alabama Hills, a dark location in Eastern California where the comet was clearly visible with a naked eye. This image is a result of stacking 10 exposures all shot at 60s, ISO3200 and f/2.8 with a 70mm lens. I used a star tracker to allow me to expose for a whole minute without visible trailing in the stars and the comet caused by rotation of the Earth.\n\nThere's an ongoing legal battle over access to this beach that might end up in the US Supreme Court. Currently, the road leading to the beach is gated by the owner, but walking through to the beach is not prosecuted and a lot of people hang out here during the day.\nThis is one of my favourite places to shoot in the Bay Area. I've never had any luck with sunsets here as the weather on the San Mateo coast can be quite unpredictable and conditions that look favourable can change very quickly. However, on this night I witnessed a rare treat — a completely clear summer coastal night.\nThe Milky Way here is not as prominent as in more remote locations on the coast due to light pollution from nearby towns, but I am still amazed by the amount of detail visible so close to Silicon Valley.\n\nThere's an ongoing legal battle over access to this beach that might end up in the US Supreme Court. Currently, the road leading to the beach is gated by the owner, but walking through to the beach is not prosecuted and a lot of people hang out here during the day.\nThis is one of my favourite places to shoot in the Bay Area. I've never had any luck with sunsets here as the weather on the San Mateo coast can be quite unpredictable and conditions that look favourable can change very quickly. However, on this night I witnessed a rare treat — a completely clear summer coastal night.\nThe Milky Way here is not as prominent as in more remote locations on the coast due to light pollution from nearby towns, but I am still amazed by the amount of detail visible so close to Silicon Valley.\n\nThese swirling, eroded sandstone boulders located in the arid desert of northwestern New Mexico evoke a feeling of standing on a planet from another world and being surrounded by alien creatures emerging from the shells of their cracked eggs. This area was once covered by an ancient sea and as the water receded it left behind a thick layer of jumbled sandstone, mudstone and shale that lay undisturbed for over 50 million years. However, when 6,000 years ago the last ice age receded, it carved the landscape into its current eerie shape.\n\nThese swirling, eroded sandstone boulders located in the arid desert of northwestern New Mexico evoke a feeling of standing on a planet from another world and being surrounded by alien creatures emerging from the shells of their cracked eggs. This area was once covered by an ancient sea and as the water receded it left behind a thick layer of jumbled sandstone, mudstone and shale that lay undisturbed for over 50 million years. However, when 6,000 years ago the last ice age receded, it carved the landscape into its current eerie shape.\n\nAnother shot from a different perspective of Shark Fin Cove where the milky way was rising over a clear night sky.\n\nAnother shot from a different perspective of Shark Fin Cove where the milky way was rising over a clear night sky.\n\nThis picture was taken on a Davenport Beach, Davenport, California. Another shot of a clear night sky above the abandoned beach.\n\nThis picture was taken on a Davenport Beach, Davenport, California. Another shot of a clear night sky above the abandoned beach.\n\nThese petroglyphs were carved into a large volcanic boulder by Native Americans who inhabited this part of Eastern California thousands of years ago. By chipping away at the dark surface of the rock, they exposed the lighter rock underneath. What's unusual about this panel is that it faces upward towards the sky, enabling some interesting compositions that include the Sierra Nevada mountains and the night sky in the same frame. The location of this petroglyph is a carefully guarded secret to avoid vandalism of this unique and sacred place and finding it was an adventure on its own. For that reason don't ask me how to find it.\n\nMilky Way rising over Shark Fin Rock on a beach near Santa Cruz.\nThis image was blended with 1 shot for the sky (F2.8, 20\", ISO 3200) and 1 shot for the foreground (F2.8, 3 mins, ISO800).\n\nMilky Way rising over Shark Fin Rock on a beach near Santa Cruz.\nThis image was blended with 1 shot for the sky (F2.8, 20\", ISO 3200) and 1 shot for the foreground (F2.8, 3 mins, ISO800).\n\nBuilt in the 1860s the Davenport Pier was a platform used for transporting timber north towards San Francisco. Long abandoned since then the wharf eroded and today only the concrete arches that once held the pier have survived the test of time.\n\nBuilt in the 1860s the Davenport Pier was a platform used for transporting timber north towards San Francisco. Long abandoned since then the wharf eroded and today only the concrete arches that once held the pier have survived the test of time.\n\nThis is the most remote location I've had a chance to visit, photograph and spend the night at. It might also be one of the most beautiful. Getting here was a challenge - the last 50 miles of the drive to the trailhead is a badly washboarded dirt road that took over of 2 hours of careful driving to complete. Don't tell Hertz. (Name of rental agency may have been changed to protect the not so innocent). After that catch some sleep in my car at the trailhead and start the 20 mile round trip hike in the morning. The fun part? There's no access to water on the way, so I had to carry 8 liters of water for the 2 day trip in addition to food, a tent, sleeping bag and all my photo gear. Overall 20kg on my back. But once you get to the lake you know it was worth it, especially when late at night the Milky Way arch rises above the lake that fills the s-shaped canyon.\n\nThis gnarly tree is an ancient bristlecone pine growing in the White Mountains of Eastern California at elevation of over 10,000ft (3200m). These trees are the oldest living non-clonal organisms in the world and some of them have been dated to be nearly 5,000 years old. That means they have been alive when the pyramids were being built in Egypt! Conditions in these remote mountains are very harsh, with cold temperatures, a short growing season, high winds, and barren soil. And yet bristlecone pines thrive in these conditions and attain their great age, not in spite of their harsh environment, but because of it - the pines grow very slowly which makes their wood very dense and resistant to insects, disease, and erosion.\n\nMilky Way over the historic Bixby Bridge in Big Sur. This stretch of the California coast features steep cliffs, hidden beach coves, and one of the most spectacular drives one can take anywhere in the world. Thanks to being almost completely undeveloped there is no light pollution here which makes this a perfect destination for stargazing.\n\nAt 115ft (35m) Pigeon Point is the tallest lighthouse on the West Coast of the United States. Located between Santa Cruz and San Francisco it has been guiding ships navigating this stretch of the Pacific coast since 1872. Before then many vessels have been wrecked in this area because of the dense fog making it impossible for the mariners to see the land. The frequent fog also makes it hard to see the stars here as virtually all summers nights are fogged in. But as autumn started, and the fog relented for a few days, I had a chance to see the vertical Milky Way in tandem with the lighthouse.\n\nDizzying sky over Mono Lake located on the eastern slope of the Sierra Nevada. If you're not sure what's happening in this photo - this is a result of letting my camera take photos continuously for 3 hours, capturing the apparent movement of the stars due to Earth's rotation. When facing north the stars appear to be circling around the North Star.Mono Lake is one of the oldest and saltiest lakes in North America (it's 3 times saltier than the ocean!). But its most unusual features are the dramatic tufa towers emerging from the surface. These rock towers form when underwater springs rich in calcium mix with the waters of the lake, which are rich in carbonates. The resulting reaction forms limestone. Over time the buildup of limestone formed towers, and when the water level of the lake dropped the towers became exposed.\n\nHard to beat warm summer nights in the desert! In this image the Milky Way is seen next to Boot Arch in Alabama Hills, a range of hills and rock formations near the eastern side of Sierra Nevada in California. If like me at first you don't see where the name Boot Arch comes from - look inside the arch.\n\nOoops! Your image is too large, maximum file size is 8 MB.\n\nOoops! Your image is too large, maximum file size is 8 MB.\n\nOoops! Your image is too large, maximum file size is 8 MB.\n\nError occurred when generating embed. Please check link and try again.",
    "category": "    Humor",
    "estimated_duration": "",
    "link": "https://www.boredpanda.com/photography-night-sky-marcin-zajac-msn/",
    "title": "I SPENT YEARS SHOOTING VARIOUS NIGHTSCAPES AROUND THE WORLD (29 PICS)",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "We spend so much time (and money) trying to perfect our skin, with carefully chosen products, professional treatments, and everything in between. But I'm here to tell you the solution may be simpler than you think. \n\nMost U.S. tap water contains chlorine, heavy metals, and harmful contaminants1 that strip the skin, disrupt your barrier, and dull your complexion. Yet few of us think twice about rinsing our face with unclean water from our sink faucet.\n\nSo, when I heard Canopy (the brand behind my favorite shower filter) was launching a faucet filter, I knew I had to test out the new launch. Below, find out why I want to install a filter on all of my sinks—plus uncover an exclusive promo code MBG20 for 20% off your order.\n\nDespite testing some of the best beauty and wellness products for my job, I struggled with redness, breakouts, and a lackluster complexion for years. Not to mention my dry hair was brittle and shedding more than it should.\n\nIt wasn't until I tested my first shower filter in 2023 that things finally changed. My skin calmed down almost immediately, and it no longer felt tight and irritated after each shower. Plus, my hair looked shinier, stronger, and overall healthier—and yes, the shedding slowed down.\n\nSince then, I've extensively tested four top-rated shower filters (Jolie, Act+Acre, and two models from Canopy). And once I saw the impact this simple swap had on my skin and hair, I couldn't stop talking about it. \n\nI even started turning on the shower at night just to wash my face, simply because I did not want to rinse with dirty sink water. Eventually, I tested my first faucet filter and never looked back.\n\nThat is, until I recently moved into a new place and spent two weeks without any filtration at all. My skin quickly reminded me why I swear by filtered water (just like it does every time I travel).\n\nThankfully, the stars aligned and I got the chance to test Canopy's brand-new faucet filter in my new place—and the timing couldn't have been better.\n\nRELATED: Filters Are the New Norm: Cleaner Air & Water for Longer, Healthier Lives\n\nCanopy's new faucet filter is designed to make your bathroom water cleaner and is therefore gentler on your skin. \n\nIt does this with a multi-stage filtration system: A micro mesh filter and activated carbon filter work together to reduce chlorine, heavy metals, and other common tap water contaminants known to be damaging to skin.\n\nThe Canopy Faucet Filter attaches directly to most standard sinks and features a sleek, compact design with 5 color options to match your bathroom's aesthetic.\n\nInstallation is fairly simple and can be done on your own without professional assistance. Mine took less than 10 minutes.\n\nThe filter has a 360-degree swivel for better positioning and a rotating \"face fountain\" that pivots upward so you can easily wash your face without splashing water all over the counter (if you know, you know).\n\nAnother perk? This filter faucet uses 66% less water than EPA standards, so it's easier on the planet too. And don't worry, the water flow still feels silky and streamy!\n\nOne qualm is that the filter part of the device does need to be replaced every three months or so—but that's standard for faucet and shower filters, and the replacement process takes less than two minutes.\n\nI love that the Canopy Faucet Filter doesn't look obtrusive in my bathroom. With a sleek, compact design and multiple color options, the filter blends seamlessly into any bathroom vibe.\n\nThe rotating face fountain feature is a game-changer\n\nI'm surprised by just how much I love the upward-facing stream! It's specifically designed for washing your face without creating a mess. My boyfriend appreciates this feature, too, since I used to leave the sink covered in water after each wash.\n\nYou won't need to call a professional plumber to install your Canopy Faucet filter. The device comes with a handy little wrench and everything you'll need to have your new filter up and flowing, likely in 10 minutes or less. My installation took about five minutes with just one person.\n\nCanopy thought of everything with this design. The 360-degree swivel makes it easy to adjust your sink for the perfect, most convenient, and most aesthetically pleasing setup. \n\nThe Canopy's multi-stage filtration system effectively reduces chlorine, heavy metals, and other common tap water impurities that can contribute to dryness, irritation, and breakouts. My skin looked calmer and healthier after just a few days of installing this filter.\n\nAlthough my building is new, I found some pretty gross stuff lurking in the sink when I swapped in the Canopy for my standard faucet filter (pictured below).\n\nIt's water-efficient (without sacrificing pressure or flow)\n\nThe filter uses 66% less water than EPA standards but still delivers a steady, satisfying flow.\n\nWhen I moved into my new place, I went two full weeks without any water filtration—and I was quickly reminded just how impactful shower and faucet filters can be. My skin was dull, dry, and slightly irritated, as I'm prone to redness and irritation.\n\nBut after installing the Canopy Faucet Filter, my skin quickly returned to its healthiest state. It was calmer, softer, and brighter within just a few days.\n\nI also noticed that my skin care routine felt more effective again. Without the harsh tap water interfering, my skin felt truly clean (not stripped!), and my products seemed to absorb better.\n\nI was already a firm believer that you should have filters on every faucet in your home, but this was the gentle reminder I needed of just how much better filtered water is for your skin.\n\nRELATED: Your Shower Is Dripping With Toxins — How To Protect Your Skin & Hair\n\nPSA: If you care about your skin, you should care about your water. The Canopy Faucet Filter is an easy, effective way to naturally make your skin look and feel healthier. After just a few days of testing it, I was reminded exactly why I never want to go without filtration.\n\nRELATED: 6 Best Shower Filters We Tested for Healthier Hair & Skin\n\n*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.",
    "category": "    Health",
    "estimated_duration": "",
    "link": "https://www.mindbodygreen.com/articles/canopy-faucet-filter-review",
    "title": "THIS SIMPLE SWAP MADE MY SKIN LOOK SO MUCH HEALTHIER",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": " Most people know sugar-sweetened beverages like soda aren’t necessarily the most nutritious choice. Now, new research has found another potential health risk linked to these sugary drinks—oral cavity cancer.\n\n\n The study, published last month in JAMA Otolaryngology-Head & Neck Surgery, found a connection between higher consumption of sugary drinks and a greater risk of oral cavity cancer (OCC) in women.\n\n\n Researchers used data from 162,602 women, 124 of whom developed OCC.\n\n\n They discovered that OCC risk was 4.87 times higher in women who consumed at least one sugar-sweetened beverage each week compared to those who consumed less than one of these drinks each month.\n\n\n And this higher cancer risk was present regardless of whether the women engaged in unhealthy lifestyle behaviors such as smoking or drinking. Among women who avoided tobacco and alcohol, drinking at least one sugary beverage a day was linked to a 5.46 times higher OCC risk compared to women who consumed less than one sugary drink monthly.\n\n\n OCC refers to cancers that form in the mouth, including on the tongue, gums, or tonsils. It’s more commonly seen in men and in those who drink alcohol heavily or use tobacco products. The U.S. is expected to see nearly 60,000 new cases of oral cavity and oropharyngeal (mid-throat) cancers in 2025.\n\n\n But around the world, experts have noticed “an increasing incidence of oral cavity cancer in non-smoking women,” senior study author Brittany Barber, MD, associate professor in the Department of Otolaryngology, Head and Neck Surgery at the University of Washington, told Health.\n\n\n This study could be a jumping-off point for future investigations into whether diet might be behind this rise.\n\n\n “Even in women who don’t smoke or drink heavily, frequent consumption of sugary drinks may significantly increase their risk [of OCC],” said Jason Auerbach, DDS, an oral and maxillofacial surgeon and co-CEO of MAX Surgical Specialty Management in New Jersey. “That’s pretty significant because it introduces a modifiable risk factor—something people can actually control.”\n\n\n To understand how soda, fruit drinks, energy drinks, and other sugar-sweetened beverages might make a person more likely to get oral cavity cancer, it’s helpful to look at well-established risk factors for the cancer.\n\n\n Though there are other factors (including long-term gum disease, genetics, or poorly-fitting dentures), the most significant are “the ‘big three’ risk factors”—tobacco, alcohol, and human papilloma virus (HPV), Auerbach told Health.\n\n\n Tobacco and alcohol are considered carcinogens. But they can also produce chronic inflammation and changes in a person’s oral microbiome, Barber explained.\n\n\n Barber and her colleagues hypothesized that something similar might be going on with sugar-sweetened drinks: “High sugar consumption in the form of beverages may prompt chronic inflammation,” she said.\n\n\n Again, this sugar intake and inflammation can alter the oral microbiome, driving increases in harmful bacteria and greater oxidative stress, “which may contribute to DNA damage and cancer risk,” said Auerbach. Simply, sugary beverages may be able to create “an environment where cancerous cells can develop more easily,” he added.\n\n\n Beyond inflammation, there are a couple of other potential explanations for this connection, said Auerbach. For one, sugary drinks such as sodas and sports drinks “are highly acidic,” he said. This means they can damage the soft tissue (or oral mucosa) in the mouth over time, he explained, making cells potentially more vulnerable to cancerous changes.\n\n\n Plus, excess sugar consumption can lead to insulin resistance, Auerbach said, which can in turn increase levels of insulin-like growth factor-1 (IGF-1), a hormone “associated with cancer growth.”\n\n\n For now, though, Barber emphasized that we can’t definitively say that sugar-sweetened beverages cause OCC. Her and her colleagues’ research simply found an association.\n\n\n There were other limitations to the study, too. There weren’t many events—that is, OCC cases—recorded from the provided data, and the study included only women, meaning it might not be generalizable to male patients at large.\n\n\n In general, reducing your intake of sugary drinks is a good move for your health, said Auerbach.\n\n\n “Excess sugar is bad for oral health, leading to common dental issues like cavities, gum disease, and inflammation,” he explained. “Patients with high sugar intake often have significant dental issues, and chronic inflammation in the mouth is a known precursor to various diseases.”\n\n\n Plus, high amounts of sugar intake have been tied to other health risks, including diabetes and heart disease, Auerbach added.\n\n\n When it comes to OCC risk in particular, this study does suggest that “regularly consuming sugar-sweetened beverages—especially in large amounts—could increase your risk over time,” Auerbach said. “For people who are already at higher risk—smokers, drinkers, those with a family history of oral cancer—this is another reason to rethink their diet.”\n\n\n However, the idea that these drinks might contribute to the development of OCC is still new, he stressed. More research is needed.\n\n\n And as with anything else, “moderation matters,” Auerbach said. “This study isn’t saying that drinking the occasional soda or juice will give you oral cancer.”\n\n\n Still, people should be in the know about the fact that these drinks have been linked to cancer and other chronic diseases, so that they can make informed dietary choices, Barber added.\n\n\n If sodas, sports drinks, sweetened teas, and other sugar-sweetened beverages are a part of your diet right now, it may be helpful to reduce your intake. Try swapping some sugary drinks for water, and “focus on what you put into your body,” Auerbach advised.\n\n\n Seeing a dental professional regularly is also important, particularly if you’re concerned about your oral cancer risk.\n\n\n “Oral cancer is most treatable when caught early, so paying attention to any changes in your mouth—sores that don’t heal, persistent pain, or unexplained lumps—is crucial,” said Auerbach.\n\n\nGomez-Castillo L, Cushing-Haugen KL, Useche M, et al. High sugar-sweetened beverage intake and oral cavity cancer in smoking and nonsmoking women. JAMA Otolaryngol Head Neck Surg. Published online March 13, 2025. doi:10.1001/jamaoto.2024.5252\n\nNational Cancer Institute. Lip and oral cavity cancer treatment (PDQ)—patient version.\n\nAmerican Cancer Society. Key statistics for oral cavity and oropharyngeal cancers.\n\nCenters for Disease Control and Prevention. Get the facts: sugar-sweetened beverages and consumption.\n\nAmerican Cancer Society. Harmful chemicals in tobacco products.\n\nWorld Health Organization. No level of alcohol consumption is safe for our health.\n\nBrizuela M, Winters R. Histology, oral mucosa. In: StatPearls. Treasure Island (FL): StatPearls Publishing; 2023.\n\nShanmugalingam T, Bosco C, Ridley AJ, Van Hemelrijck M. Is there a role for IGF-1 in the development of second primary cancers?. Cancer Med. 2016;5(11):3353-3367. doi:10.1002/cam4.871",
    "category": "    Health",
    "estimated_duration": "",
    "link": "https://www.health.com/sugary-drinks-oral-cancer-risk-in-women-11704110",
    "title": "ORAL CANCER AND SODA—NEW RESEARCH SUGGESTS THERE MAY BE A LINK",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "[No readable article text found.]",
    "category": "    Health",
    "estimated_duration": "",
    "link": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(25)00718-4/fulltext?rss=yes",
    "title": "[WORLD REPORT] TOWARDS A GREENER, HEALTHIER PARIS",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\r\nCanadian Switch 2 pre-orders - which were originally set to go live on 9th April before Nintendo announced a last-minute delay - will reportedly now begin next week.\r\n\n\n\r\nNintendo slammed on the brakes last Tuesday, just a day before Canadian Switch 2 pre-orders were set to begin, saying it was making the move \"in order to align with the timing of pre-orders to be determined in the US\". That followed the company's unprecedented decision to indefinitely delay Switch 2 pre-orders in the US while the company looked to \"assess the potential impact\" of US president Donald Trump sweeping trade tariffs.\r\n\n\n\r\nNow, though, Billbill-kun - who has a strong track-record when it comes to retail leaks - says Canadian Switch 2 pre-orders will begin soon. \"From what I can see through some Canadian retailers,\" they wrote on social media, \"Nintendo Switch 2 console & bundle pre-orders should start from 23rd April, 2025. Date subject to change. Can't confirm if it's the same for US.\"\r\n\n\n\nNintendo of America boss Doug Bowser previously admitted the US administration's trade tariffs - which had heavily impacted some of the company's key manufacturing locations around the world - were a \"challenge\" and \"something we're going to have to address.\" And despite a temporary pause on some tariffs since then, the situation has remained uncertain amid confusing messaging around potential electronics exceptions.\r\n\n\n\r\nOne prominent analytics firm has said it expects Nintendo to stick with its previously announced $450 launch price for Switch 2 in the US despite the tariffs, but believes their effect could lead to a 20 percent price increase for the console over the next two years. And it's not just Nintendo. Earlier this month, US trade group the Entertainment Software Association said the tariffs will \"have a real and detrimental impact\" on the video games industry as a whole.\r\n\n\n\n        Eurogamer is better when you sign in\n      \n\n\n        Join our community of gamers and get access to personalised reading recommendations and much more!\n      \n\n© 2025 Eurogamer.net  a brand of IGN Entertainment, Inc. All rights reserved. 18 Mansell Street Level 3, London, E1 8AA, United Kingdom. No part of this website or its content may be reproduced without the copyright owner's permission. Eurogamer is a registered trademark of Gamer Network Limited.",
    "category": "    Gaming",
    "estimated_duration": "",
    "link": "https://www.eurogamer.net/switch-2s-delayed-canadian-preorders-reportedly-beginning-next-week",
    "title": "SWITCH 2'S DELAYED CANADIAN PRE-ORDERS REPORTEDLY BEGIN NEXT WEEK",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\nGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\n\n\nThe Lego Store's Star Wars Day sale kicks off on May 1 and features the latest Ultimate Collector Series set and a handful of other new building kits.\n\nBy \n    Steven Petite\n   and \n    Darryn Bonthuys\n   on April 15, 2025 at 12:25PM PDT\n\nMay the 4th be with your wallet if you're a fan of Star Wars Lego sets. Ahead of the punny holiday, Lego has unveiled its new Star Wars building kits and promotions launching on May 1 for Star Wars Day. The exciting lineup of new releases includes the latest highly detailed Ultimate Collector Series model kit, Jango Fett's Firespray-Class Starship, as well as multiple additions to its series of helmets, a replica of Chopper the Astromech, and the unique Command Shuttle piloted by Kylo Ren. There's even a Brick-Built Star Wars Logo, which could serve as a nice centerpiece for your Star Wars display shelf.\n\nAs usual, the Lego Store is offering free small-scale, exclusive building sets when you spend a certain amount of money during Star Wars Day. The promotion extends to all currently available Star Wars Lego sets--including the new ones--from May 1 to May 5. Though most of the new kits are also sold at major retailers such as Amazon, Walmart, and Target, the freebies are exclusive to the Lego Store. Here's a rundown of Lego's Star Wars Day free products and other offers:\n\nMost of the new Star Wars Lego sets launching for Star Wars Day are available to preorder now at the Lego Store and other major retailers, but you won't be able to purchase Jango Fett's UCS Starship until May 1 when Lego's promotion begins. This marquee set is the only one of the new releases that technically launches on Star Wars Day (May 4) as a Lego Store exclusive. You'll need to join Lego's free Insiders rewards program to buy it alongside the other sets on May 1. Considering how popular the UCS Star Wars kits are at launch, you'll want to do this to ensure you can not only buy one before it sells out, but also to take advantage of the Lego Store's Star Wars Day freebie promotions. Jango Fett's Starship comes with a bonus keychain as well as both of Lego gift sets.\n\nLet's take a closer look at all of the new Lego sets for Star Wars Day 2025 below.\n\nThis year's Star Wars Day headliner from Lego is Jango Fett's Firespray-Class Spaceship. The ship made its film debut in Attack of the Clones, and soon it will join Lego's Ultimate Collector Series. \n\nPriced at $300, the 2,970-piece set is a screen-accurate recreation, as the vehicle has a working ramp, a functioning canopy, movable doors that can eject seismic charge mines, and adjustable cannons. You'll have the option to display this in flight or landing mode, and it comes with two redesigned minifigures of Jango Fett and his clone son Boba. Jango is kitted out with his Mandalorian armor, jetpack, twin blasters, and an easily removable head.\n\nThe UCS line of Lego sets is primarily aimed at adult collectors, as these feature thousands of pieces and are time-consuming builds. The smallest set, Luke's Landspeeder, has almost 1,900 pieces and the largest kit, the Millennium Falcon, has over 7,500 pieces in total and cab take up an entire table when fully constructed. In case you'd like to grab a few of these, a bunch of them are still in production and available to purchase for retail price.\n\nChopper from Star Wars Rebels is the latest Astromech to get its own mid-sized Lego replica. The 1,039-piece kit recreates the beloved droid in all of its mechanical glory. It has realistic movement thanks to several hidden levers, a decent amount of articulation, and an info plaque so that guests won't confuse him for R2-D2.\n\nBut speaking of R2, last year's similarly sized R2-D2 Lego set would be the perfect companion for Chopper, especially since you can save $20 on R2-D2 at Amazon right now. You can also save $20 on the Creative Play Droid Builder, a Target exclusive featuring four customizable droids, including Chopper and R2-D2. Here's a list of several notable Lego Star Wars droids:\n\nWe've already seen the Marvel logo get the Lego treatment, and now the Star Wars logo is next in line! This 700-piece set captures the retro sci-fi iconography of the franchise as a 3D replica, and other hidden details include classic Lego greebling between the letters and a hidden surprise in one of the letters.\n\nWhile you won't find any purple lightsaber scorch marks on this 616-piece replica of Jango Fett's Helmet, you will get an adjustable rangefinder, a nameplate, and a display stand to show off your new creation. The Jango Fett helmet will pair well with the existing Mandalorian Helmet as well as several others in Lego's series of helmet replicas that are still available for retail price or less:\n\nAnother cool helmet to add to your collection is the one that used to belong to Kylo Ren. This has authentic details, silver accents, a name plate, and a display stand to create a cool diorama piece. The 529-piece Kylo Ren helmet could be displayed next to the Darth Vader Helmet to showcase two eras of Star Wars villains.\n\nSticking with the Star Wars Sequel Trilogy, you can also grab Kylo Ren's intimidating Command Shuttle. If the 17.5-inch wingspan makes it a little too large to display on your shelf, the good news is that they can fold upwards to help save you some horizontal space. This also comes with a display stand, but no minifigures are included.\n\nMoving back in time to Star Wars: Rogue One, you can also pick up the very cool U-Wing Starfighter that appeared in that film. It has a slick design and it comes with minifigures of Cassian Andor, K2SO, and two ISB agents. This 594-piece playset is designed for kids ages eight and up.\n\nFans of the Brick Headz line can pick up a collection of heroes and villains from Star Wars. The set of buildable figures gets you General Grievous, Anakin Skywalker, Padme Amidala, Mace Windu, and Darth Sidious. \n\nFinally, you can add Luke Skywalker to your collection, as this Brickheadz recreation of the Star Wars hero kits him out in his Rebel Alliance flightsuit.\n\nGot a news tip or want to contact us directly? Email news@gamespot.com",
    "category": "    Gaming",
    "estimated_duration": "",
    "link": "https://www.gamespot.com/articles/star-wars-day-lego-unveils-a-bunch-of-new-building-sets-exclusive-freebies/1100-6530872/?ftag=CAD-01-10abi2f",
    "title": "STAR WARS DAY - LEGO UNVEILS A BUNCH OF NEW BUILDING SETS & EXCLUSIVE FREEBIES",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "J.C. Lee, the daughter of legendary Marvel creative Stan Lee, has spoken out for the first time in an interview with Business Insider to deny past allegations that she committed elder abuse toward both her father and her mother, Joan.\n\nThe accusations against J.C. Lee first began circulating in 2017 following the death of her mother, with the most damning portrait appearing in a 2018 The Hollywood Reporter piece. The report alleges that, under pressure from three other individuals connected to the Lees, J.C. Lee frequently pressured her parents for money and control of assets. It claims that she engaged in screaming matches with Stan Lee and had what the article describes as a \"powder-keg\" relationship with him, with claims including verbal arguments and at least one alleged physical altercation. THR was provided photos of a bruise on Joan Lee’s arm and included detailed accusations that J.C. Lee has denied.\n\nNow, in the Business Insider interview, J.C. Lee says that the accusations were all \"a lie.\" She says she did not make a public denial at the time of the initial THR piece under advisement from people around her. \"You think I haven't regretted it to this day?\" she said. \"They are all lies. That photo is insane. I never did it.\"\n\nJ.C. Lee acknowledged that she did often get into screaming fights with her parents over money, but says it never became physical. \"I never ever touched my parents,\" she said.\n\nStan Lee died of a heart attack in 2018 at the age of 95.\n\nThe full interview with J.C. Lee in Business Insider recounts her struggles growing up as the child of the famous Stan Lee and her ongoing troubles with money, being manipulated by others, loneliness, creativity, and living with her father's legacy.\n\nRebekah Valentine is a senior reporter for IGN. You can find her posting on BlueSky @duckvalentine.bsky.social. Got a story tip? Send it to rvalentine@ign.com.\n\nBlogroll image credit: Albert L. Ortega/Getty Images",
    "category": "    Gaming",
    "estimated_duration": "",
    "link": "https://www.ign.com/articles/stan-lees-daughter-jc-lee-denies-elder-abuse-allegations",
    "title": "STAN LEE'S DAUGHTER J.C. LEE DENIES ELDER ABUSE ALLEGATIONS",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "When I saw a hooded Wolf (Wagner Moura) chase after the adorable Puss (Antonio Banderas) with twin sickles like a hidden character in Soulcalibur in 2022’s Puss in Boots: The Last Wish, I did not think, “Yeah, this is perfect for a live-action prestige horror film.” That’s probably why I’m not an Academy Award-nominated director whose films have grossed over $1 billion and Ryan Coogler is, because his latest movie Sinners is not only one of the most anticipated movies ever but also wouldn’t be the movie it is without, to hear him tell it, the “massive” influence of the DreamWorks Animation film.\n\nCoogler recently chatted with the Get Rec’d podcast and revealed that the villain in Sinners is inspired by the Wolf from Puss in Boots in the most obvious way. “Think about the villain. Think about his defining features,” Coogler explained. Both the animated Wolf and Sinners’ villain Remmick (Jack O’Connell) have ominous red eyes. So, when Remmick eventually makes it into your nightmares after you catch Sinners, just know you’re pretty much being terrified by a man based in part on a digital wolf.\n\nThis isn’t the first, or even close to the weirdest, inspiration for a movie character. The tentacle texture of Pirates of the Caribbean’s fearsome Davy Jones was inspired by a coffee-stained cup. Christian Bale’s psychotically charismatic demeanor as Patrick Bateman in American Psycho was inspired by Tom Cruise’s “intense friendliness” during an interview on Late Night with David Letterman. Even the bug-eyed design of WALL-E’s titular character was inspired by an epiphany director Andrew Stanton had after playing around with binoculars during a baseball game.\n\nIn the end, inspirations for some of the most indelible pieces of art can derive from ostensibly meaningless moments in life. Or, as it turns out, from blockbuster animated films.",
    "category": "    Gaming",
    "estimated_duration": "",
    "link": "https://kotaku.com/ryan-coogler-sinners-puss-in-boots-movie-wolf-eyes-1851776333",
    "title": "RYAN COOGLER'S SINNERS HAS A STRANGE CONNECTION TO PUSS IN BOOTS",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Just don’t look at them too long, the red can be aggravating\n\nThree screenshots of the Mario franchise’s unreleased Virtual Boy outing have resurfaced online, giving us the best look at the game anyone’s seen since 1995.\n\nThe images were discovered hiding out in The Internet Archive by Bluesky user rabidrodent, specifically in a folder of video game screenshots pulled from old AOL file libraries. They appear to be official assets distributed by Nintendo to the press for use in reporting on the game, so it’s not as if no one has ever seen them before. That said, this is probably the first time these specific images have been available to the public in this clean a form in decades, and we love to see it.\n\nNintendo showed “VB Mario Land,” as the game is known colloquially despite having never received an official name, just once at the Winter Consumer Electronics Show in January 1995. Reports from the time indicate attendees weren’t actually able to play the game or even view it through a Virtual Boy, but were shown a demo of the first level on widescreen TVs while wearing special glasses to simulate the console’s 3D effects.\n\nVB Mario Land would have seen Mario traversing both sidescrolling and top-down levels, with plane-hopping mechanics similar to those that would eventually be seen in Virtual Boy Wario Land. It’s unclear why Nintendo never released the game, but many attribute the near-immediate failure of the Virtual Boy to its disappearance, making the odd device the one Nintendo console to not receive a traditional Mario experience.",
    "category": "    Gaming",
    "estimated_duration": "",
    "link": "https://www.polygon.com/news/559071/rare-virtual-boy-mario-land-screenshots-1995",
    "title": "INTERNET DETECTIVES UNEARTH RARE SCREENSHOTS OF CANCELED VIRTUAL BOY MARIO LAND",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\"We appreciate the patience until we get back to our usual performance\"\n\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n\nHelldivers 2 players have been complaining about degraded performance for some time, and Arrowhead CEO Shams Jorjani says that while this is a natural outcome of all the additional content the game has gotten over the past year, the devs are already at work on improvements.\n\n\"Regarding performance. we are 100% aware performance ain't great now,\" Jorjani says in a message on the game's official Discord (via VG247). \"We're tracking closely and have numerous things in motion. We'll be sharing details on what we'll do in the not too distant future. We appreciate the patience until we get back to our usual performance.\"\n\nBack in March, Helldivers 2 introduced a patch which, among other things, \"increased the number of AI calculations the game can perform.\" The devs warned that this change might have a \"slight trade-off\" in performance, but in the numerous complaints that have come through since the update, it's become clear that the issue is more than \"slight\" for many players.\n\n\"The more we add in terms of content the tougher performance becomes,\" Jorjani continues. \"We then have to do a bit of housekeeping. Hopefully in the future we'll be able to add content that has less impact.\"\n\nExactly what impact the improvements Arrowhead is planning will have remains to be seen, but at least it's clear they've got these issues in mind as they continue to update the game as a whole. And Jorjani is already teasing some of those updates, too – in response to a question about future upgrades for the Democracy Space Station, he says \"the DSS has barely scratched its potential.\" Ominously exciting.\n\n\"Games that get 19% user score do not generally recover\": Helldivers 2 CEO reflects on Arrowhead's \"summer of pain\" and No Man's Sky-inspired redemption arc.\n\nWeekly digests, tales from the communities you love, and more\n\nDustin Bailey joined the GamesRadar team as a Staff Writer in May 2022, and is currently based in Missouri. He's been covering games (with occasional dalliances in the worlds of anime and pro wrestling) since 2015, first as a freelancer, then as a news writer at PCGamesN for nearly five years. His love for games was sparked somewhere between Metal Gear Solid 2 and Knights of the Old Republic, and these days you can usually find him splitting his entertainment time between retro gaming, the latest big action-adventure title, or a long haul in American Truck Simulator.\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\n\nGamesRadar+ is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\n\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
    "category": "    Gaming",
    "estimated_duration": "",
    "link": "https://www.gamesradar.com/games/third-person-shooter/helldivers-2-devs-are-100-percent-aware-performance-aint-great-now-but-theyre-working-on-improvements-hopefully-in-the-future-well-be-able-to-add-content-that-has-less-impact/",
    "title": "HELLDIVERS 2 DEVS \"ARE 100% AWARE PERFORMANCE AIN'T GREAT NOW\" BUT THEY'RE WORKING ON IMPROVEMENTS: \"HOPEFULLY IN THE FUTURE WE'LL BE ABLE TO ADD CONTENT THAT HAS LESS IMPACT\"",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\r\nI feel like all I've been seeing the past few days is people asking if Marathon will be the game that finally brings extraction shooters into the mainstream. No one seems to be quite sure, mostly because it isn't done or out yet. The thing is, it's not the only extraction shooter due out this year that'll put that question to the test, as Arc Raiders is one the way still too. It comes from former Battlefield devs after all, who have found success with their other shooter, The Finals. And earlier today, developer Embark Studios announced that another playtest for Arc Raiders is on the way this month.\r\n\n\n\r\nSigning up for the playtest is pretty simple on Steam, you just have to head to the game's page and request access to the beta. The test itself is running from April 30 to May 4. Not everyone will be able to try it out, I should note, it's luck of the draw, but if you're feeling lucky and you're curious as to whether extraction shooters can make it mainstream, it's worth a shot.\r\n\n\n\r\nIn a press release Embark shared that they've taken on a bunch of feedback from the last test, implementing a bunch of \"tweaks and improvements.\" They've also added in more Arc enemies (evil robots that have taken over most of the world), as well as weapons and gear. Player progression and crafting systems are apparently \"deeper\" now too, and there'll be a preview of what the game's battle pass will be like.\r\n\n\n\r\nI like the vibes of Arc Raiders a lot. Bit of a stereotypical \"humans are in hiding in tiny settlements because robots have wrecked the planet\" kind of premise, though it looks good in motion, and I'm digging its particular flavour of a post-apocalypse setting.\r\n\n\n\r\nThat's the thing though, Marathon looks good in motion too, and based on most previews, plays good too. There's some specific complaints people are having about Marathon (namely a worrying lack of content at launch) which raises further questions as to whether it'll be the one to make a notoriously tough genre like extraction shooters popular.\r\n\n\n\r\nI honestly can't say how things will shake out. Games like Hunt: Showdown and Escape from Tarkov are still trudging along quite well, maybe it doesn't need to be a massively popular genre. Guess we'll have an idea by the end of the year!\r\n\r\n\n\n\nPS5, \n            Xbox Series X/S, \n            PC\n\n\n\n        Rock Paper Shotgun is better when you sign in\n      \n\n\n        Sign in and join us on our journey to discover strange and compelling PC games.\n      \n\n© 2025 Rock Paper Shotgun, an IGN Entertainment, Inc. brand. 18 Mansell Street Level 3, London, E1 8AA, United Kingdom. All rights reserved. No part of this website or its content may be reproduced without the copyright owner's permission. Rock Paper Shotgun is a registered trademark of Gamer Network Limited, an affiliate of IGN Entertainment, Inc.",
    "category": "    Gaming",
    "estimated_duration": "",
    "link": "https://www.rockpapershotgun.com/as-everyone-questions-if-extraction-shooters-will-ever-get-mega-popular-arc-raiders-lines-up-another-playtest",
    "title": "AS EVERYONE QUESTIONS IF EXTRACTION SHOOTERS WILL EVER GET MEGA POPULAR, ARC RAIDERS LINES UP ANOTHER PLAYTEST",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "You’re cordially invited to a killer wedding. For our next screening event, Collider is partnering with MGM and Lionsgate to offer our readers the chance to see director Paul Feig’s hotly anticipated follow-up to 2018’s scandalous success, A Simple Favor. For this original sequel, both Anna Kendrick and Blake Lively return as the ultimate frenemy duo for Another Simple Favor, and we want to extend an invitation to catch this destination wedding on a big screen before it premieres on Prime Video. In addition to an early screening, Feig will join us after the credits for an exclusive Q&A conversation. Read on for the full details on how to enter for your chance to win tickets.\n\nIt’s been five years since the enigmatic Emily Nelson (Lively) upended mommy vlogger Stephanie Smothers’ (Kendrick) life. Now touring with her true-crime novel, The Faceless Blonde, which chronicles the events that led to Emily’s imprisonment in the first film, Stephanie is in for an unwelcome surprise when Emily crashes one of her live readings. Not only is Emily somehow free from her 20-year sentence, she’s engaged, and she wants Stephanie to be her maid of honor. Now roped into a lavish wedding in Capri, Italy, Stephanie and her assistant Vicky (Alex Newell) board a plane and set off on a twisted getaway.\n\nFeig’s first-ever sequel is packed with drama and intrigue in the lead-up to Emily’s nuptials with the powerful, mafia-adjacent Dante Versano (Michele Morrone). Joining the first film’s messy trio, Kendrick, Lively, and Henry Golding (Crazy Rich Asians), who plays Emily and Stephanie’s ex, Sean, Another Simple Favor’s guest list includes Elizabeth Perkins (Sharp Objects), Elena Sofia Ricci (Loose Cannons), Andrew Rannells (A Simple Favor), and Academy Award winner Allison Janney (I, Tonya).\n\nThis is the destination wedding event of a lifetime, so don’t miss out. Join us on Thursday, April 24, at the Culver Theater in Los Angeles. The screening will begin at 7 p.m, and all guests will be provided with free popcorn and a drink. After the movie, Collider’s Steve Weintraub will moderate a question-and-answer session with Paul Feig, director of hit comedies like Bridesmaids, The Heat, and Spy.\n\nFor your chance to win tickets to the screening and Q&A, hit this link to provide us with your email address. Be sure to let us know if you'd like to bring a guest with you, and RSVP as soon as possible to ensure you get a seat. Don’t miss out on this chance to catch this long-awaited sequel in a theater on the big screen! We'll be contacting the winners in the days leading up to April 24, so keep an eye out.\n\nAnother Simple Favor premieres on Prime Video on May 1. Be sure to check back with Collider for even more special screenings.\n\nWe want to hear from you! Share your opinions in the thread below and remember to keep it respectful.\n\n\"I don’t think anybody really knew what I was doing there on the very first day.\"\n\nJohn Krasinski and Natalie Portman play siblings in the new adventure movie.",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://collider.com/another-simple-favor-screening-director-paul-feig-q-and-a/",
    "title": "WIN FREE TICKETS TO OUR EARLY SCREENING OF ‘ANOTHER SIMPLE FAVOR’ AND Q&A WITH PAUL FEIG",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\nTV on the Radio’s Tunde Adebimpe is back with one more pre-release track, “Somebody New,” from his solo debut, Thee Black Boltz, out this Friday, April 18, via Sub Pop.\n\n\n\t“Somebody New” is a three-minute dance-pop gem that finds Adebimpe singing in his deep, sweet voice over shuffling drums and pulsing synths: “I just wanna be somebody new/Is there nothing in the world/That we can do about this/Heavenly vibration coming through?/How can we feed this love?”\n\n\n\tAdebimpe also directed the music video for “Somebody New,” in which he plays an old-school TV presenter/crooner who seems particularly aggrieved by the bustling, ebullient dancers taking up all the space. That is until one guest-a glammed-up, life-sized puppet—helps him recapture a little bit of that music magic. \n\n\n\t“I’m positive I fell asleep on a couch with the TV on sometime in 1982 and fever dreamt this exact thing,” Adebimpe quipped of the clip in a statement. \n\n\n\n\n\n\t\n\t\tTrending Stories\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tPop Stans Were Not So Impressed With Katy Perry’s 11-Minute Spaceflight\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tMusk and Trump Are Increasingly Unpopular, New Polling Finds\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tStevie Nicks Unveils 2025 Headlining Solo Tour Dates\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tAre Em Dashes Really a Sign of AI Writing?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t“Somebody New” is the fourth song Adebimpe has shared from Thee Black Boltz, following “Magnetic,” “Drop,” and “God Knows.” Adebimpe produced his solo debut with Wilder Zoby, while the album also features contributions from his TV on the Radio bandmates Jahphet Landis and Jaleel Bunton. \n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\tAdebimpe’s solo debut comes on the heels of TV on the Radio’s live reunion last year, with the indie greats playing their first shows together since 2019 (though without lead guitarist/producer Dave Sitek). The group have several U.S. festival dates scheduled for the spring and fall (including Just Like Heaven, Sea.Hear.Now, and Shaky Knees), with a European and U.K. tour slated for the summer. \n\nWe want to hear it. Send us a tip using our anonymous form.\n\nRolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved.",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://www.rollingstone.com/music/music-news/tv-on-the-radio-tunde-adebimpe-somebody-new-1235318369/",
    "title": "TV ON THE RADIO’S TUNDE ADEBIMPE REDISCOVERS HIS DANCING SHOES IN ‘SOMEBODY NEW’ VIDEO",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nFake performative workplace conversations — specifically “How was your weekend?” — get the horror movie treatment in Cam Banfield‘s debut short called exactly that. “How Was Your Weekend?,” which premiered at the SXSW Film & TV Festival and next heads to the San Francisco Film Festival next week, is an office space horror where there is no Innie or Outie. There is only yourself, and if you didn’t have a good weekend, then the rest of us can’t have a good week. \n\nNominated for the SXSW grand jury short film award, “How Was Your Weekend?” stars James Morosini (“It’s What’s Inside“) as Steven, a cubicle drone at an anonymous, windowless corporate hovel somewhere in a depressing pocket outside Los Angeles. He arrives at the office on a Monday morning after a bad weekend of relationship troubles at home, and his coworkers are all buzzing with the question, “How was your weekend?” And when he dares to say his wasn’t great, the office population descends into surreal madness.\n\n \n\n\n\n\n\n\n\n\nRelated Stories Chris Columbus Wants to Cut Trump Cameo in ‘Home Alone 2’ but Worries He’ll Be Deported: ‘It’s Become This Curse’ ‘The Bullet Train Explosion’ Review: A Glossy Netflix Remake of the Japanese Thriller That Inspired ‘Speed’ \n\n“I can’t unsee the microaggressions in the horror of everyday life in almost everything I’m trying to do and trying to write about,” said Banfield in an IndieWire interview after SXSW over Zoom. (I was speaking from a tiny cubicle at work; he was at his apartment in Santa Monica, home from his office job lunch break to make the interview.) “What got me so excited about this project and making this short is the way there’s never been workplace horror before, defined this way, and the jump scares of office life and the discomfort of opening yourself up in this ritualistic office environment where we’re all told to clock in 9 to 5, and it pushes against your individuality.”\n\nHailing originally from Texas, Banfield has a handful of small acting credits to his name, but “How Was Your Weekend?” is his first film as a writer/director. “I was working at this job that I started to see things that I couldn’t unsee,” said Banfield of the experiences that led him to make the film. Since the SXSW premiere, he’s signed with the talent and production management company Anonymous Content and is at work on the feature script version of the short.\n\n“What if a guy’s weekend was not good? ‘How about yours?’ ‘It was actually fucking terrible,’ and that opens up the hellscape underneath everybody’s office,” he said of his ultimate pitch for the film. “You open up the short with this guy in his car, but we’re like, oh wait, he’s more like a prisoner, not a commuter. This is a prisoner reporting for his daily sentence. You got to turn that work mode on, man. Shut off that personal life.”\n\n \n\n\n\n\n\n\n\n\n\n\nHe described the SXSW short as a “blatant proof of concept” — as many shorts are en route to becoming features — which means “How Was Your Weekend?” won’t as of yet be available to stream, and instead will tour film festivals. \n\n“Everybody’s experiencing these things in the modern society we’re all in, the lack of individuality, the hive mind, people on their lunch breaks brain-rotting on their phones, all looking at the same collective thing,” Banfield said. “It has to be explored as a movie. I’m deep in it on the script right now to make it into a feature. It’s going to be a true, contained modern horror thriller set around the central question of the short film.” (Composer Zack Robinson and cinematographer Matt Clegg ramp up the tension with recognizably horror-genre elements that turn the mundane into the macabre.)\n\nBanfield sees the connections to the popular workplace TV satire “Severance,” though he promises his feature “How Was Your Weekend?” will tackle office culture from a unique angle that leans more into traditional horror. “Unfortunately, in our story, you can’t have your memories severed, and there is no Innie and Outie,” he said. “You have to deal with both sides. That is truly where everything lives: the personal, bleeding into the work. Unlike ‘Severance,’ It’s inevitable. Especially when someone opens up and is honest.”\n\n \n\n\n\n\n\n\n\n\n\n\nThe life-imitating-art nature of the production also remains a haunting one for Banfield, who filmed the short in summer 2024 over two days in a “sad office” outside LAX with non-professional actors.\n\n“We started to hear stories in this weekend cohort … [one] had just taken a leave of absence for depression from their own job, and they were just trying this out. Another woman had been a vet for 30 years, and she literally wanted to just try something for herself for once and got cast in this and suddenly loves acting,” Banfield said, adding, “It’s a sad office, man, and it was almost haunting going in there and seeing the things that the former tenants [left]… There were family wallet-sized photos just left in the filing cabinets. It was surreal.”\n\n“How Was Your Weekend?” plays SFFILM on Thursday, April 24.\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://www.indiewire.com/features/interviews/cam-banfield-workplace-horror-short-how-was-your-weekend-1235115750/",
    "title": "THIS FEST FAVE SHORT FILM THAT TURNS THE WORKPLACE INTO A NIGHTMARE WILL SOON TURN INTO A FEATURE",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "Ghost have pulled from religious themes in creating the lore surrounding the band, but what is the big misconception that fans may have about the band? Frontman Tobias Forge spoke about one particular ideal that is associated with the band that he feels people get wrong.\n\nWhile chatting with Rolling Stone UK, the topic of having ghost encounters came up. Forge opened the chat by stating he felt that he had experienced \"unexplained or unrational contact with the void,\" but that led him down another path of the unexplained.\n\nForge spoke about the idea that Ghost had been either dismissive or has a completely atheist agenda when it comes to religion. \"Actually no,\" says the singer after posing the notion.\n\n\"I think that one of the most important things was if mankind could unite in the idea that there very well might be a force and things that we cannot explain and that we could completely accept that, that there's things that we don't know and that that might be larger than what we can articulate instead of what is happening now,\" he continued.\n\nForge said that much of religion today and for a \"few thousand years\" has been people telling you how things are and what's going to happen after you die. To that notion, he says, \"They're lying. They're lying to you. That's the problem. They want you to do something.\"\n\nThe vocalist counters, \"If we could agree that we do not know, but that there might very possibly be some divine otherworldly power, I think that is a great way to move forward. And for mankind to finally rejoice.\"\n\nJust last month, Ghost kicked off the promotion of their new Skeleta album with the release of the single \"Satanized.\" But despite the eye raising title and lyrics that seemingly discuss a possession, Tobias Forge recently shared with WRIF's Meltdown that it's actually a love song.\n\nREAD MORE: Ghost Might Stop the Lore, Tobias Forge Explains Why\n\n\"It's a song about being in love and how that can potentially be mistaken as demonic possession, but in reality this song has nothing to do with demonic possession,\" shared the vocalist.\n\n\"Satanized\" appears on Skeleta, the band's sixth studio album. The record drops April 25 and pre-orders are currently being taken through the group's website.",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://loudwire.com/misconception-ghost-view-religion/",
    "title": "THE BIG MISCONCEPTION ABOUT GHOST'S VIEW ON RELIGION",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "In a new interview with PowerOfMetal.cl, former KAMELOT singer Roy Khan spoke about the recent announcement that he will take the stage on July 5, 2025 at Tokio Marine Hall in São Paulo, Brazil for a one-night-only performance celebrating the 20th anniversary of the band's \"The Black Halo\" album. Asked why now is the right time for him to celebrate this LP, Roy said (as transcribed by BLABBERMOUTH.NET): \"Well, like you said, it's 20 years ago since it came out. And 'The Black Halo' is undoubtedly possibly the most important album in my catalog. So I just felt that it was in its place to do some sort of celebration in connection with the 20th anniversary. And that's what we're doing in São Paulo on the 5th of July.\"\n\nAsked what he thinks made \"The Black Halo\" such a \"timeless\" record, Roy said: \"I think it was in a very important phase of the band's development, both as a group and as the members individually. The time was right. There were some new collaborations there that took place. It was the first record we recorded with SPV, so we had a good budget and we could do whatever we wanted. We could try our stuff and tear things down in studio, build them up again. We had the finances to do things properly. And I think the lyrics hit some sort of nerve that I think a lot of people can relate to. But most of all, I think it's a bunch of people that happened to align with each other and managed to make something that is really greater than the sum of them all. And 'The Black Halo' has definitely stood the test of time. I mean, the album is a classic in the genre.\"\n\nRegarding his current relationship with his former bandmates in KAMELOT, Roy said: \"Thomas [Youngblood, KAMELOT founder] and I, we talk on the phone now and then. We kind of have to, 'cause we still have business together that we need to deal with. I also talk to Casey [Grillo, former KAMELOT drummer] now and then. I mean, I talked to him a couple of weeks ago when he was in Norway with QUEENSRŸCHE. So, yeah, we keep in touch.\"\n\nAsked if he has ever talked to Thomas about the possibility of reuniting with KAMELOT for a special concert or anything like that, Roy said: \"We've been talking about it, but there's a lot of things that need to fall in place for something like that to happen. KAMELOT with the current lineup, they need to have time for Thomas to do something different. I have my schedule. But as a starting point, both Thomas and I are open to doing something at some point, I think. But who's gonna do what? Where is it gonna happen? When? Finances. Who's gonna do what? So many things need to be taken care of. The logistics are… yeah. But we'll see.\"\n\nOriginally released in 2005, \"The Black Halo\" remains a landmark in metal history, featuring iconic tracks like \"March Of Mephisto\", \"The Haunting (Somewhere In Time)\" and \"When The Lights Are Down\".\n\nAdding to the excitement, \"The Black Halo (20th Anniversary Edition)\" has just been made available in an array of special formats, including a limited-edition wooden box set featuring splattered vinyl, a collector's chalice, a ring, a pendant in a velvet bag, a 20-page booklet, and an exclusive autographed card. Other variants include deluxe marbled vinyl, a slipmat and a digipak CD edition. This must-have collector's edition was released via Napalm Records on March 14, 2025 — exactly two decades after its original debut.\n\nKhan is also featured as a special guest on \"Here Be Dragons\", the latest album from Tobias Sammet's AVANTASIA. His powerful vocals grace a grand and emotional power ballad, marking another exciting chapter in his return to the scene. Sammet himself praised Khan's contribution, calling the song \"one of the most moving and emotional, yet biggest ballads I have ever done.\"\n\nIn the summer of 2023, Roy said that a number of things contributed to his decision to leave KAMELOT nearly a decade and a half ago.\n\nThe now-55-year-old Norwegian singer announced his exit from KAMELOT in April 2011 after taking several months off to recover from a \"burnout.\"\n\nAfter his departure from KAMELOT, Khan, who is a devout Christian, joined a church in the coastal town of Moss, Norway.\n\nIn an interview with Justin Young of Monsters, Madness And Magic, Roy — whose full name is Roy Sætre Khantatat — was asked what led to his split with KAMELOT. He responded: \"Everything. Too much travel. Too much work. I had my first kids. I got married and I was pretty much falling into every pit there was. And this whole character that I was creating was very different from the person that I was and wanted to be at home. And those two characters pulled farther and farther from each other and that whole thing just tore me apart. I wasn't really present when I was at home either. I'd come back from a six-week tour and just take my shoes off and sit right down on the PC and work on something, and it was not good. And I got mentally sick. That summer of 2010, I had a period of five, six weeks where I literally did not sleep. Maybe, I mean a little bit, of course, but there were so many nights that I did not sleep at all. I just wandered around the house and worrying about everything and nothing.\"\n\nAsked if he became religious after his exit from KAMELOT, Roy said: \"Religious? Depends on what you mean by religious, how you define that. But I've always been occupied with big questions and also spiritual things. I mean, those kind of things have always fascinated me. But there were some really weird things that happened to me in connection with me being at my lowest low ever in 2010. I mean, obviously, I was really mentally ill at that point, but we experienced things. I mean, I experienced things that other people experienced together with me, and the timing of things were really awkward. Whatever that was, it definitely made me completely change my mind on the whole issue, is there something out there that we can't see that affects us? I'm positive about that. And I still have to sit down and pinch myself in the arm and just remind myself that the things that happened happened. I mean, some of those things people surely will say are coincidence. Some will say that I just imagined it. Some people will say that — some people won't even believe. But for me, it was very, very clear. And, there's no doubt in my mind. That doesn't mean that that completely changed my life. I mean, it did, but it's not like I was a whole new being all of a sudden. I still have things that I struggle with. It's not like you go from being an arrogant, sinful bastard to being an angel. It's a process. But all those things, having those things in mind for me is definitely gradually changing me in my approach to other people, life in general and then how I look at the time that I have left on this planet.\"\n\nThree years ago, Roy told Chaoszine about his split with KAMELOT: \"I'm really, really extremely thankful that KAMELOT was able to continue without me, 'cause I had no intention to hurt the band. It was a very personal decision to quit the band and I simply had to. And I'm just glad that everything turned out in the end to be… They managed to go on without me, and I'm just very thankful for that, really.\"\n\nKhan, who reformed his pre-KAMELOT band CONCEPTION seven years ago and released an EP, 2018's \"My Dark Symphony\", and a full-length album, 2020's \"State Of Deception\", previously reflected on the circumstances that led to him ending his long working relationship with KAMELOT during an appearance in 2021 on the \"Breaking Absolutes With Peter Orullian\" podcast. Roy said: \"That whole thing was a cocktail of several things that just happened to climax at that point. As you all, KAMELOT was getting more and more popular, so I was away months every year — like half the year at least I was gone. I was having a family, and that right there was starting to tear me apart. And then I was living my life not very healthy — let's put it that way — and I did a lot of stupid stuff back then that… I knew in my heart that it was going down the drain.\"\n\nHe continued: \"I remember every night when I sang [the KAMELOT song] 'Karma', I would feel that this shit is gonna knock me on the back of the head at some point. If it's gonna tomorrow, [if] it's gonna be two years from now, I don't know, but the way I live my life, that's not gonna work — it's not sustainable. And then it happened. I knew for so many years, actually, that this was gonna not work out, and then, all of a sudden, it happened. I broke down. I had a full summer where I barely slept — like six to eight weeks where I didn't sleep a whole lot of hours during those six to eight weeks, and I was going really completely crazy. And in connection with that, a lot of stuff happened.\"\n\nAccording to Khan, leaving KAMELOT after a 13-year run weighed heavily on him at the time.\n\n\"Quitting KAMELOT was the best decision that I've ever made, and by that I don't mean that… KAMELOT was a fantastic thing in my life, and Thomas and the other guys — it had nothing to do with them; it was all me and the way I lived my life, and I just couldn't take it any longer,\" he explained. \"And I was also overworked — I worked all the time. Even when I was home. The first thing I'd do when I got back home is I would kick my shoes off in the hallway and I'd just sit right down at the computer and start working. I was really not a good husband and I was not a good father. Lots of things weren't good about me at that point.\n\n\"Quitting KAMELOT at that point, it was easy but it was hard,\" he elaborated. \"It was easy because I didn't really have a choice. I was really wrecked. And at the same time, it was hard because I'd been working to get to that point my whole life, basically — 20 years, at least — and finally I was there. And then I threw the towel in and said, 'Hey, guys, I'm not coming in for the next tour.' 'Okay. Well, what's wrong?' 'Well, actually, I'm not coming back at all.' And obviously, everybody… My mom was, like, 'Are you kidding me? Are you serious?' Then the guys in the band, they thought that it was gonna pass. But I knew in my heart that summer [of 2010], already in August, I knew that that's it.\"\n\nKAMELOT officially announced Tommy Karevik as its new lead singer in June 2012. The Florida-based band has recorded four albums so far with the Swedish vocalist: 2012's \"Silverthorn\", 2015's \"Haven\", 2018's \"The Shadow Theory\" and 2023's \"The Awakening\".\n\nAsked if he has listened to any of KAMELOT's recent material with Karevik, Roy told Italy's SpazioRock back in 2018: \"Yes I have. I really like some of their new stuff. Sounds classical KAMELOT in my ears, and Tommy is a great singer.\"\n\nRoy Khan se apresenta como “Co-Headliner” em show solo especial no Tokio Marine Hall, em São Paulo, no dia 5 de julho de...",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://blabbermouth.net/news/roy-khan-is-open-to-doing-something-with-kamelot-again-weve-been-talking-about-it",
    "title": "ROY KHAN IS OPEN TO DOING SOMETHING WITH KAMELOT AGAIN: 'WE'VE BEEN TALKING ABOUT IT'",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "\nMubi will exclusively debut Courtney Stephens and Callie Hernandez’s semi-autobiographical conspiracy film “Invention” on streaming in North America. The specialty streamer will release the feature on its platform during the summer, following its limited theatrical engagement beginning Friday in New York City.\n\n\n\tA collaboration between writer-director Stephens and writer and star Hernandez, the 16mm-shot “Invention” incorporates archival footage of Hernandez’s real father, an alternative medicine physician who died of COVID in 2021. Hernandez plays “Carrie,” a woman who must navigate her own grief after she inherits an odd healing doohickey from her late father. The film’s cast also features other indie filmmakers, such as Caveh Zahedi, Joe Swanberg and James N. Kienitz Wilkins.\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tVIP+\n\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tWhat Warner Bros. Can Learn From Netflix About Video Game Strategy \t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\t'Yellowjackets' Bosses on Crowning [SPOILER] the Antler Queen and Ideas for a Possible Season 4\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t“Invention” debuted at the 2024 edition of the Locarno Film Festival, where Hernandez won the Pardo for best performance in the Filmmakers of the Present Section of the fest. Since Locarno, the film had its North American premiere at the Los Angeles Festival of Movies earlier this month, then bowed on the East Coast at New Directors/New Films. \n\n\n\n\n\t\t\tPopular on Variety\t\t\n\n\n\n\n\n\n\n\tAcross the pond, “Invention” will get a week-long theatrical run in London during the summer at the Institute of Contemporary Arts as part of the org’s Off-Circuit program.\n\n\n\tThe film comes from Jacket Weather and Hernandez’s Neurotika Haus banner, which co-produced Pete Ohs’ “The True Beauty of Being Bitten by a Tick,” a premiere at SXSW earlier this year. Hernandez founded Neurotika Haus after more than a decade of screen acting, with credits including “La La Land,” “Alien: Covenant” and “Under the Silver Lake.” Stephens co-directed the documentary “The American Sector,” released in 2021. ",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://variety.com/2025/film/news/mubi-acquires-callie-hernandezs-invention-1236370257/",
    "title": "MUBI ACQUIRES COURTNEY STEPHENS AND CALLIE HERNANDEZ’S ‘INVENTION’ FOR STREAMING IN NORTH AMERICA (EXCLUSIVE)",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": " Forty years on, no one has forgotten about The Breakfast Club. But star Molly Ringwald, for one, has made it clear she doesn't think it should be remade.\n\n\n \"I personally don't believe in remaking that movie, because I think this movie is very much of its time,\" Ringwald said at a recent cast reunion at the C2E2 convention when the cast was asked if such a movie could be made today.\n\n\n \"It resonates with people today,\" she continued. \"I believe in making movies that are inspired by other movies but build on it and represent what's going on today. This is very, you know, it's very white, this movie. You don't see a lot of different ethnicities. We don't talk about gender … none of that. And I feel like that really doesn't represent our world today. So I would like to see movies that are inspired by The Breakfast Club but take it in a different direction.\"\n\n\n Ringwald has previously remarked that certain parts of the John Hughes film, which costarred Emilio Estevez, Anthony Michael Hall, Judd Nelson, and Ally Sheedy, \"haven't aged well.\"\n\n\n In April 2024, she penned a piece for London's The Times, in which she called out, for instance, the behavior of Nelson's character, John Bender, toward her Claire Standish. She wrote that Bender \"essentially sexually harasses my character.\" She added, \"I'm glad we’re able to look at that and say things are truly different now.\"\n\n\n The film depicts five high school students, from various high school social circles that hail from very different families, spending their Saturday together in detention. They get to know each other, especially their heartbreaks, as the hours pass in the school library.\n\n\n On the panel, Estevez agreed with Ringwald and offered another reason that the teen classic wouldn't get the same reception in a very different landscape for film.\n\n\n Want more movie news? Sign up for Entertainment Weekly's free newsletter to get the latest trailers, celebrity interviews, film reviews, and more.\n\n\n \"Movies today are concept driven, they're not character driven, and the beauty of John is that he focused on characters first,\" he said. \"And when you think about trying to pitch this movie today, it's about five kids sitting in a library, all day in detention, and then the studio executives would march you right out the door and say, 'Where are the monsters? Where's the car chases? Where are the big effects?'\"\n\n\n He noted that The Breakfast Club was made for $1 million. It grossed $45.8 million worldwide, according to Box Office Mojo.\n\n\n It \"was not thought of as a big, giant tentpole film as they make today,\" Estevez said. \"So there was a lot of risk involved, but by today's standards, this movie would, I don't think, would ever get made.\"\n",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://ew.com/molly-ringwald-talks-very-white-movie-the-breakfast-club-11715918",
    "title": "MOLLY RINGWALD SAYS “THE BREAKFAST CLUB ”'DOESN'T REPRESENT OUR WORLD TODAY': 'IT'S VERY WHITE'",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "The Weekly Injection: New Releases From EPICA, THE MARS VOLTA & More Out This Week 4/11\n\nThe Weekly Injection: New Releases from ALLEGAEON, SCOWL & More Out This Week 4/4\n\nThe Weekly Injection: New Releases From DEAFHEAVEN, ARCH ENEMY & More Out This Week 3/28\n\nThe Weekly Injection: New Releases From CRADLE OF FILTH, IMPERIAL TRIUMPHANT & More Out This Week 3/21\n\nThe Weekly Injection: New Releases From WARBRINGER, COHEED & CAMBRIA + More Out This Week 3/7\n\nCHAOS UNDER THE SUN (MONOLORD) Streams Slow-Burning, Synth Heavy Debut \"Odd Bird\"\n\nCADAVER Streams Churning New Single \"From The Past\"\n\nDARK ANGEL Streams First New Song In 34 Years, Announces Long-Awaited New Record\n\nUNMERCIFUL Streams Bludgeoning New Single \"Malice Unbound\"\n\nSODOM Announces New Album, Streams Raging Single \"Trigger Discipline\"\n\nCHAINED SAINT's Rhythm Section Names The Bassists & Drummers That Inspire Them\n\nThe Weekly Injection: New Releases From EPICA, THE MARS VOLTA & More Out This Week 4/11\n\nCRYPTOPSY Seems To Be Teasing Another New Album Already\n\nThe Weekly Injection: New Releases from ALLEGAEON, SCOWL & More Out This Week 4/4\n\nSIGH To Release A Completely Re-Recorded Version Of Hangman's Hymn This June\n\nJOHN FRUM (THE DILLINGER ESCAPE PLAN, IMPERIAL TRIUMPHANT, Etc.) Is Tracking Their First Album Since 2017\n\nTwo Major Rock & Metal Names Appeared In Google's Year In Search 2024 Roundup\n\nMan Arrested For Getting Too Drunk & Resisting Arrest At A HAWTHORNE HEIGHTS Show In Disney\n\nImportant: Here's CARCASS Partying To \"Feliz Navidad\" On Stage\n\nGood News! CRADLE OF FILTH's Jesus Shirt Is Still Making Crybabies Mad\n\nWhen We Were Young Festival Merch Riddled With Typos\n\nInterview: From Dystopian Thrash To Existential Cosmic Horror – How CRYPTOSIS Expanded Their Sound With Celestial Death\n\nInterview: ARCH ENEMY's MICHAEL AMOTT On Evolution, Experimentation, & Pushing Boundaries With Blood Dynasty\n\nInside IMPERIAL TRIUMPHANT's \"More Forgiving, More Palatable Avant-Death Experience\" Goldstar\n\nPOWERWOLF's MATTHEW GREYWOLF Discusses The Band's New Album, North American Tour & Historical Figures In Their Music\n\nMAX CAVALERA Sets The Record Straight On A SEPULTURA Reunion, Talks About Their Breakup, His Future Plans & Much More With Metal Injection\n\nJUDAS PRIEST, ALICE COOPER & CORROSION OF CONFORMITY Announce North American Tour\n\nCONVERGE, CAVE IN, DEADGUY & More Booked For RICH HALL Memorial Show\n\nGOJIRA Announces US Show With LOATHE, Uses Old Logo For The Poster\n\nCREED Announces Summer of '99 & Beyond Cruise 2026 Feat. 3 DOORS DOWN, COLLECTIVE SOUL & More\n\nSYMPHONY X & SONATA ARCTICA Announce North American Tour Dates\n\nThe spirit of early '90s Florida death metal comes back to life.\n\nAfter a seven-year wait, Gruesome – the old-school death metal band inspired by the legendary Chuck Schuldiner and the many iterations of Death – are kicking things into gear with the announcement of their new album, Silent Echoes, set for release on June 6, 2025, via Relapse Records.\nThe first glimpse into the record comes in the form of \"A Darkened Window\", which arrived alongside an official music video directed by The Coin. \n\n\n\nThe band explained their vision behind the track, saying: \"'A Darkened Window' was the perfect song to pair with the visuals of The Coin, who captured the existential despair of lyrics perfectly – a vision of modern existence where every human emotion can be commoditized and therefore must be groomed, filtered, and corrected into something synthetic and horrifying.\"\n\n\n\nWhile the band’s foundation in classic death metal is still very much in place, Silent Echoes diverges from the straight-ahead brutality of Savage Lands and Twisted Prayers. According to the band, the record delves into deeper waters, leaning into complexity and technicality reminiscent of Death's landmark 1991 record Human.\n\n\n\nThe album's deliberate sonic evolution is a homage to their late mentor, Sean Reinert, the legendary drummer known for his work with Cynic and Death. Originally set to produce the album, Reinert passed away unexpectedly in 2020. His loss left a lasting mark on the band, especially drummer Gus Rios, who was also Reinert’s best friend.\nIn the wake of that loss, Rios, along with vocalist/guitarist Matt Harvey, lead guitarist Daniel Gonzalez, and bassist Robin Mazen, decided to turn Silent Echoes into a memorial. Reinert’s spirit permeates the entire record — from its intricate rhythms to the reflective, almost spiritual approach to songwriting.\n\n\n\n\"There’s less winking at the audience on this one,\" says Harvey, capturing the more sincere and focused energy of the album.\n\n\n\nPre-order Silent Echos here.\n\t\t\t\n\nThe first glimpse into the record comes in the form of \"A Darkened Window\", which arrived alongside an official music video directed by The Coin. \n\n\n\nThe band explained their vision behind the track, saying: \"'A Darkened Window' was the perfect song to pair with the visuals of The Coin, who captured the existential despair of lyrics perfectly – a vision of modern existence where every human emotion can be commoditized and therefore must be groomed, filtered, and corrected into something synthetic and horrifying.\"\n\n\n\nWhile the band’s foundation in classic death metal is still very much in place, Silent Echoes diverges from the straight-ahead brutality of Savage Lands and Twisted Prayers. According to the band, the record delves into deeper waters, leaning into complexity and technicality reminiscent of Death's landmark 1991 record Human.\n\n\n\nThe album's deliberate sonic evolution is a homage to their late mentor, Sean Reinert, the legendary drummer known for his work with Cynic and Death. Originally set to produce the album, Reinert passed away unexpectedly in 2020. His loss left a lasting mark on the band, especially drummer Gus Rios, who was also Reinert’s best friend.\nIn the wake of that loss, Rios, along with vocalist/guitarist Matt Harvey, lead guitarist Daniel Gonzalez, and bassist Robin Mazen, decided to turn Silent Echoes into a memorial. Reinert’s spirit permeates the entire record — from its intricate rhythms to the reflective, almost spiritual approach to songwriting.\n\n\n\n\"There’s less winking at the audience on this one,\" says Harvey, capturing the more sincere and focused energy of the album.\n\n\n\nPre-order Silent Echos here.\n\t\t\t\n\nThe band explained their vision behind the track, saying: \"'A Darkened Window' was the perfect song to pair with the visuals of The Coin, who captured the existential despair of lyrics perfectly – a vision of modern existence where every human emotion can be commoditized and therefore must be groomed, filtered, and corrected into something synthetic and horrifying.\"\n\n\n\nWhile the band’s foundation in classic death metal is still very much in place, Silent Echoes diverges from the straight-ahead brutality of Savage Lands and Twisted Prayers. According to the band, the record delves into deeper waters, leaning into complexity and technicality reminiscent of Death's landmark 1991 record Human.\n\n\n\nThe album's deliberate sonic evolution is a homage to their late mentor, Sean Reinert, the legendary drummer known for his work with Cynic and Death. Originally set to produce the album, Reinert passed away unexpectedly in 2020. His loss left a lasting mark on the band, especially drummer Gus Rios, who was also Reinert’s best friend.\nIn the wake of that loss, Rios, along with vocalist/guitarist Matt Harvey, lead guitarist Daniel Gonzalez, and bassist Robin Mazen, decided to turn Silent Echoes into a memorial. Reinert’s spirit permeates the entire record — from its intricate rhythms to the reflective, almost spiritual approach to songwriting.\n\n\n\n\"There’s less winking at the audience on this one,\" says Harvey, capturing the more sincere and focused energy of the album.\n\n\n\nPre-order Silent Echos here.\n\t\t\t\n\nWhile the band’s foundation in classic death metal is still very much in place, Silent Echoes diverges from the straight-ahead brutality of Savage Lands and Twisted Prayers. According to the band, the record delves into deeper waters, leaning into complexity and technicality reminiscent of Death's landmark 1991 record Human.\n\n\n\nThe album's deliberate sonic evolution is a homage to their late mentor, Sean Reinert, the legendary drummer known for his work with Cynic and Death. Originally set to produce the album, Reinert passed away unexpectedly in 2020. His loss left a lasting mark on the band, especially drummer Gus Rios, who was also Reinert’s best friend.\nIn the wake of that loss, Rios, along with vocalist/guitarist Matt Harvey, lead guitarist Daniel Gonzalez, and bassist Robin Mazen, decided to turn Silent Echoes into a memorial. Reinert’s spirit permeates the entire record — from its intricate rhythms to the reflective, almost spiritual approach to songwriting.\n\n\n\n\"There’s less winking at the audience on this one,\" says Harvey, capturing the more sincere and focused energy of the album.\n\n\n\nPre-order Silent Echos here.\n\t\t\t\n\nThe album's deliberate sonic evolution is a homage to their late mentor, Sean Reinert, the legendary drummer known for his work with Cynic and Death. Originally set to produce the album, Reinert passed away unexpectedly in 2020. His loss left a lasting mark on the band, especially drummer Gus Rios, who was also Reinert’s best friend.\nIn the wake of that loss, Rios, along with vocalist/guitarist Matt Harvey, lead guitarist Daniel Gonzalez, and bassist Robin Mazen, decided to turn Silent Echoes into a memorial. Reinert’s spirit permeates the entire record — from its intricate rhythms to the reflective, almost spiritual approach to songwriting.\n\n\n\n\"There’s less winking at the audience on this one,\" says Harvey, capturing the more sincere and focused energy of the album.\n\n\n\nPre-order Silent Echos here.\n\t\t\t\n\nIn the wake of that loss, Rios, along with vocalist/guitarist Matt Harvey, lead guitarist Daniel Gonzalez, and bassist Robin Mazen, decided to turn Silent Echoes into a memorial. Reinert’s spirit permeates the entire record — from its intricate rhythms to the reflective, almost spiritual approach to songwriting.\n\n\n\n\"There’s less winking at the audience on this one,\" says Harvey, capturing the more sincere and focused energy of the album.\n\n\n\nPre-order Silent Echos here.\n\t\t\t\n\n\"There’s less winking at the audience on this one,\" says Harvey, capturing the more sincere and focused energy of the album.\n\n\n\nPre-order Silent Echos here.\n\t\t\t\n\nEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\n\nFeaturing Nile, Leprous, Entheos, Cavalera, Kittie, Ulver, and more!\n\n\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t© \r\n\t\t\t\t\t\t\t\t\t\t\t\t\tMetal Injection. All Rights Reserved. Help Wanted | Advertising Info | Contact Us\n\n\n\nPrivacy\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tPolicy\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tHow We Use Your Data\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tDo Not Sell My Personal\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tInformation\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tYour California Privacy Rights\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tTerms and\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tConditions\n",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://metalinjection.net/video/gruesome-drops-music-video-for-a-darkened-window-announces-new-album",
    "title": "GRUESOME DROPS MUSIC VIDEO FOR \"A DARKENED WINDOW\", ANNOUNCES NEW ALBUM",
    "video_id": ""
  },
  {
    "backtime": "",
    "body": "A source says the NYPD will allow the shows to go on as planned after neighbors earlier attempted to block the department from closing the streets surrounding the venue.\n\n\nForest Hills Stadium in Queens says its 2025 season is officially on despite a long-running noise dispute with its neighbors.\n\n\n\t“As anticipated, we’re pleased to announce that the City of New York has given Forest Hills Stadium the green light for our 2025 concert season to proceed as planned,” reads a statement from a stadium spokesperson sent to Billboard. “Each year, our team works closely with the local community and elected officials to bring world-class performances at one of the most iconic music venues in the country.” \n\n\n\tThe statement continues, “We’re excited to welcome fans back this summer and proud to continue our role as a cultural cornerstone of the Queens community.” \n\n\n\tLast month, local homeowners association Forest Hills Garden Corporation (FHGC) denied the New York Police Department (NYPD) permits to shut down streets bordering the stadium for its upcoming concert season, with the New York Post reporting that the NYPD revoked the venue’s sound amplification permits as a result. At the time, a spokesperson for the NYPD told Billboard, “This is a disagreement between the Forest Hills Garden Corporation (FHGC) and the West Side Tennis Club,” the latter of which owns the venue. The statement continued, “We understand that many people enjoy these concerts every summer, but we must be able to take appropriate action to keep people safe. We trust that the FHGC and the West Side Tennis Club will be able to reach an appropriate compromise.” \n\n\n\n\n\t\t\tTrending on Billboard\t\t\n\n\n\n\n\n\n\n\tAccording to a source familiar with the situation, the NYPD decided to allow the concert series to move forward over the FHGC’s objections. The source added that the FHGC has said it will abide by the police department’s decision.\n\n\n\tBoth the NYPD and the FHGC were contacted for comment, but neither responded by press time.  \n\n\n\tForest Hills’ 2025 concert season is set to kick off May 31 with a performance from Bloc Party. The season will also include shows from Dr. Dog, two nights of Phish, King Gizzard and the Lizard Wizzard, two nights of Mumford & Sons, The Black Keys, Leon Bridges, Alabama Shakes and the New York edition of All Things Go Festival.  \n\nA daily briefing on what matters in the music industry\n\nBillboard is a part of Penske Media Corporation. © 2025 Billboard Media, LLC. All Rights Reserved.",
    "category": "    Entertainment",
    "estimated_duration": "",
    "link": "https://www.billboard.com/pro/forest-hills-stadium-2025-concerts-go-on-complaints/",
    "title": "FOREST HILLS STADIUM SAYS 2025 CONCERT SEASON WILL GO ON AFTER CITY OF NEW YORK GIVES GO-AHEAD",
    "video_id": ""
  }
]