[
  {
    "body": "\n                Our small-group adventures are inspired by our Atlas of the\n                world's most fascinating places, the stories behind them, and\n                the people who bring them to life.\n              \n\n\n            No search results found for\n            “”\n          \n\n\n            Make sure words are spelled correctly.\n          \n\n\n            Try searching for a travel destination.\n          \n\nWhen it comes to points of nature around the world, sometimes it’s difficult to find truth on what site truly earns an honorific. There are numerous claims by local tour guides and on the Internet about the “smallest” volcano in the world. Volcán Pabellones, about 26 feet (8 meters) high and approximately 13 feet (4 meters) in diameter, just might take the crown.\n\nThe tiny volcano sits behind small houses off a through road hours south of Cusco. Surrounded by a small fence and marked with a modest plaque, it receives few visitors—on a typical day, there were no tourists around.\n\nOther contenders for the title of world’s smallest volcano include Cuexcomate in Mexico, which is said to be 43 feet (13 meters) tall. Problem is that, while it’s called a volcano, many actually consider it to be a geyser. Meanwhile, the Taal Volcano in the Philippines is touted online as the smallest active volcano, though it is about 1,020 feet (311 meters) tall.\n\nAn emerging area of research for volcanologists—yes, this is a job title—is very tiny volcanoes. There is one being studied in Colombia that is just 3 centimeters tall. The area around it that is closed off is only 10 centimeters. These tiny volcanoes are scientifically interesting, but perhaps so small that there’s not much to see.\n\nVolcán Pabellones is worth a stop because it’s large enough to truly come across as a volcano, but yet, it’s mini.\n\nThis volcano is in between CU-1672 and Highway 34F, down a very small road called Calle Hipólit.\n\n\n                      April 10, 2025\n                    \n\nThe steep slope known as “Ob Hill” overlooks an Antarctic research station.\n\nOne of few vertical lava tubes in the world accessible by foot. \n\nA 40-foot waterfall flows into this unique natural swimming hole. \n\nIn 1912, this idyllic Alaska landscape was blown apart in the largest volcanic eruption of the 20th century.\n\nDeep vertical fissures like miniature slot canyons cut across the cemented volcanic rock of Black Point above Mono Lake.\n\nThe larger of two volcanic peaks rising out of the crystalline waters of the Caribbean. \n\nBecome an Atlas Obscura member and experience far fewer ads\n\n\n      © 2025 Atlas Obscura. All Rights Reserved.\n    ",
    "category": "Weird News",
    "link": "https://www.atlasobscura.com/places/volcan-pabellones",
    "title": "Volcán Pabellones in Peru"
  },
  {
    "body": "ON THIS WEEK’S episode of Dinner SOS, test kitchen director and host Chris Morocco is joined by editorial operations manager Kate Kassin to help caller Janae conquer the matzo ball.\n\nJanae loves a cooking project, and when she’s at the stove, even the simplest dishes often turn into something much more involved and delicious. Until she attempted to make matzo balls. For the last six Passovers, Janae’s matzo balls have fallen apart in her soup. And while the rest of her Passover menu might change every year, matzo ball soup is a critical, immovable tradition. The other thing fueling Janae's desire for matzo ball redemption: her mother-in-law. Janae is determined to turn this passover, her seventh as host, into a matzo ball victory!\n\nChris taps Kate Kassin to cover all the matzo ball basics, starting with whether they are better from a mix or from scratch. And what do you do about the broth? They leave it to Janae to decide what path to choose, between a mix and Molly Baz’s recipe for Matzo Ball Soup that includes No-Nonsense Matzo Balls.\n\nListen now to hear if Janae is on track to make this year’s Seder a matzo ball success story!\n\nChris Morocco: Hey, there, listeners, future callers, and cooking enthusiasts. Welcome to Dinner SOS: the show where we help you save dinner or whatever you're cooking. I'm Chris Morocco, Food Director of Bon Appétit and Epicurious. Our caller this week, Janae, loves a cooking project, and even a simple dish turns into something much more involved, and more delicious when she's at the helm.\n\nJanae: Yesterday, I made turkey meatballs in this mushroom broth, and then I threw some cream in there. Yeah, that was pretty good.\n\nCM: Okay. Well, listen, I could ask you easily, comfortably, handily, even, 20 more questions just about the turkey meatballs alone, but something tells me that's not why you called in.\n\nJ: I did call about balls, but they're not turkey meatballs. They are matzo balls.\n\nJ: Okay. I have been trying and trying, trying to get matzo balls that don't fall apart in my soup for, I think, six Passovers now.\n\nCM: Janae didn't grow up making matzo ball soup, or celebrating Passover for that matter. She converted to Judaism a few years ago, though she'd been embracing her husband's Jewish traditions for many years before that.\n\nJ: My grandmother has since passed. She was a very religious person and she used to say things like, \"Oh, he's Jewish? Did you take him to Jewish church?\" I'm like, \"Granny, you can't call it that,\" but she was really, really just a person who loved, I guess, religion, and God, and people. When I told her that he was Jewish, she wanted me to wholeheartedly embrace Judaism in every aspect of the tradition.\n\nCM: Janae has done just that. It's extra frustrating that at her Seder, the ritual meal that celebrates Passover, the one thing that's been going wrong is the matzo balls.\n\nJ: Matzo ball soup is the tradition. I can change everything about the menu, but I want to be able to perfect that thing that is traditionally always on the table at Passover.\n\nCM: Well, and for anyone who might not be familiar with the tradition of Passover, and Seders specifically, can you just sort of talk to us about what that's all about?\n\nJ: The Passover Seder, Seder means order. There's an order of events. There's an order in which you eat things. There's an order in which you commemorate the traditions and part of the Seder, part of the meal, you break to eat the matzo. In a lot of Jewish families, when you break to eat, the matzo is also when you break to eat the matzo ball soup. It's the first thing that you eat at dinner, and it's usually after everybody's hungry and been bickering, and had at least a glass of wine.\n\nTensions are high, and like, \"Where are we in the book? No one wants to read this.\" The teenager was like, \"Oh, can I grab my phone?\" Then here comes that aha moment of you eat the matzo, you eat the matzo ball soup. I feel like the matzo ball soup is supposed to bring everybody back down. It's not as exciting as the rest of the meal, but it's the first thing that you're supposed to eat.\n\nI want it to be enjoyable. I want it to be exciting. Then my mother-in-law, she touts that she's got the best matzo balls in the family, and right now, she does.\n\nCM: That's the other thing fueling Janae's desire for matzo ball redemption: her mother-in-law.\n\nJ: I've been married for two years, but I've been with my husband for 10. Early on in our relationship, things got difficult with his mom.\n\nJ: I hope not. She likes to tell everyone that Passover was always her holiday, and so was Thanksgiving. Now, those are the two biggest holidays for my family, because both revolve around a meal. She has-\n\nJ: I think that the people who should be claiming holidays are the people who are the cooks.\n\nCM: Yeah, well, I certainly agree with that. Interesting. Okay, so she has laid claim to Passover, and what has that looked like?\n\nJ: Last year, it was at her house, but I braised the brisket. I also seared off some salmon. I made vegetables. I also made two types of potatoes, because she wanted a potato kugel and she wanted roasted potatoes. I brined the brisket, I braised the brisket, I brought the brisket. The only thing that she wanted to do was the matzo ball soup, because I can't for some reason get my matzo balls to stay together.\n\nJ: Yes. The first time she relinquished control, she's like, \"Go ahead, we're going to have Passover at your house.\" The really disappointing part was nobody remembered what other parts of the meal I made. They only remember that my matzo balls fall apart.\n\nCM: Honestly, they could have been Italians, I can tell you that. Wow. You just find the one thing, the one crack.\n\nJ: It just feels like someone who doesn't put in the type of care that I would into a matzo ball soup shouldn't be able to have the prize of matzo balls that stay together.\n\nCM: Tell me more about your mother-in-law's matzo balls. Flavor-wise, they're lacking, but describe a little bit more what they look like, how big are they? What is that texture?\n\nCM: That's a significant size to have floating in your bowl.\n\nCM: Okay, just level setting here. If you were to put a spoon through that matzo ball, what would it feel like?\n\nJ: I want to say if you condensed a honeycomb, it would look like that.\n\nCM: An open even network of kind of almost like bubbles.\n\nCM: Got it. When your mother-in-law serves her under-seasoned matzo balls, are you the only one who burns with righteous indignation that you all could have been having something better? Do other people comment about the look, taste, texture, et cetera?\n\nJ: I think it's an unspoken rule that everyone just says, \"Oh, it's good, it's good.\" When we clear the dishes, has everyone finished their soup? No.\n\nCM: Yeah. Okay. Couple of sort of possible scenarios. One, is there any chance that she's sabotaging your matzo balls?\n\nCM: Okay, shoot. Okay. All right, so that's a dead end. What if, just sort of spit-balling here, what if your inability to get your matzo balls to stay together is giving her purpose in life?\n\nJ: That's beautiful, but hear me out, Chris, nobody wants to eat anything bland. Just playing devil's advocate for peoples' taste buds here.\n\nCM: Yeah. Let's talk about what happens specifically with your matzo balls in the past. What recipe are you using? Yeah, where did you get it?\n\nJ: I've used several different recipes, and in the recipes I've used in the past, I've tried to separate the eggs, and whip the egg whites, so they're light and fluffy. I've used just egg yolks, and I don't know enough about culinary chemistry, so to speak, to know what ingredients were the culprit.\n\nI thought maybe it was the brand of seltzer water I was using. I thought maybe it was the brand of matzo I was using, and now I'm starting to think it's just I wasn't using enough eggs in any of the times I've ever made matzo balls.\n\nCM: That's certainly possible. The issue as you experienced it is that the matzo balls would fall apart during their initial simmer, is that correct? They would just sort of expand, open up, puff, but to the point where they just sort of fell apart?\n\nCM: Got it. What are we looking at in terms of the upcoming Passover? When you close your eyes and think about what is the best case scenario coming out of this experience and calling in, what does it look like for you?\n\nJ: Best case scenario, dream world, all personalities aside, my mother-in-law would eat the soup, she would embrace me and she would say, \"I'm so proud of you and your matzo balls this year, and I am just going to tell my grandchildren that your matzo balls on the first time that they actually stayed balls were heavenly.\"\n\nCM: Oh, this is fantastic. Kate Kassin wears a lot of hats here at Bon Appétit and Epicurious.\n\nKate Kassin: I do everything from liaise between all of the teams at BA, and make sure that the trains run on time, to manage a lot of our larger projects, like Best New Restaurants, Bake Club. I also just troll around the office, poke into the test kitchen. That's like at least an hour of my day.\n\nCM: Multiple times a day, Kate just materializes in the test kitchen and kind of sidles up to somebody, one of the food editors, is like, \"So, what are you cooking a day?\"\n\nKK: Sometimes it's to gossip, and sometimes it's because I'm hungry.\n\nCM: Fair. When we first got this question, I put a call-out to the staff to see who had strong opinions about matzo balls, and you had a pretty hot take, which I found very compelling. Before we hear it, I want to tell you about Janae, our caller. Janae has been with her husband for 10 years, and she converted to Judaism... I brought Kate up to speed on Janae's SOS, and her otherwise spotless cooking record. Thoughts.\n\nKK: My first thought is, wow to being good at making brisket. I think that is a feat in and of itself.\n\nKK: My second thought is that my mom tells this story all the time, she also converted to Judaism, and she tells this story of making matzo ball soup for her mother-in-law at the time, Grandma Debbie, and used matzo meal and made them from scratch. They were big, dense, awful chunks of matzo meal, and egg, and water, and nobody ate them, and since then, has turned to mix. It might be a little taboo to say on air, but I too have always turned to matzo ball mix.\n\nI think making your own broth is a wonderful thing. Then you control the narrative with what chicken you're using, what herbs you're using, what aromatics you're using. The matzo balls that come straight from the box are fluffy, and perfectly salty, and just easier to make.\n\nCM: You're telling me matzo ball mix is the preferred way forward here?\n\nKK: Yeah, I think when you're using matzo meal and making them from scratch, your chance of failing is higher than if you just go with the mix. Yes, saying that you use a mix may be frowned upon by some mothers-in-law, but it's foolproof, and I own it. They've quite literally studied how to make it, so in my mind, why not use their perfectly studied, perfectly engineered matzo ball, versus where you're trying to look at different ratios?\n\nThere are many ways to make this homemade, but I think really, the mix in homemade broth with maybe an added herb is a way to take the stress out, make your life easier, and still shine in other parts of your Seder. Honestly, the matzo balls are probably going to be better.\n\nCM: Okay. Listen, I feel compelled to offer her two paths. You can advocate strongly for the mix, and frankly, I'll probably back you up. However, I do feel compelled to say that we do have some recipes for matzo balls on the site that are worth checking out for the theory and the ratios behind them as much as anything else.\n\nShe's tried so many times to get this right. Anyway, let's talk her through both options and see what she thinks. We're going to take a short break. When we get back, Kate and I get Janae back on the line. Welcome back, Janae. How has everything been?\n\nCM: I've been doing okay. I am joined here by my colleague, Kate Kassin. Hi, Kate.\n\nCM: Kate is pretty much a matzo ball expert as far as I'm concerned, and certainly as compared to me. Janae, I wanted to bring Kate into this conversation because I put a call-out to our staff, asking who had strong feelings on matzo balls, and Kate responded right away with kind of a hot take. Kate, I would love if you could jump in and tell us more about your POV on matzo balls.\n\nKK: I was not the only one with this POV, just to clarify. I believe that matzo ball should be made with mix. I grew up on matzo ball mix, and since I've inherited the task of making matzo balls both for Passover and just when we're in the mood, I believe that mix is the way to go for the perfect fluffy, salty, light, but still having heft to it, matzo ball.\n\nCM: Does this sound like blasphemy? Are you outraged? Are you about to hang up and put in a call over to Food and Wine to see if they have better advice? What's happening in your brain right now?\n\nJ: Well, two things are happening in my brain, actually. I'm outraged, but not at you guys. I'm outraged, because I feel like you guys just outed my mother-in-law's secret. That's probably what she's doing.\n\nCM: She's on line two. Yeah, listen, in parsing out the ingredients on a matzo ball mix, like Kate, what are we looking at? It's matzo meal?\n\nCM: Right. Well, so even in the mix, the way that you prepare it is you're adding fresh eggs to it. It usually has a little bit of chemical leavener, some seasonings. Kate, is there one that you prefer? It sounded like there were two that you've used.\n\nKK: Yeah, there's Manischewitz, which everyone knows. They actually rebranded their packaging as of late.\n\nKK: Yeah, and then there's Streit's, if I'm pronouncing that correctly, it's S-T-R-E-I-T apostrophe S. I slightly prefer that one, but they're both very similar if you're looking at the ingredients and what you're adding in.\n\nCM: You've got some options here. We want to pitch you on, listen, for the ultimate and foolproof matzo balls, Kate fully endorses mix. Also, Emma LaPerouc, one of our cooking editors, she fully endorses mix, and these are not people who are afraid to make a recipe from scratch.\n\nKK: Something I will note before we get into it is that I still make a chicken stock from scratch. I think-\n\nKK: What's really nice is obviously, you're having people over, you don't want them to just think that you dumped a few cans of chicken broth and some mix, which still requires some effort. They're not coming frozen. You're adding in eggs and oil, and you're putting them into walnut sized balls, and boiling them.\n\nThere's still effort there, but I think what's kind of a nice balance is, okay, maybe you're not making the matzo balls from scratch, but you are making the chicken stock from scratch.\n\nCM: That's where I think you can kind of crush this. The recipe that I wanted to shout out for both matzo balls and for the actual broth itself is by Molly Baz, a former colleague here. Her matzo balls are called No-Nonsense Matzo Balls on BonAppétit.com, and the recipe that has both the broth and matzo balls is just called Matzo Ball Soup. We'll link to both of these in our show notes.\n\nOne of the things that I think really sets her broth apart is she's using a base of roasted chicken wings to get really nice richness and color to the broth. In addition, she's simmering some chicken legs in that prepared broth for nice, shreddy, tender, rich meat, and further kind of reinforcement of that broth.\n\nShe's got some aromatic veg, she's got a parsnip in there, which, listen, that would automatically disqualify it for me on any other day, but I'm feeling generous, and if you want to put parsnip in there, I can't physically restrain you from doing that, but everything else really checks out, carrots, parsley, black pepper-\n\nCM: The world's most overrated vegetable, to the extent that anybody should even pause to think about it.\n\nKK: Parsnips add a lot to soup. They're also wonderful and other-\n\nJ: What do they add? What positive things do they add? I have parsnips.\n\nKK: I think if you were to taste a parsnip and a carrot side by side, there's an earthiness to a parsnip that I think you're just calling for one of them, that I think it adds a really nice dimension to the soup.\n\nCM: I'd say the parsnip flavor is more sharply rooty, as opposed to more benign, buttery sweetness of a carrot. I don't have actually an issue with the flavor of parsnip as much as actually eating one. I just find them to have, usually they have a very woody core. I don't know, they just taste like a kind of slightly crappy carrot to me.\n\nKK: The beauty here is you're not eating the parsnip.\n\nCM: Right, yeah. It's kind of in there for vibes as much as anything. All that to say, sorry, I didn't mean to derail us, but it's a really, really wonderful broth, and I think the other move here, so number one, make your own broth and really being intentional about it is going to set your soup apart. Number two, simmering the matzo balls separately from the broth in simmering salted water.\n\nCM: Before they go into the broth. I think there's a number of different reasons why this makes sense. Number one, you've worked really hard to make a beautiful, maybe not crystal clear broth, but you don't need to muddy it with a dumpling that is simmering in that liquid, potentially making it cloudier.\n\nAlso, if there is any issue with them falling apart, you're not going to be in a situation where you have to kind of do a lot of straining to bring that broth back.\n\nKK: By having your beautifully simmering broth on the stove top, you're signaling to everyone there that you made that chicken stock.\n\nKK: You don't have to strain everything out. You can really show like, \"Look at me. I made this from scratch.\"\n\nCM: We found we had two matzo ball recipes of note, okay, at Bon Appétit. Both of them, the proportions were essentially identical. What was interesting to us is as compared to the recipe you were using, at least the one that you called out, was kind of like two eggs to a hundred some odd grams of matzo meal. Ours comparatively use a lot more egg. I think number one, you have a hydration issue in your matzo balls. I'm sure you're glowing.\n\nJ: The first question was the walnut-sized ball. Does that play a role in how they function in the soup? Were my matzo balls too big?\n\nKK: No. Actually, what I meant by that is that when you are using a matzo ball mix, they go from very, very small to very, very big, because they're absorbing the water that you're boiling them in.\n\nCM: There is a little bit of that chemical leavening in there, so they are going to want to expand a little bit.\n\nKK: The walnut size I mean is when you're rolling the mix that then has the oil and the egg in them, because they really like triple in size.\n\nKK: Yeah. That being said, I will say that people grew up with different sized matzo balls. I have some friends who had three smaller ones, and some friends who grew up with like, you get a ladle of soup and a big ball in the middle. Obviously, there's some flexibility there as well.\n\nJ: Okay. Then my second question was the hydration ratio. I didn't realize that eggs provided hydration to a dough, I guess?\n\nJ: What would be the egg to flour ratio for proper hydration in this application?\n\nCM: Totally, yeah. In the matzo ball recipe from Molly Baz, for the matzo dough, I've got six large eggs to 176 grams of matzo meal, as opposed to the recipe you've used, which is two eggs to 140 grams, obviously with a few other ingredients in the mix as well.\n\nThe eggs here are also going to be one of the things that creates stability in that dough as it cooks, as the proteins and the egg coagulate and set, which is also, they're also going to want to expand to a certain degree during that cooking process.\n\nCM: They certainly are. Hold on. We sent Janae off to decide how to proceed. Will she aim for from-scratch matzo balls, or back on a reliable store-bought mix? We'll find out after one more break. Hey, Janae, how are you doing?\n\nCM: Doing all right. I'm joined once again by Kate Kassin. Kate, how are you?\n\nKK: It is sunny and 60 degrees today, so I'm delightful.\n\nCM: All right. Well, listen, let's get into it. Janae, we know you made matzo balls of some sort, but the devil's in the details, as they say, right? What did you end up trying? Did you do from scratch, or did you try the mix?\n\nJ: I have to admit that I didn't have much interest in trying the mix.\n\nJ: I'm sorry. It's just more fun to do things from scratch. It was more so the title of Molly Baz's recipe, you can't turn down a recipe called No-Nonsense Matzo Balls. That's what I went with.\n\nCM: All right, so you were into it. Listen, you seemed like somebody who was willing to pull out the stomps. Walk me through it. What was the process like, and when did you start noticing any differences, if you noticed any from your previous attempts?\n\nJ: I think the biggest difference I noticed was the, I guess I'm going to call it a dough. It seems more yellow, and it looked different, it felt different. It was just evident that I guess it was more hydrated now that I added additional eggs. Yeah, it looked different from, as soon as it came together, I put it in the fridge. When I took it out of the fridge, it was really dense.\n\nIt was not nearly as dense any other time that I tried it. I was really nervous as I started to form the balls because of how compact it was. I was like, \"Oh, my god, these are going to be sinkers. My mother-in-law is going to be like, 'You're never doing this again.'\"\n\nKK: No. If something floats or it sinks, that's not a Jewish term, that's like a-\n\nCM: Okay, I thought maybe that was a matzo ball kind of thing.\n\nCM: All right, good. All right, just trying to catch up here. Hold on. When you say dense, talk to me more about this consistency.\n\nJ: The first couple of times I attempted to make matzo balls, it was really loose, and it would slide off. I wear gloves when I form things. It would slide off the glove, and as I'm forming them, they would be drips of plate in different places. It was not as nearly as loose. When I picked it up if, I didn't do this, but if I flipped my hand over, I'm sure it would've took a second to actually let gravity fall.\n\nJ: I could tell from as soon as I took it out of the fridge, like, \"Oh, that's going to stay together.\"\n\nCM: It seems to me most likely because of the increased hydration of your matzo ball dough, your matzo was actually hydrated, as opposed to what was happening before, where it was kind of holding together-ish, but there was still essentially dry matzo with liquid, and it hadn't fully bound together.\n\nJ: Which is so bizarre of a concept for a home cook to think about, because before when I made it, the dough was visibly wet, but when I saw it this time around, it looked like cement had just been plopped into front of me. It was so thick. It didn't look wet, it looked gritty. It just looked so vastly different from what I was doing before. I was very surprised. I have a picture.\n\nCM: Oh yeah, yeah, yeah. Okay, great. Kate, how are these looking to you, just as balls of dough in a catering aluminum pan?\n\nCM: Wow. That's the dough. When you say you were nervous, were you canceling plans? Were you making phone calls, or were you just kind of stoically pushing through, but despite your misgivings?\n\nJ: Well, I was already making dinner, so if the matzo balls didn't work out, we were just going to eat no matzo ball soup with dinner. I felt confident that they were going to hold together, because I got the recipe from Bon Appétit, so I was very confident, but I was nervous about them being like dense matzo balls rather than the light, fluffy ones that my mother-in-law would serve. I quickly realized, and I had to step away from the stove to not push my anxiety into the balls.\n\nI stepped away from the stove for about 15 minutes. I came back and I was like, \"Wow, they look great.\" There were little tiny water bubbles around each of them. I took, so this is at 15 minutes, I took a very, very gentle spoon, and I kind of poked at it to see if it would bounce, and they were very buoyant. They weren't to the point of rolling over yet. I knew, \"Okay, let me let them do their thing.\"\n\nI stepped away again, I came back about 30 minutes into the cook, and they were solidly together. I did that same tap with a spoon of one ball. It kind of like toddled to one side, teetered to the other side. Then I let it alone. Then about 45 minutes into the cook, I was confident that the balls were not going to fall apart at all.\n\nCM: All right, so hit us with it. Did they ever fall apart?\n\nJ: Nope. Only fell apart when I took my spoon to eat them, and they were delicious. They were so fluffy, and I didn't realize before how much egg I was tasting when I was eating matzo balls. The whole thing just feels like you just inflated a cooked egg.\n\nKK: I think that's also why whenever I eat matzo ball soup, they are pretty filling, because it's not just matzo meal and water.\n\nCM: Oh, gosh. I'm looking at a photo of them expanded in the water, and we're looking at them and these are, you can just tell they have wildly expanded.\n\nCM: Yeah, they're herbaceous. You get the definition of the dill inside the mixture. They look puffed, and yet they don't look like they're just going to fall apart on you either. These look great.\n\nJ: They were delicate, but they were solidly congealed, if that's the correct term. They were delicate but still a ball.\n\nCM: Were you cooking these in broth or cooking them in salted water?\n\nJ: I started to think about if I were to cook them in just salted water, would that dilute them? I got really nervous and I took some of the broth that I had the soup stock make, and I put that into my salted water. That made them really salty also, I think.\n\nI think I might reduce the amount of salt, but I still will do cooking the matzo balls themselves in just the salted water or just chicken broth, and then adding them to the entire soup with the carrots, the onions, the celery, and all of those things.\n\nKK: Ah, so then when you served the soup, was it broth with the carrots, with the onions, with the celery still intact?\n\nCM: Can I dare ask, how was the flavor and overall experience of these matzo balls compared to what your mother-in-law has served?\n\nJ: There was vastly more salt. There was a nice salinity to them. You could taste the salt. I'm not sure if that was the tablespoon and a half of salt that I put in the actual mixture of the matzo balls, for just-\n\nJ: Guys, I'm a friend of the show. I know you guys endorse Diamond Crystal.\n\nCM: We hope people are paying attention, but not everybody does their homework the way you do, Janae, okay?\n\nCM: Gold star. Thank you, honestly, because we were about to plotz over here, okay?\n\nCM: Okay, so what does this mean? Is this on deck for your Seder this year?\n\nJ: Absolutely. For sure. I will be making matzo ball soup with matzo balls this year.\n\nKK: As someone who, maybe it's that I've been too afraid to just take the plunge and try a new recipe and not just fall back on my mix, I'm going to a Seder this year and not hosting, but you've inspired me to try these No-Nonsense Matzo Balls, and really maybe leave the mix behind.\n\nCM: Will you report back and let us know what happens, Kate?\n\nKK: Yeah, I'll talk to you guys in a year and a month.\n\nCM: If you have a dinner emergency on your hands, write to us at podcasts@bonappetit.com, or leave us a voice message at 212-286-SOS1, that's 212-286-7071. We'd love to feature your question on the show. If you enjoyed this episode, please give us a rating and review on your podcast app of choice, and hit that follow button so you never miss an episode.\n\nYou can find the recipes mentioned on today's episode linked in our show notes and on the Epicurious app, brought to you by Condé Nast. Just search Epicurious in the app store and download today. If you're not yet a subscriber, you can sign up today for a 30-day free trial in the app or at bonappetit.com. Thanks for listening to Dinner SOS. I'm your host, Chris Morocco. My co-host this week is Kate Kassin. Our Senior Producer is Michele O'Brien. Peyton Hayes is our Associate Producer. Cameron Foos is our Assistant Producer.\n\nResearch editing by Marissa Wolkenberg. Jake Lummus, and Vince Fairchild are our studio engineers. This episode was mixed by Amar Lal at Macrosound. Jordan Bell is our Executive Producer. Chris Bannon is Condé Nast's Head of Global Audio. Next week, Gillian is working from home, and it's harder to get out to the store than it used to be.\n\nGillian: I'd love to have things in the pantry, things in the freezer or the fridge that can be dinner when I close my laptop.\n\n© 2025 Condé Nast. All rights reserved. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices",
    "category": "Unusual Food News",
    "link": "https://www.bonappetit.com/story/i-need-fool-proof-matzo-ball-recipes",
    "title": "I Need Fool-Proof Matzo Ball Recipes"
  },
  {
    "body": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More\n\nResearchers at Together AI and Agentica have released DeepCoder-14B, a new coding model that delivers impressive performance comparable to leading proprietary models like OpenAI’s o3-mini. \n\nBuilt on top of DeepSeek-R1, this model gives more flexibility to integrate high-performance code generation and reasoning capabilities into real-world applications. Importantly, the teams have fully open-sourced the model, its training data, code, logs and system optimizations, which can help researchers improve their work and accelerate progress.\n\nThe research team’s experiments show that DeepCoder-14B performs strongly across several challenging coding benchmarks, including LiveCodeBench (LCB), Codeforces and HumanEval+.\n\n“Our model demonstrates strong performance across all coding benchmarks… comparable to the performance of o3-mini (low) and o1,” the researchers write in a blog post that describes the model.\n\nInterestingly, despite being trained primarily on coding tasks, the model shows improved mathematical reasoning, scoring 73.8% on the AIME 2024 benchmark, a 4.1% improvement over its base model (DeepSeek-R1-Distill-Qwen-14B). This suggests that the reasoning skills developed through RL on code can be generalized effectively to other domains.\n\nThe most striking aspect is achieving this level of performance with only 14 billion parameters. This makes DeepCoder significantly smaller and potentially more efficient to run than many frontier models.\n\nWhile developing the model, the researchers solved some of the key challenges in training coding models using reinforcement learning (RL).\n\nThe first challenge was curating the training data. Reinforcement learning requires reliable reward signals indicating the model’s output is correct. As the researchers point out, “Unlike math—where abundant high-quality, verifiable data is readily available on the Internet—the coding domain suffers from a relative scarcity of such data.” \n\nTo address this problem, the DeepCoder team implemented a strict pipeline that gathers examples from different datasets and filters them for validity, complexity and duplication. This process yielded 24,000 high-quality problems, providing a solid foundation for effective RL training.\n\nThe team also designed a straightforward reward function that only provides a positive signal if the generated code passes all sampled unit tests for the problem within a specific time limit. Combined with the high-quality training examples, this outcome-focused reward system prevents the model from learning tricks like printing memorized answers for public tests or optimizing for simple edge cases without solving the core problem.\n\nThe model’s core training algorithm is based on Group Relative Policy Optimization (GRPO), a reinforcement learning algorithm that proved very successful in DeepSeek-R1. However, the team made several modifications to the algorithm to make it more stable and allow the model to continue improving as the training extends for a longer time.\n\nFinally, the team extended the model’s context window iteratively, first training it on shorter reasoning sequences and gradually increasing the length. They also developed a filtering method to avoid penalizing the model when it created reasoning chains that exceeded the context limits when solving a hard prompt. \n\nThe researchers explain the core idea: “To preserve long-context reasoning while enabling efficient training, we incorporated overlong filtering… This technique masks out truncated sequences during training so that models aren’t penalized for generating thoughtful but lengthy outputs that exceed the current context limit.” \n\nThe training was gradually scaled from a 16K to a 32K context window, and the resulting model could also solve problems that required up to 64K tokens.\n\nTraining large models with RL, especially on tasks requiring long generated sequences like coding or complex reasoning, is computationally intensive and slow. A major bottleneck is the “sampling” step, where the model generates potentially thousands of tokens per example in the batch. Variations in response length mean some responses finish much later than others, leaving GPUs idle and slowing down the entire training loop. \n\nTo accelerate this, the team developed verl-pipeline, an optimized extension of the open-source verl library for reinforcement learning from human feedback (RLHF). The key innovation, which they call “One-Off Pipelining,” rearranges the response sampling and model updates to reduce the bottlenecks and accelerator idle time.\n\nTheir experiments showed that one-off pipelining provided up to a 2x speedup for coding RL tasks compared to baseline implementations. This optimization was crucial for training DeepCoder within a reasonable timeframe (2.5 weeks on 32 H100s) and is now open-sourced as part of verl-pipeline for the community to use and build upon. \n\nThe researchers have made all the artifacts for training and running DeepCoder-14B available on GitHub and Hugging Face under a permissive license.\n\n“By fully sharing our dataset, code, and training recipe, we empower the community to reproduce our work and make RL training accessible to all,” the researchers write.\n\nDeepCoder-14B powerfully illustrates a broader, accelerating trend in the AI landscape: the rise of highly capable yet efficient and openly accessible models. \n\nFor the enterprise world, this shift signifies more options and higher accessibility of advanced models. Cutting-edge performance is no longer solely the domain of hyperscalers or those willing to pay premium API fees. Models like DeepCoder can empower organizations of all sizes to leverage sophisticated code generation and reasoning, customize solutions to their specific needs, and securely deploy them within their environments. \n\nThis trend can lower the barrier to entry for AI adoption and foster a more competitive and innovative ecosystem, where progress is driven through open source collaboration.\n\nIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\n\n\n\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\n\nJoin leaders in enterprise AI for networking, insights, and engaging conversations at the upcoming stops of our AI Impact Tour. See if we're coming to your area!\n\n\n\t\t\t\t\t\t\t\t\t\tThanks for subscribing. Check out more VB newsletters here.\n\t\t\t\t\t\t\t\t\t",
    "category": "Technology",
    "link": "https://venturebeat.com/ai/deepcoder-delivers-top-coding-performance-in-efficient-14b-open-model/",
    "title": "DeepCoder delivers top coding performance in efficient 14B open model"
  },
  {
    "body": "We are entering a golden era of quarterback play in the NFL, with nine quarterback prospects drafted in the first round since 2023. Though the draft has been littered with hits and misses on Day 1, the emergence of Jayden Daniels, CJ Stroud and Bo Nix as turnaround specialists has encouraged the NFL scouting community to invest heavily in the position to transform a downtrodden franchise into a playoff contender. \n\nWith Cam Ward and Shedeur Sanders set to enter the league as marquee prospects with franchise quarterback potential, it is the perfect time to re-rank the top QBs since 2023 to see how the duo stacks up against the NFL's newest QB1s. After reviewing my notes and old scouting reports, here is how I'd rank the league's top signal-callers from the three latest draft classes. \n\n11. Anthony Richardson, Florida No. 4 overall pick in 2023 by the Colts\n\nThe workout warrior dazzled scouts as a freak athlete with exceptional talent and tools. Though his production and performance as a collegian did not match his potential, evaluators were willing to roll on the 6-foot-4, 245-pounder with 4.43 speed and limitless range as a passer. In a league where \"run-around\" playmakers like Josh Allen and Lamar Jackson have earned MVP honors, Richardson's superhero talents made him one of the draft board's biggest \"boom-or-bust\" prospects. \n\n10. Bo Nix, OregonNo. 12 overall pick in 2024 by the Broncos \n\nDespite a spectacular two-year run at Oregon that showcased his talents as an efficient rhythm passer with pinpoint accuracy, scouts questioned Nix's ability to transform into a high-end starter after witnessing his woes as a legacy QB1 at Auburn. Though Nix showed significant improvement throughout a five-year journey that featured 61 career starts, the lowlights from his Auburn stint (three-year starter from 2019 to 2021) and average tools (size, arm talent and athleticism) made it hard for some evaluators to give him a top grade at the end of the pre-draft process. \n\n9. JJ McCarthy, Michigan No. 10 overall pick in 2024 by the Vikings\n\nAs the director of an ultra-conservative offense, McCarthy was a tough evaluation for scouts looking for a franchise quarterback with \"take over the game\" skills. Despite finishing his Michigan career with a 27-1 record and a national title, the 6-foot-4, 219-pounder did not get the credit he deserved as a clutch playmaker with a resume littered with big-time throws and winning plays. McCarthy's pinpoint accuracy and crafty running skills sparked a run-heavy offense that relied on the quarterback to make crucial plays in \"against all odds\" situations. Armed with \"plus\" arm talent, athleticism and a high IQ, the Michigan standout forced evaluators to choose between projection and production when affixing a grade to the end of the scouting report.\n\n8. Shedeur Sanders, Colorado Projected first-round pick in 2025\n\nThe most polarizing quarterback prospect in the past 20 years is the prototypical pocket passer that most coaches have coveted since the AFL-NFL merger in 1970. As a four-year starter at Jackson State and Colorado, Sanders picked apart defenses with surgical precision as a quick-rhythm passer with outstanding accuracy and ball placement. Although he lacks elite arm talent and has shown limited mobility, the fourth-year senior overcame his deficiencies with excellent anticipation, timing and touch on his throws into tight windows. With a swagger and confidence that boosts his game and those around him, Sanders' performance and production exceeds his natural talent as a player. \n\n7. Cam Ward, Miami Projected first-round pick in 2025\n\nThe ultra-confident gunslinger skyrocketed up the chart after a sensational senior season at Miami that capped off a three-stop college career that spanned five seasons. Ward's talent, tools and tenacity captivated the scouting community as a franchise-caliber quarterback with potential to turn around a downtrodden squad. As the 6-foot-2, 219-pounder has progressed from a zero-star recruit to the presumptive No. 1 overall pick in the draft, evaluators are smitten by a confident playmaker with elite tools (arm talent and athleticism) and a no-flinch attitude that garners respect within an NFL locker room. \n\n6. Michael Penix Jr., Washington No. 8 overall pick in 2024 by the Falcons\n\nThe left-handed assassin was one of the biggest surprises in the 2024 class. He climbed to top-five consideration by the end of the pre-draft process due to his immense talent and potential as a gunslinger with exceptional arm strength, range and accuracy. As a deep-ball specialist and big-play hunter, Penix terrorized opponents with an \"attack\" mentality and aggressive game that forced defenders to defend every blade of grass from sideline to sideline and end line to end line. While skeptics questioned his advanced age (24), injury history (three season-ending injuries in college), and athleticism after an arduous journey at Indiana and Washington, the adversity helped him transform into a flamethrower with franchise quarterback potential. \n\n5. Bryce Young, AlabamaNo. 1 overall pick in 2023 by the Panthers\n\nThe diminutive passer forced the NFL scouting community to rethink its long-established standards for franchise quarterbacks. Measuring in at 5-foot-10, 204 pounds, the Alabama standout impressed scouts with his pinpoint accuracy and clutch playmaking ability. Young dazzled in dramatic moments, delivering dime after dime with the game hanging in the balance. Moreover, he displayed the intangibles (IQ, poise, patience, and discipline) to accentuate a set of skills that enabled him to win, utilizing his exceptional touch, timing and anticipation to squeeze throws into tight windows. Though his substandard size could hinder his long-term success, Young's premier pocket passing skills made him a hot commodity in scouting circles. \n\n4. Drake Maye, North Carolina No. 3 overall pick in 2024 by the Patriots\n\nIf scouts could build a franchise quarterback from scratch, Maye would be the prototype based on his size, arm talent and tools (IQ, awareness, and athleticism). The 6-foot-4, 223-pounder was viewed as a potential superstar based on his impressive flashes throughout his two-year run as a starter for the Tar Heels. From his dynamic improvisational skills to his \"plus\" arm talent, Maye gave off Josh Allen vibes when evaluators studied his game tape. While his ill-timed miscues would drive coaches and scouts crazy, it was easy to envision the young passer emerging as a superstar at the next level. \n\n3. Jayden Daniels, LSU No. 2 overall pick in 2024 by the Commanders\n\nThe fifth-year senior gradually improved from developmental prospect to a franchise player through the tough lessons that shaped him at Arizona State and LSU. Daniels entered the league as the best dual-threat quarterback prospect in NFL history after winning a Heisman Trophy due to his heroics as a mobile playmaker. The slender gunslinger exhibited elite traits, tossing darts from the pocket, while producing explosive plays on scrambles and designed quarterback runs. In addition, Daniels' superb deep ball accuracy forces defenders to defend the entire field. Given his success tormenting opponents with his arm and legs, the scouting community raved about his potential as a franchise player. \n\n2. C.J. Stroud, Ohio State  No. 2 overall pick in 2023 by the Texans\n\nThe most slept-on quarterback prospect in recent history exhibited elite traits as a traditional pocket passer. Stroud's impeccable timing and pinpoint passing skills made him a perfect fit for an offense built around a traditional pro-style passing game. With the Ohio State standout flashing outstanding anticipation on rhythm throws, it was easy for NFL coaches to build an offense around his talents. Although nitpickers questioned whether Stroud's limited athleticism would shrink the playbook, the crafty playmaker impressed skeptics with a stunning postseason performance (Georgia, 2022 Peach Bowl) that showcased his improvisational skills on the perimeter. \n\n1. Caleb Williams, USCNo. 1 overall pick in 2024 by the Bears\n\nTouted as a generational talent throughout his tenure at Oklahoma and USC, Williams was a shoo-in to come off the board as the No. 1 overall pick when he entered the draft. As an improvisational wizard with spectacular arm talent and running skills, the Heisman Trophy winner teased and tormented opponents as a dual-threat playmaker on the perimeter. Though his tendency to play \"hero ball\" led to a spate of turnovers that prompted concerns regarding his discipline and patience, Williams exhibited the franchise-caliber skills evaluators covet in QB1s. \n\nBucky Brooks is an NFL analyst for FOX Sports. He also breaks down the game for NFL Network and as a cohost of the \"Moving the Sticks\" podcast. Follow him on Twitter @BuckyBrooks.\n\nWant great stories delivered right to your inbox? Create or log in to your FOX Sports account, follow leagues, teams and players to receive a personalized newsletter daily.",
    "category": "Sports",
    "link": "https://www.foxsports.com/stories/nfl/ranking-11-best-qb-prospects-since-2023-how-do-cam-ward-shedeur-sanders-stack-up",
    "title": "Ranking the 11 best QB prospects since 2023: How do Cam Ward, Shedeur Sanders stack up?"
  },
  {
    "body": "In a cave overlooking the ocean on the southern coast of South Africa, archaeologists discovered thousands of stone tools, created by ancient humans roughly 20,000 years ago. By examining tiny details in the chipped edges of the blades and stones, archaeologists are able to tell how the tools were made. In a new study published in the Journal of Paleolithic Archaeology, researchers analyzed these stone tools and discussed how the different techniques used to make them hint at the ways that prehistoric people traveled, interacted, and shared their craft.\n\n\"This is an important insight into how people who lived in this region were living and hunting and responding to their environment,\" says Sara Watson, a postdoctoral scientist at the Field Museum's Negaunee Integrative Research Center and lead author of the study.\n\nDuring the period when these blades were made, between 24,000 and 12,000 years ago, the Earth was nearing the end of the last major ice age. Since so much of the Earth's water was frozen in glaciers and ice caps, the sea level was lower, and the region that's now the coast of South Africa was a few miles inland. \"Instead of being right on the water like they are today, these caves would have been near vast, open plains with large game animals like antelope,\" says Watson. \"People hunted those animals, and to do that, they developed new tools and weapons.\"\n\nThe caves, part of what archaeologists call the Robberg technocomplex, no longer overlook a plain -- they're in a towering cliff face over a rocky beach. \"It's a 75-foot climb up to the cave from the shoreline,\" says Watson. \"We had safety ropes and a staircase made of sandbags, and we had to be harnessed in while doing the excavation.\"\n\nEvery day, Watson and her colleagues made the climb with all their excavation and photography equipment, weighing up to 50 pounds per person. \"Since these are extremely, extremely old sites, from before the end of the last ice age, we had to be very careful with our excavation,\" says Watson. \"We used little tiny dental tools and mini trowels so that we could remove each little individual layer of sediment.\"\n\nBeneath ancient dust and dirt, Watson and her team found thousands of stone tools: small, sharp blades, as well as the larger pieces of rock from which these blades were chipped. The bigger rock that blades are made from is called a core. \"When your average person thinks about stone tools, they probably focus on the detached pieces, the blades and flakes. But the thing that is the most interesting to me is the core, because it shows us the particular methods and order of operations that people went through in order to make their tools,\" says Watson.\n\nWatson and her colleagues observed several distinct patterns of how the cores had been broken into smaller blades. \"In a lot of these technologies, the core reduction is very specific, and it's something that you are taught and learn, and that's where the social information is,\" says Watson. \"If we see specific methods of core reduction at multiple sites across the landscape, as an archaeologist, it tells me that these people were sharing ideas with one another.\"\n\nFor instance, one particular method of breaking tiny bladelets off of a core that Watson found in the Robberg caves is a style also found hundreds of miles away in places including Namibia and Lesotho. \"Same core reduction pattern, same intended product,\" says Watson. \"The pattern is repeated over and over and over again, which indicates that it is intentional and shared, rather than just a chance similarity.\"\n\nOverall, Watson says that the study reveals how much there still is to learn about the Robberg caves and the people who used them thousands of years ago. \"We have a very long and rich history as a species, and humans go back a lot farther in time than most people realize,\" says Watson. \"People living around the last ice age were very similar to people today.\"\n\nMaterials provided by Field Museum. Note: Content may be edited for style and length.\n\nStay informed with ScienceDaily's free email newsletter, updated daily and weekly. Or view our many newsfeeds in your RSS reader:\n\nKeep up to date with the latest news from ScienceDaily via social networks:\n\nTell us what you think of ScienceDaily -- we welcome both positive and negative comments. Have any problems using the site? Questions?",
    "category": "Science",
    "link": "https://www.sciencedaily.com/releases/2025/04/250409212539.htm",
    "title": "Ancient tools from a South African cave reveal connections between prehistoric people"
  },
  {
    "body": "Looks like you already have a subscription! You can verify your subscription or upgrade to LIFETIME HERE:\n\nYou are now leaving theCHIVE.com, click continue to proceed",
    "category": "Humor",
    "link": "https://thechive.com/humor/daily-evening-randomness-33-photos/?utm_postid=4953501&utm_editor=4953501_ben",
    "title": "Daily Evening Randomness (33 Photos)"
  },
  {
    "body": "The 12 signs of the zodiac all have their own strengths and weaknesses, and for some, bring hypercritical of themselves is definitely one of their bigger weaknesses.\n\nAnd while someone's zodiac sign doesn't guarantee they'll be hard on themselves, it isn't very surprising when the following three zodiac signs hold themselves to extremely high standards. Here's what to know.\n\nP.S. This would apply to anyone with any of the following signs as their sun, moon, and or rising sign.\n\nThe zodiac sign that is undoubtedly the hardest on themselves is Capricorn. Ruled by Saturn, the planet of discipline and responsibility, struggle is practically built into Capricorn's soul.\n\nThey have an extreme drive for achievement and success, with very high ambition and even higher standards for their professional goals. But of course, Cap is never satisfied, and as the continue to move the bar, they'll continue to be hard on themselves, too.\n\nThe second most likely sign to be hard on themselves is Scorpio. This brooding and intense sign takes themselves seriously, and as a fixed sign, they can also be rather stubborn. For Scorpio, who is constantly transforming themselves, keeping the pressure on is what drives their continuous reinvention.\n\nScorpio is always looking to dig deeper, and that includes how they look at and understand themselves. With their strong intuition and stronger sense of morals, Scorpio is always pushing themselves to the next level.\n\nAnd finally, we have Virgo as the third most likely sign to be hard on themselves. Perfectionists by nature, Virgo is virtually never satisfied, because as we all know, perfection doesn't exist—but don't bother telling a Virgo that!\n\nEven if they can never achieve ultimate perfection, you better believe a Virgo will do everything in their power to get as close to it as possible. Their mind operates by finding flaws and improving them, and that includes their own self image.\n\nEvery zodiac sign can be hard on themselves from time to time, and no matter you sign, it's important to remember to give yourself grace. If you're a Capricorn, Scorpio, or Virgo, you might want to give yourself even more grace than usual.\n\n*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.",
    "category": "Health",
    "link": "https://www.mindbodygreen.com/articles/these-3-zodiac-signs-are-most-likely-to-be-hard-on-themselves",
    "title": "This Zodiac Sign Tends To Be Their Own Worst Critic—Is It Yours?"
  },
  {
    "body": "The studio behind No Mercy, a recently released 3D visual novel featuring non-consensual sex and incest, has announced that it plans to remove the game entirely from Steam after the game attracted controversy online. Valve pulled  the game from the United Kingdom version of Steam after a government official slammed Valve for allowing No Mercy to be sold on the storefront. \n\nContent warning: This article includes references to rape, sexual assault, and incest. \n\nNo Mercy was released on March 22 on PC via Valve’s super popular digital gaming storefront Steam. The game is described by the developers as a “3D choice-driven adult Visual Novel with a huge focus on Incest and Male Domination.” \n\nIn the game, players discover that their mother has cheated on their dad and they are then told to “claim her for yourself.” This leads to multiple scenes involving the player forcing women, including their character’s own mother, to have sex with him. The game’s description on Steam includes this line: “Unveil her deepest secrets, subdue her, and make all women yours.”\n\nMany people online weren’t happy that Valve would allow No Mercy to be sold on Steam. An online petition demanding the game be removed reached over 10,000 signatures on Change.org. \n\nOn April 9, as spotted by GamesIndustry.biz, UK technology secretary Peter Kyle said that No Mercy was “deeply worrying” in comments made on British talk radio station LBC. He further explained that he expects “every  [tech company] to remove content as soon as they possibly can after being made aware of it. That’s what the [Online Safety Act] requires, it is what I require as a secretary of state, and it is certainly how we expect platforms who operate and have the privilege of access to British society, and British economy, to do.”\n\nNo Mercy is labeled as “Adults Only” and could only be bought using a credit card. The game is not rated by the ESRB or PEGI as Valve doesn’t require games to be rated by these groups to be sold on Steam. Following Kyle’s statements and increasing pressure online, No Mercy was removed from the UK as well as Australia and Canada, presumably by Valve.\n\nKotaku has reached out to Valve for more information. \n\nOn April 10, following all of this and the game being removed from some countries, Zerat Games—the developers behind No Mercy—posted a lengthy response to the controversy on Steam, addressing calls for the game’s delisting. In the statement the studio confirmed it was removing No Mercy from Steam but nonetheless defended the game, stating that real incest is “disgusting” but that things like that, rape, and male domination are nonetheless popular “kinks” for many. \n\n“I fully understand that for many people such things may be disgusting, but during sex, people should really do what they want, as long as they don’t harm anyone,” said Zerat Games.\n\n“If after reading [our statement] you still believe that such a game should not have been created, then we sincerely apologize to you. At the same time, we would like you to be a bit more open to human fetishes that don’t harm anyone, even though they may seem disgusting to you. This is still just a game, and although many people are trying to make it into something more, it remains and will continue to be a game.”\n\nAs of 4:30 PM EST on Thursday, No Mercy is still available to purchase on Steam. Players who bought the game will be able to continue to download, install, and play No Mercy after it’s removed. ",
    "category": "Gaming",
    "link": "https://kotaku.com/no-mercy-sexual-assault-incest-sim-steam-removed-uk-pc-1851775725",
    "title": "Devs Behind Controversial Sexual Assault Game Defend It, But Say They're Pulling It From Steam Anyway"
  },
  {
    "body": "\n\tAfter telling Rolling Stone that his last single, “Baby (Is It a Crime)” had the biggest debut streaming day of his career, Rema is back with “Bout U.” The track is led by punchy electric guitar (the single artwork looks indebted to one of the greatest guitarists of all time, Prince) and finds Rema deeply smitten with a “blazing” woman. “Hold my hand girl/Time is running out,” he croons over layers of harmonized ad-libs.  “Girl lets make it count/This love affair got me living in the clouds/Please don’t let me down.” Rema co-produced “Bout U” with his frequent collaborator London.\n\n\n\tAs one of Rolling Stone‘s Future of Music cover stars last month, Rema said his ideal partner is peaceful, loyal, and transparent. At the time, he wasn’t dating anyone, but shared that he would like to get married one day. “The timeline matters, but I don’t specifically have a time. But I feel like it’s very important, especially because I am not in a big family,” he said, thinking back to the way he, his mother, and his siblings were ostracized after his dad died when he was eight years old.\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\tTrending Stories\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tInside Elon Musk’s Gleeful Destruction of the Government\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\t'The Tensions Were So Crazy': An Oral History of 'What About Bob?'\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tWife of Weezer's Bassist Shot in Officer-Involved Shooting, Booked for Attempted Murder: Police\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tNoah Wyle Feels 'Profoundly Sad' Amid Michael Crichton Estate Lawsuit Over Alleged 'ER' Rip\t\t\n\t\n\n\n\n\n\n\n\n\n\n\tRema commanded a lively crowd at the Moody Theatre headlining the fourth night of Rolling Stone’s Future of Music showcase at SXSW in Austin. “Africa is the future of music because it’s unique and it knows no boundary,” he said in the clip that ushered him on stage, filmed on the set of his Future of Music cover shoot. His issue makes him the first Black African solo star to be featured on the cover and the first Afrobeats act to earn the distinction in the magazine’s history.\n\n\n\tRema will make his Coachella debut this Sunday, April 13, on the Mojave Stage at 6:40 p.m. PT. As a stop on his upcoming world tour, he’ll make his debut at Madison Square Garden in New York City on May 3. \n\nWe want to hear it. Send us a tip using our anonymous form.\n\nRolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved.",
    "category": "Entertainment",
    "link": "https://www.rollingstone.com/music/music-news/rema-bout-u-1235315003/",
    "title": "Rema Is ‘Living in the Clouds’ on New Single ‘Bout U’"
  }
]